zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef HAL_NXP_DTS_NXP_S32_S32K56X_437BGA_PINCTRL_H_
#define HAL_NXP_DTS_NXP_S32_S32K56X_437BGA_PINCTRL_H_

#include <zephyr/dt-bindings/pinctrl/nxp-siul2-pinctrl.h>

/* SIUL0 */
#define PA0_SIUL0_EIRQ0                 NXP_SIUL2_PINMUX(0, 0, 0, 0, 0, 1)
#define PA1_SIUL0_EIRQ1                 NXP_SIUL2_PINMUX(0, 0, 1, 0, 1, 1)
#define PA2_SIUL0_EIRQ10                NXP_SIUL2_PINMUX(0, 0, 2, 0, 10, 1)
#define PA3_SIUL0_EIRQ9                 NXP_SIUL2_PINMUX(0, 0, 3, 0, 9, 1)
#define PA4_SIUL0_EIRQ4                 NXP_SIUL2_PINMUX(0, 0, 4, 0, 4, 1)
#define PA8_SIUL0_EIRQ8                 NXP_SIUL2_PINMUX(0, 0, 8, 0, 8, 1)
#define PA10_SIUL0_EIRQ6                NXP_SIUL2_PINMUX(0, 0, 10, 0, 6, 1)
#define PA11_SIUL0_EIRQ4                NXP_SIUL2_PINMUX(0, 0, 11, 0, 4, 2)
#define PA12_SIUL0_EIRQ12               NXP_SIUL2_PINMUX(0, 0, 12, 0, 12, 1)
#define PA13_SIUL0_EIRQ5                NXP_SIUL2_PINMUX(0, 0, 13, 0, 5, 1)
#define PA14_SIUL0_EIRQ13               NXP_SIUL2_PINMUX(0, 0, 14, 0, 13, 1)
#define PB1_SIUL0_EIRQ0                 NXP_SIUL2_PINMUX(0, 0, 17, 0, 0, 2)
#define PB2_SIUL0_EIRQ5                 NXP_SIUL2_PINMUX(0, 0, 18, 0, 5, 2)
#define PB3_SIUL0_EIRQ9                 NXP_SIUL2_PINMUX(0, 0, 19, 0, 9, 2)
#define PB4_SIUL0_EIRQ11                NXP_SIUL2_PINMUX(0, 0, 20, 0, 11, 1)
#define PB5_SIUL0_EIRQ12                NXP_SIUL2_PINMUX(0, 0, 21, 0, 12, 2)
#define PB6_SIUL0_EIRQ14                NXP_SIUL2_PINMUX(0, 0, 22, 0, 14, 1)
#define PB7_SIUL0_EIRQ15                NXP_SIUL2_PINMUX(0, 0, 23, 0, 15, 1)
#define PB10_SIUL0_EIRQ7                NXP_SIUL2_PINMUX(0, 0, 26, 0, 7, 1)
#define PB12_SIUL0_EIRQ0                NXP_SIUL2_PINMUX(0, 0, 28, 0, 0, 3)
#define PB13_SIUL0_EIRQ13               NXP_SIUL2_PINMUX(0, 0, 29, 0, 13, 2)
#define PB14_SIUL0_EIRQ11               NXP_SIUL2_PINMUX(0, 0, 30, 0, 11, 2)
#define PC1_SIUL0_EIRQ2                 NXP_SIUL2_PINMUX(0, 0, 33, 0, 2, 1)
#define PC3_SIUL0_EIRQ7                 NXP_SIUL2_PINMUX(0, 0, 35, 0, 7, 2)
#define PC4_SIUL0_EIRQ1                 NXP_SIUL2_PINMUX(0, 0, 36, 0, 1, 2)
#define PC7_SIUL0_EIRQ8                 NXP_SIUL2_PINMUX(0, 0, 39, 0, 8, 2)
#define PC10_SIUL0_EIRQ15               NXP_SIUL2_PINMUX(0, 0, 42, 0, 15, 2)
#define PC11_SIUL0_EIRQ2                NXP_SIUL2_PINMUX(0, 0, 43, 0, 2, 2)
#define PC12_SIUL0_EIRQ10               NXP_SIUL2_PINMUX(0, 0, 44, 0, 10, 2)
#define PC13_SIUL0_EIRQ3                NXP_SIUL2_PINMUX(0, 0, 45, 0, 3, 1)
#define PC14_SIUL0_EIRQ6                NXP_SIUL2_PINMUX(0, 0, 46, 0, 6, 2)
#define PC15_SIUL0_EIRQ0                NXP_SIUL2_PINMUX(0, 0, 47, 0, 0, 4)
#define PD1_SIUL0_EIRQ1                 NXP_SIUL2_PINMUX(0, 0, 49, 0, 1, 3)
#define PD5_SIUL0_EIRQ8                 NXP_SIUL2_PINMUX(0, 0, 53, 0, 8, 3)
#define PD6_SIUL0_EIRQ9                 NXP_SIUL2_PINMUX(0, 0, 54, 0, 9, 4)
#define PD9_SIUL0_EIRQ10                NXP_SIUL2_PINMUX(0, 0, 57, 0, 10, 3)
#define PD10_SIUL0_EIRQ14               NXP_SIUL2_PINMUX(0, 0, 58, 0, 14, 2)
#define PD15_SIUL0_EIRQ11               NXP_SIUL2_PINMUX(0, 0, 63, 0, 11, 3)
#define PE0_SIUL0_EIRQ12                NXP_SIUL2_PINMUX(0, 0, 64, 0, 12, 3)
#define PE1_SIUL0_EIRQ4                 NXP_SIUL2_PINMUX(0, 0, 65, 0, 4, 3)
#define PE2_SIUL0_EIRQ5                 NXP_SIUL2_PINMUX(0, 0, 66, 0, 5, 3)
#define PE3_SIUL0_EIRQ3                 NXP_SIUL2_PINMUX(0, 0, 67, 0, 3, 2)
#define PE4_SIUL0_EIRQ6                 NXP_SIUL2_PINMUX(0, 0, 68, 0, 6, 3)
#define PE5_SIUL0_EIRQ9                 NXP_SIUL2_PINMUX(0, 0, 69, 0, 9, 3)
#define PE7_SIUL0_EIRQ2                 NXP_SIUL2_PINMUX(0, 0, 71, 0, 2, 3)
#define PE9_SIUL0_EIRQ7                 NXP_SIUL2_PINMUX(0, 0, 73, 0, 7, 3)
#define PE11_SIUL0_EIRQ12               NXP_SIUL2_PINMUX(0, 0, 75, 0, 12, 4)
#define PE13_SIUL0_EIRQ15               NXP_SIUL2_PINMUX(0, 0, 77, 0, 15, 3)

/* LPUART1 */
#define PA0_LPUART1_TX_O                NXP_SIUL2_PINMUX(0, 0, 0, 1, 0, 0)
#define PA0_LPUART1_TX_I                NXP_SIUL2_PINMUX(0, 0, 0, 0, 78, 1)
#define PA4_LPUART1_TX_O                NXP_SIUL2_PINMUX(0, 0, 4, 8, 0, 0)
#define PA4_LPUART1_TX_I                NXP_SIUL2_PINMUX(0, 0, 4, 0, 78, 2)
#define PA12_LPUART1_RX                 NXP_SIUL2_PINMUX(0, 0, 12, 0, 79, 1)
#define PA13_LPUART1_RIN_B              NXP_SIUL2_PINMUX(0, 0, 13, 0, 83, 1)
#define PA14_LPUART1_DCD_B              NXP_SIUL2_PINMUX(0, 0, 14, 0, 82, 1)
#define PB4_LPUART1_DSR_B               NXP_SIUL2_PINMUX(0, 0, 20, 0, 81, 1)
#define PB6_LPUART1_RTS                 NXP_SIUL2_PINMUX(0, 0, 22, 4, 0, 0)
#define PB7_LPUART1_RX                  NXP_SIUL2_PINMUX(0, 0, 23, 0, 79, 2)
#define PB10_LPUART1_CTS                NXP_SIUL2_PINMUX(0, 0, 26, 0, 80, 1)
#define PC7_LPUART1_DTR_B               NXP_SIUL2_PINMUX(0, 0, 39, 6, 0, 0)
#define PC8_LPUART1_RX                  NXP_SIUL2_PINMUX(0, 0, 40, 0, 79, 3)
#define PC9_LPUART1_TX_O                NXP_SIUL2_PINMUX(0, 0, 41, 3, 0, 0)
#define PC9_LPUART1_TX_I                NXP_SIUL2_PINMUX(0, 0, 41, 0, 78, 3)
#define PE6_LPUART1_TX_O                NXP_SIUL2_PINMUX(0, 0, 70, 5, 0, 0)
#define PE6_LPUART1_TX_I                NXP_SIUL2_PINMUX(0, 0, 70, 0, 78, 4)
#define PE7_LPUART1_RX                  NXP_SIUL2_PINMUX(0, 0, 71, 0, 79, 4)
#define PE10_LPUART1_TX_O               NXP_SIUL2_PINMUX(0, 0, 74, 7, 0, 0)
#define PE10_LPUART1_TX_I               NXP_SIUL2_PINMUX(0, 0, 74, 0, 78, 5)
#define PE11_LPUART1_RX                 NXP_SIUL2_PINMUX(0, 0, 75, 0, 79, 5)
#define PE13_LPUART1_RX                 NXP_SIUL2_PINMUX(0, 0, 77, 0, 79, 6)
#define PE14_LPUART1_TX_O               NXP_SIUL2_PINMUX(0, 0, 78, 5, 0, 0)
#define PE14_LPUART1_TX_I               NXP_SIUL2_PINMUX(0, 0, 78, 0, 78, 6)

/* TRACE */
#define PA0_TRACE_ETM_D0                NXP_SIUL2_PINMUX(0, 0, 0, 2, 0, 0)
#define PA13_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 13, 1, 0, 0)
#define PA14_TRACE_ETM_D1               NXP_SIUL2_PINMUX(0, 0, 14, 1, 0, 0)
#define PB4_TRACE_ETM_D2                NXP_SIUL2_PINMUX(0, 0, 20, 4, 0, 0)
#define PB6_TRACE_ETM_D3                NXP_SIUL2_PINMUX(0, 0, 22, 2, 0, 0)
#define PD4_TRACE_ETM_D1                NXP_SIUL2_PINMUX(0, 0, 52, 2, 0, 0)
#define PD8_TRACE_ETM_D0                NXP_SIUL2_PINMUX(0, 0, 56, 4, 0, 0)
#define PD9_TRACE_ETM_D2                NXP_SIUL2_PINMUX(0, 0, 57, 3, 0, 0)
#define PD11_TRACE_ETM_D3               NXP_SIUL2_PINMUX(0, 0, 59, 4, 0, 0)
#define PD12_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 60, 4, 0, 0)
#define PD13_TRACE_ETM_D4               NXP_SIUL2_PINMUX(0, 0, 61, 5, 0, 0)
#define PD14_TRACE_ETM_D5               NXP_SIUL2_PINMUX(0, 0, 62, 5, 0, 0)
#define PD15_TRACE_ETM_D6               NXP_SIUL2_PINMUX(0, 0, 63, 5, 0, 0)
#define PE0_TRACE_ETM_D7                NXP_SIUL2_PINMUX(0, 0, 64, 4, 0, 0)
#define PV10_TRACE_ETM_D1               NXP_SIUL2_PINMUX(4, 4, 346, 6, 0, 0)
#define PV11_TRACE_ETM_D8               NXP_SIUL2_PINMUX(4, 4, 347, 6, 0, 0)
#define PV12_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(4, 4, 348, 6, 0, 0)
#define PV13_TRACE_ETM_D0               NXP_SIUL2_PINMUX(4, 4, 349, 6, 0, 0)
#define PV15_TRACE_ETM_D3               NXP_SIUL2_PINMUX(4, 4, 351, 6, 0, 0)
#define PW0_TRACE_ETM_D10               NXP_SIUL2_PINMUX(4, 4, 352, 3, 0, 0)
#define PW1_TRACE_ETM_D2                NXP_SIUL2_PINMUX(4, 4, 353, 6, 0, 0)
#define PW2_TRACE_ETM_D9                NXP_SIUL2_PINMUX(4, 4, 354, 3, 0, 0)
#define PW3_TRACE_ETM_D4                NXP_SIUL2_PINMUX(4, 4, 355, 6, 0, 0)
#define PW4_TRACE_ETM_D11               NXP_SIUL2_PINMUX(4, 4, 356, 6, 0, 0)
#define PW5_TRACE_ETM_D5                NXP_SIUL2_PINMUX(4, 4, 357, 6, 0, 0)
#define PW6_TRACE_ETM_D13               NXP_SIUL2_PINMUX(4, 4, 358, 6, 0, 0)
#define PW7_TRACE_ETM_D6                NXP_SIUL2_PINMUX(4, 4, 359, 5, 0, 0)
#define PW8_TRACE_ETM_D7                NXP_SIUL2_PINMUX(4, 4, 360, 5, 0, 0)
#define PW9_TRACE_ETM_D14               NXP_SIUL2_PINMUX(4, 4, 361, 6, 0, 0)
#define PW10_TRACE_ETM_D15              NXP_SIUL2_PINMUX(4, 4, 362, 6, 0, 0)
#define PW11_TRACE_ETM_D12              NXP_SIUL2_PINMUX(4, 4, 363, 5, 0, 0)

/* NETC */
#define PA0_1588_CLK                    NXP_SIUL2_PINMUX(0, 0, 0, 0, 139, 1)
#define PA4_1722_TMR1_O                 NXP_SIUL2_PINMUX(0, 0, 4, 6, 0, 0)
#define PA4_TMR_PP1                     NXP_SIUL2_PINMUX(0, 0, 4, 7, 0, 0)
#define PA4_1722_TMR1_I                 NXP_SIUL2_PINMUX(0, 0, 4, 0, 134, 1)
#define PA10_NETC_MDC                   NXP_SIUL2_PINMUX(0, 0, 10, 5, 0, 0)
#define PA12_TMR_PP2                    NXP_SIUL2_PINMUX(0, 0, 12, 1, 0, 0)
#define PA12_1722_TMR2_O                NXP_SIUL2_PINMUX(0, 0, 12, 2, 0, 0)
#define PA12_NETC_MDIO_O                NXP_SIUL2_PINMUX(0, 0, 12, 6, 0, 0)
#define PA12_1722_TMR2_I                NXP_SIUL2_PINMUX(0, 0, 12, 0, 135, 1)
#define PA12_NETC_MDIO_I                NXP_SIUL2_PINMUX(0, 0, 12, 0, 138, 1)
#define PA12_1588_CLK                   NXP_SIUL2_PINMUX(0, 0, 12, 0, 139, 2)
#define PA13_NETC_MDIO_O                NXP_SIUL2_PINMUX(0, 0, 13, 9, 0, 0)
#define PA13_NETC_MDIO_I                NXP_SIUL2_PINMUX(0, 0, 13, 0, 138, 2)
#define PA13_1588_CLK                   NXP_SIUL2_PINMUX(0, 0, 13, 0, 139, 3)
#define PA14_1722_TMR1_O                NXP_SIUL2_PINMUX(0, 0, 14, 3, 0, 0)
#define PA14_TMR_PP1                    NXP_SIUL2_PINMUX(0, 0, 14, 4, 0, 0)
#define PA14_NETC_MDC                   NXP_SIUL2_PINMUX(0, 0, 14, 6, 0, 0)
#define PA14_1722_TMR1_I                NXP_SIUL2_PINMUX(0, 0, 14, 0, 134, 2)
#define PA14_TMR_TRIG1                  NXP_SIUL2_PINMUX(0, 0, 14, 0, 140, 1)
#define PB2_1722_TMR3                   NXP_SIUL2_PINMUX(0, 0, 18, 7, 0, 0)
#define PB3_1722_TMR1_O                 NXP_SIUL2_PINMUX(0, 0, 19, 1, 0, 0)
#define PB3_TMR_PP1                     NXP_SIUL2_PINMUX(0, 0, 19, 4, 0, 0)
#define PB3_TMR_ALARM1                  NXP_SIUL2_PINMUX(0, 0, 19, 6, 0, 0)
#define PB3_1722_TMR1_I                 NXP_SIUL2_PINMUX(0, 0, 19, 0, 134, 3)
#define PB3_TMR_TRIG1                   NXP_SIUL2_PINMUX(0, 0, 19, 0, 140, 2)
#define PB4_1722_TMR3_O                 NXP_SIUL2_PINMUX(0, 0, 20, 1, 0, 0)
#define PB4_TMR_PP3                     NXP_SIUL2_PINMUX(0, 0, 20, 5, 0, 0)
#define PB4_1722_TMR3_I                 NXP_SIUL2_PINMUX(0, 0, 20, 0, 136, 1)
#define PB6_NETC_MDIO_O                 NXP_SIUL2_PINMUX(0, 0, 22, 1, 0, 0)
#define PB6_NETC_MDIO_I                 NXP_SIUL2_PINMUX(0, 0, 22, 0, 138, 3)
#define PB7_TMR_ALARM1                  NXP_SIUL2_PINMUX(0, 0, 23, 8, 0, 0)
#define PB10_NETC_MDC                   NXP_SIUL2_PINMUX(0, 0, 26, 1, 0, 0)
#define PB13_1722_TMR1_O                NXP_SIUL2_PINMUX(0, 0, 29, 1, 0, 0)
#define PB13_TMR_PP2                    NXP_SIUL2_PINMUX(0, 0, 29, 2, 0, 0)
#define PB13_TMR_ALARM2                 NXP_SIUL2_PINMUX(0, 0, 29, 4, 0, 0)
#define PB13_1722_TMR1_I                NXP_SIUL2_PINMUX(0, 0, 29, 0, 134, 4)
#define PB13_TMR_TRIG2                  NXP_SIUL2_PINMUX(0, 0, 29, 0, 141, 1)
#define PC1_NETC_MDIO_O                 NXP_SIUL2_PINMUX(0, 0, 33, 4, 0, 0)
#define PC1_NETC_MDIO_I                 NXP_SIUL2_PINMUX(0, 0, 33, 0, 138, 4)
#define PC7_TMR_ALARM1                  NXP_SIUL2_PINMUX(0, 0, 39, 2, 0, 0)
#define PC7_TMR_PP3                     NXP_SIUL2_PINMUX(0, 0, 39, 3, 0, 0)
#define PC7_1722_TMR4_O                 NXP_SIUL2_PINMUX(0, 0, 39, 4, 0, 0)
#define PC7_NETC_MDC                    NXP_SIUL2_PINMUX(0, 0, 39, 7, 0, 0)
#define PC7_NETC_MDIO_O                 NXP_SIUL2_PINMUX(0, 0, 39, 9, 0, 0)
#define PC7_1722_TMR4_I                 NXP_SIUL2_PINMUX(0, 0, 39, 0, 137, 1)
#define PC7_NETC_MDIO_I                 NXP_SIUL2_PINMUX(0, 0, 39, 0, 138, 5)
#define PC15_1722_TMR2_O                NXP_SIUL2_PINMUX(0, 0, 47, 6, 0, 0)
#define PC15_TMR_ALARM2                 NXP_SIUL2_PINMUX(0, 0, 47, 7, 0, 0)
#define PC15_1722_TMR2_I                NXP_SIUL2_PINMUX(0, 0, 47, 0, 135, 2)
#define PD7_1722_TMR2_O                 NXP_SIUL2_PINMUX(0, 0, 55, 1, 0, 0)
#define PD7_TMR_PP2                     NXP_SIUL2_PINMUX(0, 0, 55, 2, 0, 0)
#define PD7_TMR_ALARM2                  NXP_SIUL2_PINMUX(0, 0, 55, 3, 0, 0)
#define PD7_1722_TMR2_I                 NXP_SIUL2_PINMUX(0, 0, 55, 0, 135, 6)
#define PD7_TMR_TRIG2                   NXP_SIUL2_PINMUX(0, 0, 55, 0, 141, 5)
#define PD9_1722_TMR3_O                 NXP_SIUL2_PINMUX(0, 0, 57, 2, 0, 0)
#define PD9_TMR_ALARM1                  NXP_SIUL2_PINMUX(0, 0, 57, 5, 0, 0)
#define PD9_1722_TMR3_I                 NXP_SIUL2_PINMUX(0, 0, 57, 0, 136, 5)
#define PD10_1722_TMR1_O                NXP_SIUL2_PINMUX(0, 0, 58, 4, 0, 0)
#define PD10_TMR_PP1                    NXP_SIUL2_PINMUX(0, 0, 58, 5, 0, 0)
#define PD10_1722_TMR1_I                NXP_SIUL2_PINMUX(0, 0, 58, 0, 134, 8)
#define PE1_1722_TMR1_O                 NXP_SIUL2_PINMUX(0, 0, 65, 1, 0, 0)
#define PE1_1722_TMR1_I                 NXP_SIUL2_PINMUX(0, 0, 65, 0, 134, 5)
#define PE1_TMR_TRIG1                   NXP_SIUL2_PINMUX(0, 0, 65, 0, 140, 3)
#define PE2_1722_TMR2_O                 NXP_SIUL2_PINMUX(0, 0, 66, 2, 0, 0)
#define PE2_TMR_PP2                     NXP_SIUL2_PINMUX(0, 0, 66, 3, 0, 0)
#define PE2_1722_TMR2_I                 NXP_SIUL2_PINMUX(0, 0, 66, 0, 135, 3)
#define PE2_TMR_TRIG2                   NXP_SIUL2_PINMUX(0, 0, 66, 0, 141, 2)
#define PE3_1722_TMR3_O                 NXP_SIUL2_PINMUX(0, 0, 67, 2, 0, 0)
#define PE3_TMR_PP3                     NXP_SIUL2_PINMUX(0, 0, 67, 3, 0, 0)
#define PE3_1722_TMR3_I                 NXP_SIUL2_PINMUX(0, 0, 67, 0, 136, 2)
#define PE4_1722_TMR4_O                 NXP_SIUL2_PINMUX(0, 0, 68, 2, 0, 0)
#define PE4_1722_TMR4_I                 NXP_SIUL2_PINMUX(0, 0, 68, 0, 137, 2)
#define PE5_1722_TMR1_O                 NXP_SIUL2_PINMUX(0, 0, 69, 2, 0, 0)
#define PE5_TMR_PP1                     NXP_SIUL2_PINMUX(0, 0, 69, 3, 0, 0)
#define PE5_1722_TMR1_I                 NXP_SIUL2_PINMUX(0, 0, 69, 0, 134, 6)
#define PE5_TMR_TRIG1                   NXP_SIUL2_PINMUX(0, 0, 69, 0, 140, 4)
#define PE6_1722_TMR2_O                 NXP_SIUL2_PINMUX(0, 0, 70, 2, 0, 0)
#define PE6_TMR_PP2                     NXP_SIUL2_PINMUX(0, 0, 70, 3, 0, 0)
#define PE6_1722_TMR2_I                 NXP_SIUL2_PINMUX(0, 0, 70, 0, 135, 4)
#define PE6_TMR_TRIG2                   NXP_SIUL2_PINMUX(0, 0, 70, 0, 141, 3)
#define PE7_1722_TMR3_O                 NXP_SIUL2_PINMUX(0, 0, 71, 1, 0, 0)
#define PE7_TMR_PP3                     NXP_SIUL2_PINMUX(0, 0, 71, 2, 0, 0)
#define PE7_1722_TMR3_I                 NXP_SIUL2_PINMUX(0, 0, 71, 0, 136, 3)
#define PE8_1722_TMR4_O                 NXP_SIUL2_PINMUX(0, 0, 72, 2, 0, 0)
#define PE8_TMR_ALARM2                  NXP_SIUL2_PINMUX(0, 0, 72, 3, 0, 0)
#define PE8_1722_TMR4_I                 NXP_SIUL2_PINMUX(0, 0, 72, 0, 137, 3)
#define PE9_1722_TMR1_O                 NXP_SIUL2_PINMUX(0, 0, 73, 2, 0, 0)
#define PE9_TMR_PP1                     NXP_SIUL2_PINMUX(0, 0, 73, 3, 0, 0)
#define PE9_TMR_ALARM1                  NXP_SIUL2_PINMUX(0, 0, 73, 4, 0, 0)
#define PE9_1722_TMR1_I                 NXP_SIUL2_PINMUX(0, 0, 73, 0, 134, 7)
#define PE9_TMR_TRIG1                   NXP_SIUL2_PINMUX(0, 0, 73, 0, 140, 5)
#define PE10_1722_TMR2_O                NXP_SIUL2_PINMUX(0, 0, 74, 2, 0, 0)
#define PE10_TMR_PP2                    NXP_SIUL2_PINMUX(0, 0, 74, 3, 0, 0)
#define PE10_TMR_ALARM2                 NXP_SIUL2_PINMUX(0, 0, 74, 4, 0, 0)
#define PE10_1722_TMR2_I                NXP_SIUL2_PINMUX(0, 0, 74, 0, 135, 5)
#define PE10_TMR_TRIG2                  NXP_SIUL2_PINMUX(0, 0, 74, 0, 141, 4)
#define PE11_1722_TMR3_O                NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)
#define PE11_TMR_PP3                    NXP_SIUL2_PINMUX(0, 0, 75, 3, 0, 0)
#define PE11_TMR_ALARM1                 NXP_SIUL2_PINMUX(0, 0, 75, 4, 0, 0)
#define PE11_1722_TMR3_I                NXP_SIUL2_PINMUX(0, 0, 75, 0, 136, 4)
#define PE12_1722_TMR4_O                NXP_SIUL2_PINMUX(0, 0, 76, 2, 0, 0)
#define PE12_1722_TMR4_I                NXP_SIUL2_PINMUX(0, 0, 76, 0, 137, 4)
#define PE13_NETC_MDC                   NXP_SIUL2_PINMUX(0, 0, 77, 4, 0, 0)
#define PE13_1588_CLK                   NXP_SIUL2_PINMUX(0, 0, 77, 0, 139, 4)
#define PE14_NETC_MDIO_O                NXP_SIUL2_PINMUX(0, 0, 78, 7, 0, 0)
#define PE14_NETC_MDIO_I                NXP_SIUL2_PINMUX(0, 0, 78, 0, 138, 6)
#define PE14_1588_CLK                   NXP_SIUL2_PINMUX(0, 0, 78, 0, 139, 5)

/* MAC2 */
#define PA0_MAC2_MII_COL                NXP_SIUL2_PINMUX(0, 0, 0, 0, 198, 1)
#define PA1_MAC2_MII_RXER               NXP_SIUL2_PINMUX(0, 0, 1, 0, 204, 1)
#define PA1_MAC2_RMII_RXER              NXP_SIUL2_PINMUX(0, 0, 1, 0, 210, 1)
#define PA2_MAC2_RGMII_RXD1_O           NXP_SIUL2_PINMUX(0, 0, 2, 1, 0, 0)
#define PA2_MAC2_MII_RXD1               NXP_SIUL2_PINMUX(0, 0, 2, 0, 200, 1)
#define PA2_MAC2_RMII_RXD1              NXP_SIUL2_PINMUX(0, 0, 2, 0, 209, 1)
#define PA2_MAC2_RGMII_RXD1_I           NXP_SIUL2_PINMUX(0, 0, 2, 0, 213, 1)
#define PA3_MAC2_RGMII_RXD0_O           NXP_SIUL2_PINMUX(0, 0, 3, 1, 0, 0)
#define PA3_MAC2_MII_RXD0               NXP_SIUL2_PINMUX(0, 0, 3, 0, 199, 1)
#define PA3_MAC2_MII_RXD3               NXP_SIUL2_PINMUX(0, 0, 3, 0, 202, 2)
#define PA3_MAC2_RMII_RXD0              NXP_SIUL2_PINMUX(0, 0, 3, 0, 208, 1)
#define PA3_MAC2_RGMII_RXD0_I           NXP_SIUL2_PINMUX(0, 0, 3, 0, 212, 1)
#define PA3_MAC2_RGMII_RXD3             NXP_SIUL2_PINMUX(0, 0, 3, 0, 215, 2)
#define PA4_MAC2_RGMII_TXCTL_O          NXP_SIUL2_PINMUX(0, 0, 4, 1, 0, 0)
#define PA4_MAC2_RMII_TXEN              NXP_SIUL2_PINMUX(0, 0, 4, 2, 0, 0)
#define PA4_MAC2_RMII_TXER              NXP_SIUL2_PINMUX(0, 0, 4, 3, 0, 0)
#define PA4_MAC2_MII_TXEN               NXP_SIUL2_PINMUX(0, 0, 4, 4, 0, 0)
#define PA4_MAC2_MII_TXER               NXP_SIUL2_PINMUX(0, 0, 4, 5, 0, 0)
#define PA4_MAC2_RGMII_TXCTL_I          NXP_SIUL2_PINMUX(0, 0, 4, 0, 236, 1)
#define PA5_MAC2_RMII_TXD1              NXP_SIUL2_PINMUX(0, 0, 5, 3, 0, 0)
#define PA5_MAC2_RGMII_TXD1_O           NXP_SIUL2_PINMUX(0, 0, 5, 4, 0, 0)
#define PA5_MAC2_MII_TXD1               NXP_SIUL2_PINMUX(0, 0, 5, 5, 0, 0)
#define PA5_MAC2_RGMII_TXD1_I           NXP_SIUL2_PINMUX(0, 0, 5, 0, 237, 1)
#define PA6_MAC2_RGMII_TXD0_O           NXP_SIUL2_PINMUX(0, 0, 6, 1, 0, 0)
#define PA6_MAC2_RGMII_TXD3             NXP_SIUL2_PINMUX(0, 0, 6, 2, 0, 0)
#define PA6_MAC2_MII_TXD0               NXP_SIUL2_PINMUX(0, 0, 6, 3, 0, 0)
#define PA6_MAC2_RMII_TXD0              NXP_SIUL2_PINMUX(0, 0, 6, 4, 0, 0)
#define PA6_MAC2_MII_TXD3               NXP_SIUL2_PINMUX(0, 0, 6, 5, 0, 0)
#define PA6_MAC2_RGMII_TXD0_I           NXP_SIUL2_PINMUX(0, 0, 6, 0, 238, 1)
#define PA7_MAC2_RGMII_TXCLK_O          NXP_SIUL2_PINMUX(0, 0, 7, 1, 0, 0)
#define PA7_MAC2_MII_TXCLK_O            NXP_SIUL2_PINMUX(0, 0, 7, 2, 0, 0)
#define PA7_MAC2_MII_TXCLK_I            NXP_SIUL2_PINMUX(0, 0, 7, 0, 205, 1)
#define PA7_MAC2_RMII_REFCLK            NXP_SIUL2_PINMUX(0, 0, 7, 0, 221, 1)
#define PA7_MAC2_RGMII_TXCLK_I          NXP_SIUL2_PINMUX(0, 0, 7, 0, 239, 1)
#define PA8_MAC2_RGMII_RXD3_O           NXP_SIUL2_PINMUX(0, 0, 8, 2, 0, 0)
#define PA8_MAC2_MII_RXD0               NXP_SIUL2_PINMUX(0, 0, 8, 0, 199, 2)
#define PA8_MAC2_MII_RXD3               NXP_SIUL2_PINMUX(0, 0, 8, 0, 202, 1)
#define PA8_MAC2_RMII_RXD0              NXP_SIUL2_PINMUX(0, 0, 8, 0, 208, 2)
#define PA8_MAC2_RGMII_RXD0             NXP_SIUL2_PINMUX(0, 0, 8, 0, 212, 2)
#define PA8_MAC2_RGMII_RXD3_I           NXP_SIUL2_PINMUX(0, 0, 8, 0, 215, 1)
#define PA10_MAC2_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 10, 0, 223, 1)
#define PA13_MAC2_SLV_MDIO_O            NXP_SIUL2_PINMUX(0, 0, 13, 8, 0, 0)
#define PA13_MAC2_SLV_MDIO_I            NXP_SIUL2_PINMUX(0, 0, 13, 0, 222, 3)
#define PA14_MAC2_MII_CRS               NXP_SIUL2_PINMUX(0, 0, 14, 0, 197, 1)
#define PA14_MAC2_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 14, 0, 223, 2)
#define PB6_MAC2_SLV_MDIO_O             NXP_SIUL2_PINMUX(0, 0, 22, 7, 0, 0)
#define PB6_MAC2_SLV_MDIO_I             NXP_SIUL2_PINMUX(0, 0, 22, 0, 222, 1)
#define PB7_MAC2_RGMII_TXCTL            NXP_SIUL2_PINMUX(0, 0, 23, 1, 0, 0)
#define PB7_MAC2_RMII_TXEN              NXP_SIUL2_PINMUX(0, 0, 23, 2, 0, 0)
#define PB7_MAC2_RMII_TXER              NXP_SIUL2_PINMUX(0, 0, 23, 3, 0, 0)
#define PB7_MAC2_MII_TXEN               NXP_SIUL2_PINMUX(0, 0, 23, 4, 0, 0)
#define PB7_MAC2_MII_TXER               NXP_SIUL2_PINMUX(0, 0, 23, 5, 0, 0)
#define PB10_MAC2_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 26, 0, 223, 3)
#define PB13_MAC2_RGMII_RXCTL_O         NXP_SIUL2_PINMUX(0, 0, 29, 5, 0, 0)
#define PB13_MAC2_MII_RXDV              NXP_SIUL2_PINMUX(0, 0, 29, 0, 203, 1)
#define PB13_MAC2_RMII_CRSDV            NXP_SIUL2_PINMUX(0, 0, 29, 0, 207, 1)
#define PB13_MAC2_RGMII_RXCTL_I         NXP_SIUL2_PINMUX(0, 0, 29, 0, 211, 1)
#define PB14_MAC2_RGMII_RXD2_O          NXP_SIUL2_PINMUX(0, 0, 30, 2, 0, 0)
#define PB14_MAC2_MII_RXD2              NXP_SIUL2_PINMUX(0, 0, 30, 0, 201, 1)
#define PB14_MAC2_RGMII_RXD2_I          NXP_SIUL2_PINMUX(0, 0, 30, 0, 214, 1)
#define PC1_MAC2_SLV_MDIO_O             NXP_SIUL2_PINMUX(0, 0, 33, 7, 0, 0)
#define PC1_MAC2_SLV_MDIO_I             NXP_SIUL2_PINMUX(0, 0, 33, 0, 222, 2)
#define PC6_MAC2_MII_RXCLK_O            NXP_SIUL2_PINMUX(0, 0, 38, 1, 0, 0)
#define PC6_MAC2_RGMII_RXCLK_O          NXP_SIUL2_PINMUX(0, 0, 38, 3, 0, 0)
#define PC6_MAC2_MII_RXCLK_I            NXP_SIUL2_PINMUX(0, 0, 38, 0, 206, 1)
#define PC6_MAC2_RGMII_RXCLK_I          NXP_SIUL2_PINMUX(0, 0, 38, 0, 217, 1)
#define PD0_MAC2_RGMII_TXD3_O           NXP_SIUL2_PINMUX(0, 0, 48, 1, 0, 0)
#define PD0_MAC2_RGMII_TXD0             NXP_SIUL2_PINMUX(0, 0, 48, 2, 0, 0)
#define PD0_MAC2_MII_TXD3               NXP_SIUL2_PINMUX(0, 0, 48, 3, 0, 0)
#define PD0_MAC2_MII_TXD0               NXP_SIUL2_PINMUX(0, 0, 48, 4, 0, 0)
#define PD0_MAC2_RMII_TXD0              NXP_SIUL2_PINMUX(0, 0, 48, 5, 0, 0)
#define PD0_MAC2_RGMII_TXD3_I           NXP_SIUL2_PINMUX(0, 0, 48, 0, 246, 1)
#define PD1_MAC2_RGMII_TXD2_O           NXP_SIUL2_PINMUX(0, 0, 49, 1, 0, 0)
#define PD1_MAC2_MII_TXD2               NXP_SIUL2_PINMUX(0, 0, 49, 2, 0, 0)
#define PD1_MAC2_RGMII_TXD2_I           NXP_SIUL2_PINMUX(0, 0, 49, 0, 247, 1)
#define PE1_MAC2_TC14_ED_O              NXP_SIUL2_PINMUX(0, 0, 65, 2, 0, 0)
#define PE1_MAC2_TC14_ED_I              NXP_SIUL2_PINMUX(0, 0, 65, 0, 220, 1)
#define PE6_MAC2_TC14_TX                NXP_SIUL2_PINMUX(0, 0, 70, 1, 0, 0)
#define PE7_MAC2_TC14_RX_O              NXP_SIUL2_PINMUX(0, 0, 71, 3, 0, 0)
#define PE7_MAC2_TC14_RX_I              NXP_SIUL2_PINMUX(0, 0, 71, 0, 219, 1)

