zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPI2C0 */
#define PA0_LPI2C0_HREQ                 NXP_SIUL2_PINMUX(0, 0, 0, 0, 61, 1)
#define PA1_LPI2C0_SCL_O                NXP_SIUL2_PINMUX(0, 0, 1, 2, 0, 0)
#define PA1_LPI2C0_SCL_I                NXP_SIUL2_PINMUX(0, 0, 1, 0, 62, 1)
#define PA4_LPI2C0_SCL_O                NXP_SIUL2_PINMUX(0, 0, 4, 9, 0, 0)
#define PA4_LPI2C0_SCL_I                NXP_SIUL2_PINMUX(0, 0, 4, 0, 62, 2)
#define PA10_LPI2C0_SCL_O               NXP_SIUL2_PINMUX(0, 0, 10, 3, 0, 0)
#define PA10_LPI2C0_SCL_I               NXP_SIUL2_PINMUX(0, 0, 10, 0, 62, 3)
#define PA11_LPI2C0_SDA_O               NXP_SIUL2_PINMUX(0, 0, 11, 3, 0, 0)
#define PA11_LPI2C0_SDA_I               NXP_SIUL2_PINMUX(0, 0, 11, 0, 64, 1)
#define PA12_LPI2C0_SDA_O               NXP_SIUL2_PINMUX(0, 0, 12, 4, 0, 0)
#define PA12_LPI2C0_SDA_I               NXP_SIUL2_PINMUX(0, 0, 12, 0, 64, 2)
#define PB4_LPI2C0_SCL_O                NXP_SIUL2_PINMUX(0, 0, 20, 7, 0, 0)
#define PB4_LPI2C0_SCL_I                NXP_SIUL2_PINMUX(0, 0, 20, 0, 62, 4)
#define PB7_LPI2C0_SDA_O                NXP_SIUL2_PINMUX(0, 0, 23, 6, 0, 0)
#define PB7_LPI2C0_SDA_I                NXP_SIUL2_PINMUX(0, 0, 23, 0, 64, 3)
#define PB13_LPI2C0_SDA_O               NXP_SIUL2_PINMUX(0, 0, 29, 3, 0, 0)
#define PB13_LPI2C0_SDA_I               NXP_SIUL2_PINMUX(0, 0, 29, 0, 64, 4)
#define PE1_LPI2C0_SDAS_O               NXP_SIUL2_PINMUX(0, 0, 65, 3, 0, 0)
#define PE1_LPI2C0_SDAS_I               NXP_SIUL2_PINMUX(0, 0, 65, 0, 65, 1)
#define PE2_LPI2C0_SDA_O                NXP_SIUL2_PINMUX(0, 0, 66, 7, 0, 0)
#define PE2_LPI2C0_SDA_I                NXP_SIUL2_PINMUX(0, 0, 66, 0, 64, 6)
#define PE3_LPI2C0_SCL_O                NXP_SIUL2_PINMUX(0, 0, 67, 1, 0, 0)
#define PE3_LPI2C0_SCL_I                NXP_SIUL2_PINMUX(0, 0, 67, 0, 62, 5)
#define PE4_LPI2C0_SCL_O                NXP_SIUL2_PINMUX(0, 0, 68, 4, 0, 0)
#define PE4_LPI2C0_SCL_I                NXP_SIUL2_PINMUX(0, 0, 68, 0, 62, 6)
#define PE5_LPI2C0_SDA_O                NXP_SIUL2_PINMUX(0, 0, 69, 5, 0, 0)
#define PE5_LPI2C0_SDA_I                NXP_SIUL2_PINMUX(0, 0, 69, 0, 64, 7)
#define PE7_LPI2C0_SCLS_O               NXP_SIUL2_PINMUX(0, 0, 71, 5, 0, 0)
#define PE7_LPI2C0_SCLS_I               NXP_SIUL2_PINMUX(0, 0, 71, 0, 63, 1)
#define PE8_LPI2C0_HREQ                 NXP_SIUL2_PINMUX(0, 0, 72, 0, 61, 2)
#define PE9_LPI2C0_SDA_O                NXP_SIUL2_PINMUX(0, 0, 73, 1, 0, 0)
#define PE9_LPI2C0_SDA_I                NXP_SIUL2_PINMUX(0, 0, 73, 0, 64, 5)
#define PE11_LPI2C0_SCL_O               NXP_SIUL2_PINMUX(0, 0, 75, 5, 0, 0)
#define PE11_LPI2C0_SCL_I               NXP_SIUL2_PINMUX(0, 0, 75, 0, 62, 7)
#define PE13_LPI2C0_SCL_O               NXP_SIUL2_PINMUX(0, 0, 77, 2, 0, 0)
#define PE13_LPI2C0_SCL_I               NXP_SIUL2_PINMUX(0, 0, 77, 0, 62, 8)
#define PE14_LPI2C0_SDA_O               NXP_SIUL2_PINMUX(0, 0, 78, 3, 0, 0)
#define PE14_LPI2C0_SDA_I               NXP_SIUL2_PINMUX(0, 0, 78, 0, 64, 8)

/* LPUART0 */
#define PA1_LPUART0_TX_O                NXP_SIUL2_PINMUX(0, 0, 1, 1, 0, 0)
#define PA1_LPUART0_TX_I                NXP_SIUL2_PINMUX(0, 0, 1, 0, 69, 1)
#define PB4_LPUART0_TX_O                NXP_SIUL2_PINMUX(0, 0, 20, 6, 0, 0)
#define PB4_LPUART0_TX_I                NXP_SIUL2_PINMUX(0, 0, 20, 0, 69, 2)
#define PB6_LPUART0_RX                  NXP_SIUL2_PINMUX(0, 0, 22, 0, 70, 1)
#define PB9_LPUART0_RX                  NXP_SIUL2_PINMUX(0, 0, 25, 0, 70, 2)
#define PB13_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 29, 0, 70, 3)
#define PC10_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PC10_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 42, 0, 69, 3)
#define PE1_LPUART0_DCD_B               NXP_SIUL2_PINMUX(0, 0, 65, 0, 73, 1)
#define PE2_LPUART0_RTS                 NXP_SIUL2_PINMUX(0, 0, 66, 4, 0, 0)
#define PE3_LPUART0_RX                  NXP_SIUL2_PINMUX(0, 0, 67, 0, 70, 4)
#define PE4_LPUART0_RX                  NXP_SIUL2_PINMUX(0, 0, 68, 0, 70, 5)
#define PE5_LPUART0_CTS                 NXP_SIUL2_PINMUX(0, 0, 69, 0, 71, 1)
#define PE6_LPUART0_DSR_B               NXP_SIUL2_PINMUX(0, 0, 70, 0, 72, 1)
#define PE7_LPUART0_DTR_B               NXP_SIUL2_PINMUX(0, 0, 71, 4, 0, 0)
#define PE8_LPUART0_TX_O                NXP_SIUL2_PINMUX(0, 0, 72, 5, 0, 0)
#define PE8_LPUART0_TX_I                NXP_SIUL2_PINMUX(0, 0, 72, 0, 69, 4)
#define PE9_LPUART0_RIN_B               NXP_SIUL2_PINMUX(0, 0, 73, 0, 74, 1)
#define PE12_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 76, 3, 0, 0)
#define PE12_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 76, 0, 69, 5)
#define PE13_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 77, 0, 70, 6)
#define PE14_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 78, 4, 0, 0)
#define PE14_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 78, 0, 69, 6)

/* LPSPI1 */
#define PA4_LPSPI1_PCS0_O               NXP_SIUL2_PINMUX(0, 0, 4, 10, 0, 0)
#define PA4_LPSPI1_PCS0_I               NXP_SIUL2_PINMUX(0, 0, 4, 0, 49, 1)
#define PA8_LPSPI1_SOUT_O               NXP_SIUL2_PINMUX(0, 0, 8, 1, 0, 0)
#define PA8_LPSPI1_SOUT_I               NXP_SIUL2_PINMUX(0, 0, 8, 0, 57, 1)
#define PA9_LPSPI1_SCK_O                NXP_SIUL2_PINMUX(0, 0, 9, 3, 0, 0)
#define PA9_LPSPI1_SCK_I                NXP_SIUL2_PINMUX(0, 0, 9, 0, 55, 1)
#define PA10_LPSPI1_SIN_O               NXP_SIUL2_PINMUX(0, 0, 10, 6, 0, 0)
#define PA10_LPSPI1_SIN_I               NXP_SIUL2_PINMUX(0, 0, 10, 0, 56, 1)
#define PA11_LPSPI1_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 11, 6, 0, 0)
#define PA11_LPSPI1_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 11, 0, 49, 2)
#define PA14_LPSPI1_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 14, 5, 0, 0)
#define PA14_LPSPI1_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 14, 0, 49, 3)
#define PA15_LPSPI1_SCK_O               NXP_SIUL2_PINMUX(0, 0, 15, 3, 0, 0)
#define PA15_LPSPI1_SCK_I               NXP_SIUL2_PINMUX(0, 0, 15, 0, 55, 2)
#define PB0_LPSPI1_SIN_O                NXP_SIUL2_PINMUX(0, 0, 16, 2, 0, 0)
#define PB0_LPSPI1_PCS1_O               NXP_SIUL2_PINMUX(0, 0, 16, 3, 0, 0)
#define PB0_LPSPI1_PCS1_I               NXP_SIUL2_PINMUX(0, 0, 16, 0, 50, 1)
#define PB0_LPSPI1_SIN_I                NXP_SIUL2_PINMUX(0, 0, 16, 0, 56, 2)
#define PB1_LPSPI1_SOUT_O               NXP_SIUL2_PINMUX(0, 0, 17, 3, 0, 0)
#define PB1_LPSPI1_SOUT_I               NXP_SIUL2_PINMUX(0, 0, 17, 0, 57, 2)
#define PB4_LPSPI1_SCK_O                NXP_SIUL2_PINMUX(0, 0, 20, 3, 0, 0)
#define PB4_LPSPI1_SCK_I                NXP_SIUL2_PINMUX(0, 0, 20, 0, 55, 3)
#define PB6_LPSPI1_SIN_O                NXP_SIUL2_PINMUX(0, 0, 22, 3, 0, 0)
#define PB6_LPSPI1_SIN_I                NXP_SIUL2_PINMUX(0, 0, 22, 0, 56, 3)
#define PB8_LPSPI1_PCS1_O               NXP_SIUL2_PINMUX(0, 0, 24, 6, 0, 0)
#define PB8_LPSPI1_PCS1_I               NXP_SIUL2_PINMUX(0, 0, 24, 0, 50, 2)
#define PB9_LPSPI1_SIN_O                NXP_SIUL2_PINMUX(0, 0, 25, 3, 0, 0)
#define PB9_LPSPI1_SIN_I                NXP_SIUL2_PINMUX(0, 0, 25, 0, 56, 4)
#define PB10_LPSPI1_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 26, 3, 0, 0)
#define PB10_LPSPI1_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 26, 0, 57, 3)
#define PB14_LPSPI1_SIN_O               NXP_SIUL2_PINMUX(0, 0, 30, 1, 0, 0)
#define PB14_LPSPI1_SIN_I               NXP_SIUL2_PINMUX(0, 0, 30, 0, 56, 5)
#define PB15_LPSPI1_PCS5_O              NXP_SIUL2_PINMUX(0, 0, 31, 4, 0, 0)
#define PB15_LPSPI1_PCS5_I              NXP_SIUL2_PINMUX(0, 0, 31, 0, 54, 1)
#define PC0_LPSPI1_PCS2_O               NXP_SIUL2_PINMUX(0, 0, 32, 5, 0, 0)
#define PC0_LPSPI1_PCS2_I               NXP_SIUL2_PINMUX(0, 0, 32, 0, 51, 1)
#define PC1_LPSPI1_PCS3_O               NXP_SIUL2_PINMUX(0, 0, 33, 3, 0, 0)
#define PC1_LPSPI1_PCS3_I               NXP_SIUL2_PINMUX(0, 0, 33, 0, 52, 1)
#define PC6_LPSPI1_SCK_O                NXP_SIUL2_PINMUX(0, 0, 38, 2, 0, 0)
#define PC6_LPSPI1_SCK_I                NXP_SIUL2_PINMUX(0, 0, 38, 0, 55, 4)
#define PC8_LPSPI1_PCS4_O               NXP_SIUL2_PINMUX(0, 0, 40, 4, 0, 0)
#define PC8_LPSPI1_PCS4_I               NXP_SIUL2_PINMUX(0, 0, 40, 0, 53, 1)
#define PC10_LPSPI1_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 42, 5, 0, 0)
#define PC10_LPSPI1_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 42, 0, 57, 4)
#define PE1_LPSPI1_PCS0_O               NXP_SIUL2_PINMUX(0, 0, 65, 6, 0, 0)
#define PE1_LPSPI1_PCS0_I               NXP_SIUL2_PINMUX(0, 0, 65, 0, 49, 4)
#define PE2_LPSPI1_PCS2_O               NXP_SIUL2_PINMUX(0, 0, 66, 6, 0, 0)
#define PE2_LPSPI1_PCS2_I               NXP_SIUL2_PINMUX(0, 0, 66, 0, 51, 2)
#define PE4_LPSPI1_SCK_O                NXP_SIUL2_PINMUX(0, 0, 68, 3, 0, 0)
#define PE4_LPSPI1_SCK_I                NXP_SIUL2_PINMUX(0, 0, 68, 0, 55, 5)
#define PE7_LPSPI1_PCS1_O               NXP_SIUL2_PINMUX(0, 0, 71, 7, 0, 0)
#define PE7_LPSPI1_PCS1_I               NXP_SIUL2_PINMUX(0, 0, 71, 0, 50, 3)
#define PE10_LPSPI1_PCS5_O              NXP_SIUL2_PINMUX(0, 0, 74, 6, 0, 0)
#define PE10_LPSPI1_PCS5_I              NXP_SIUL2_PINMUX(0, 0, 74, 0, 54, 2)
#define PE11_LPSPI1_PCS4_O              NXP_SIUL2_PINMUX(0, 0, 75, 7, 0, 0)
#define PE11_LPSPI1_PCS4_I              NXP_SIUL2_PINMUX(0, 0, 75, 0, 53, 2)
#define PE12_LPSPI1_PCS3_O              NXP_SIUL2_PINMUX(0, 0, 76, 5, 0, 0)
#define PE12_LPSPI1_PCS3_I              NXP_SIUL2_PINMUX(0, 0, 76, 0, 52, 2)
#define PE13_LPSPI1_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 77, 1, 0, 0)
#define PE13_LPSPI1_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 77, 0, 57, 5)
#define PE14_LPSPI1_SIN_O               NXP_SIUL2_PINMUX(0, 0, 78, 2, 0, 0)
#define PE14_LPSPI1_SIN_I               NXP_SIUL2_PINMUX(0, 0, 78, 0, 56, 6)

