zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* XSPI */
#define PA9_XSPI_SCKFA                  NXP_SIUL2_PINMUX(0, 0, 9, 1, 0, 0)
#define PA10_XSPI_INTA                  NXP_SIUL2_PINMUX(0, 0, 10, 0, 98, 1)
#define PA11_XSPI_IOFA7_O               NXP_SIUL2_PINMUX(0, 0, 11, 1, 0, 0)
#define PA11_XSPI_IOFA7_I               NXP_SIUL2_PINMUX(0, 0, 11, 0, 106, 1)
#define PA15_XSPI_SCKFA                 NXP_SIUL2_PINMUX(0, 0, 15, 1, 0, 0)
#define PB0_XSPI_PCSFA1                 NXP_SIUL2_PINMUX(0, 0, 16, 1, 0, 0)
#define PB1_XSPI_DQSFA_O                NXP_SIUL2_PINMUX(0, 0, 17, 1, 0, 0)
#define PB1_XSPI_DQSFA_I                NXP_SIUL2_PINMUX(0, 0, 17, 0, 97, 1)
#define PB8_XSPI_IOFA1_O                NXP_SIUL2_PINMUX(0, 0, 24, 1, 0, 0)
#define PB8_XSPI_IOFA1_I                NXP_SIUL2_PINMUX(0, 0, 24, 0, 100, 1)
#define PB9_XSPI_IOFA5_O                NXP_SIUL2_PINMUX(0, 0, 25, 1, 0, 0)
#define PB9_XSPI_IOFA5_I                NXP_SIUL2_PINMUX(0, 0, 25, 0, 104, 1)
#define PB15_XSPI_IOFA2_O               NXP_SIUL2_PINMUX(0, 0, 31, 1, 0, 0)
#define PB15_XSPI_IOFA2_I               NXP_SIUL2_PINMUX(0, 0, 31, 0, 101, 1)
#define PC0_XSPI_IOFA4_O                NXP_SIUL2_PINMUX(0, 0, 32, 1, 0, 0)
#define PC0_XSPI_IOFA4_I                NXP_SIUL2_PINMUX(0, 0, 32, 0, 103, 1)
#define PC1_XSPI_PCSFA2                 NXP_SIUL2_PINMUX(0, 0, 33, 1, 0, 0)
#define PC8_XSPI_IOFA3_O                NXP_SIUL2_PINMUX(0, 0, 40, 1, 0, 0)
#define PC8_XSPI_IOFA3_I                NXP_SIUL2_PINMUX(0, 0, 40, 0, 102, 1)
#define PC9_XSPI_IOFA0_O                NXP_SIUL2_PINMUX(0, 0, 41, 1, 0, 0)
#define PC9_XSPI_IOFA0_I                NXP_SIUL2_PINMUX(0, 0, 41, 0, 99, 1)
#define PC10_XSPI_IOFA6_O               NXP_SIUL2_PINMUX(0, 0, 42, 1, 0, 0)
#define PC10_XSPI_IOFA6_I               NXP_SIUL2_PINMUX(0, 0, 42, 0, 105, 1)

/* USDHC */
#define PA9_USDHC_D0_O                  NXP_SIUL2_PINMUX(0, 0, 9, 2, 0, 0)
#define PA9_USDHC_D0_I                  NXP_SIUL2_PINMUX(0, 0, 9, 0, 110, 1)
#define PA10_USDHC_D3_O                 NXP_SIUL2_PINMUX(0, 0, 10, 2, 0, 0)
#define PA10_USDHC_D3_I                 NXP_SIUL2_PINMUX(0, 0, 10, 0, 113, 1)
#define PA11_USDHC_CMD_O                NXP_SIUL2_PINMUX(0, 0, 11, 2, 0, 0)
#define PA11_USDHC_CMD_I                NXP_SIUL2_PINMUX(0, 0, 11, 0, 120, 1)
#define PA12_USDHC_RESET_B              NXP_SIUL2_PINMUX(0, 0, 12, 3, 0, 0)
#define PA15_USDHC_D2_O                 NXP_SIUL2_PINMUX(0, 0, 15, 2, 0, 0)
#define PA15_USDHC_D2_I                 NXP_SIUL2_PINMUX(0, 0, 15, 0, 112, 1)
#define PB1_USDHC_D1_O                  NXP_SIUL2_PINMUX(0, 0, 17, 2, 0, 0)
#define PB1_USDHC_D1_I                  NXP_SIUL2_PINMUX(0, 0, 17, 0, 111, 1)
#define PB9_USDHC_WP                    NXP_SIUL2_PINMUX(0, 0, 25, 0, 118, 1)
#define PB9_USDHC_STROBE                NXP_SIUL2_PINMUX(0, 0, 25, 0, 121, 1)
#define PB15_USDHC_D5_O                 NXP_SIUL2_PINMUX(0, 0, 31, 2, 0, 0)
#define PB15_USDHC_D5_I                 NXP_SIUL2_PINMUX(0, 0, 31, 0, 115, 1)
#define PC0_USDHC_D7_O                  NXP_SIUL2_PINMUX(0, 0, 32, 2, 0, 0)
#define PC0_USDHC_D2_O                  NXP_SIUL2_PINMUX(0, 0, 32, 3, 0, 0)
#define PC0_USDHC_D2_I                  NXP_SIUL2_PINMUX(0, 0, 32, 0, 112, 2)
#define PC0_USDHC_D7_I                  NXP_SIUL2_PINMUX(0, 0, 32, 0, 117, 1)
#define PC8_USDHC_D4_O                  NXP_SIUL2_PINMUX(0, 0, 40, 2, 0, 0)
#define PC8_USDHC_D4_I                  NXP_SIUL2_PINMUX(0, 0, 40, 0, 114, 1)
#define PC9_USDHC_D6_O                  NXP_SIUL2_PINMUX(0, 0, 41, 2, 0, 0)
#define PC9_USDHC_D6_I                  NXP_SIUL2_PINMUX(0, 0, 41, 0, 116, 1)
#define PC10_USDHC_CLK                  NXP_SIUL2_PINMUX(0, 0, 42, 2, 0, 0)
#define PD3_USDHC_D0_O                  NXP_SIUL2_PINMUX(0, 0, 51, 1, 0, 0)
#define PD3_USDHC_D0_I                  NXP_SIUL2_PINMUX(0, 0, 51, 0, 110, 2)
#define PD4_USDHC_D3_O                  NXP_SIUL2_PINMUX(0, 0, 52, 1, 0, 0)
#define PD4_USDHC_D3_I                  NXP_SIUL2_PINMUX(0, 0, 52, 0, 113, 2)
#define PD5_USDHC_RESET_B               NXP_SIUL2_PINMUX(0, 0, 53, 2, 0, 0)
#define PD8_USDHC_D4_O                  NXP_SIUL2_PINMUX(0, 0, 56, 1, 0, 0)
#define PD8_USDHC_D4_I                  NXP_SIUL2_PINMUX(0, 0, 56, 0, 114, 2)
#define PD9_USDHC_D5_O                  NXP_SIUL2_PINMUX(0, 0, 57, 1, 0, 0)
#define PD9_USDHC_D5_I                  NXP_SIUL2_PINMUX(0, 0, 57, 0, 115, 2)
#define PD10_USDHC_CMD_O                NXP_SIUL2_PINMUX(0, 0, 58, 1, 0, 0)
#define PD10_USDHC_CMD_I                NXP_SIUL2_PINMUX(0, 0, 58, 0, 120, 2)
#define PD11_USDHC_CLK                  NXP_SIUL2_PINMUX(0, 0, 59, 1, 0, 0)
#define PD12_USDHC_D7_O                 NXP_SIUL2_PINMUX(0, 0, 60, 1, 0, 0)
#define PD12_USDHC_D7_I                 NXP_SIUL2_PINMUX(0, 0, 60, 0, 117, 2)
#define PD13_USDHC_WP                   NXP_SIUL2_PINMUX(0, 0, 61, 0, 118, 2)
#define PD13_USDHC_STROBE               NXP_SIUL2_PINMUX(0, 0, 61, 0, 121, 2)
#define PD14_USDHC_D1_O                 NXP_SIUL2_PINMUX(0, 0, 62, 1, 0, 0)
#define PD14_USDHC_D1_I                 NXP_SIUL2_PINMUX(0, 0, 62, 0, 111, 2)
#define PD15_USDHC_D6_O                 NXP_SIUL2_PINMUX(0, 0, 63, 1, 0, 0)
#define PD15_USDHC_D6_I                 NXP_SIUL2_PINMUX(0, 0, 63, 0, 116, 2)
#define PE0_USDHC_D2_O                  NXP_SIUL2_PINMUX(0, 0, 64, 1, 0, 0)
#define PE0_USDHC_D2_I                  NXP_SIUL2_PINMUX(0, 0, 64, 0, 112, 3)

/* LPSPI0 */
#define PA9_LPSPI0_PCS2_O               NXP_SIUL2_PINMUX(0, 0, 9, 4, 0, 0)
#define PA9_LPSPI0_PCS2_I               NXP_SIUL2_PINMUX(0, 0, 9, 0, 37, 1)
#define PA11_LPSPI0_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 11, 4, 0, 0)
#define PA11_LPSPI0_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 11, 0, 36, 1)
#define PA12_LPSPI0_SIN_O               NXP_SIUL2_PINMUX(0, 0, 12, 5, 0, 0)
#define PA12_LPSPI0_SIN_I               NXP_SIUL2_PINMUX(0, 0, 12, 0, 44, 4)
#define PA13_LPSPI0_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 13, 3, 0, 0)
#define PA13_LPSPI0_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 13, 0, 45, 1)
#define PA14_LPSPI0_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 14, 2, 0, 0)
#define PA14_LPSPI0_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 14, 0, 35, 1)
#define PA15_LPSPI0_SCK_O               NXP_SIUL2_PINMUX(0, 0, 15, 4, 0, 0)
#define PA15_LPSPI0_SCK_I               NXP_SIUL2_PINMUX(0, 0, 15, 0, 43, 1)
#define PB0_LPSPI0_PCS0_O               NXP_SIUL2_PINMUX(0, 0, 16, 4, 0, 0)
#define PB0_LPSPI0_PCS0_I               NXP_SIUL2_PINMUX(0, 0, 16, 0, 35, 2)
#define PB2_LPSPI0_PCS0_O               NXP_SIUL2_PINMUX(0, 0, 18, 6, 0, 0)
#define PB2_LPSPI0_PCS0_I               NXP_SIUL2_PINMUX(0, 0, 18, 0, 35, 3)
#define PB5_LPSPI0_SOUT_O               NXP_SIUL2_PINMUX(0, 0, 21, 1, 0, 0)
#define PB5_LPSPI0_SOUT_I               NXP_SIUL2_PINMUX(0, 0, 21, 0, 45, 2)
#define PB8_LPSPI0_SCK_O                NXP_SIUL2_PINMUX(0, 0, 24, 2, 0, 0)
#define PB8_LPSPI0_SCK_I                NXP_SIUL2_PINMUX(0, 0, 24, 0, 43, 2)
#define PB9_LPSPI0_PCS4_O               NXP_SIUL2_PINMUX(0, 0, 25, 2, 0, 0)
#define PB9_LPSPI0_PCS4_I               NXP_SIUL2_PINMUX(0, 0, 25, 0, 39, 1)
#define PB12_LPSPI0_SIN_O               NXP_SIUL2_PINMUX(0, 0, 28, 1, 0, 0)
#define PB12_LPSPI0_SIN_I               NXP_SIUL2_PINMUX(0, 0, 28, 0, 44, 1)
#define PB15_LPSPI0_PCS3_O              NXP_SIUL2_PINMUX(0, 0, 31, 3, 0, 0)
#define PB15_LPSPI0_PCS3_I              NXP_SIUL2_PINMUX(0, 0, 31, 0, 38, 1)
#define PC0_LPSPI0_PCS6_O               NXP_SIUL2_PINMUX(0, 0, 32, 4, 0, 0)
#define PC0_LPSPI0_PCS6_I               NXP_SIUL2_PINMUX(0, 0, 32, 0, 41, 1)
#define PC1_LPSPI0_PCS7_O               NXP_SIUL2_PINMUX(0, 0, 33, 2, 0, 0)
#define PC1_LPSPI0_PCS7_I               NXP_SIUL2_PINMUX(0, 0, 33, 0, 42, 1)
#define PC2_LPSPI0_SCK_O                NXP_SIUL2_PINMUX(0, 0, 34, 2, 0, 0)
#define PC2_LPSPI0_SCK_I                NXP_SIUL2_PINMUX(0, 0, 34, 0, 43, 3)
#define PC7_LPSPI0_SCK_O                NXP_SIUL2_PINMUX(0, 0, 39, 5, 0, 0)
#define PC7_LPSPI0_SCK_I                NXP_SIUL2_PINMUX(0, 0, 39, 0, 43, 4)
#define PC8_LPSPI0_SOUT_O               NXP_SIUL2_PINMUX(0, 0, 40, 3, 0, 0)
#define PC8_LPSPI0_SOUT_I               NXP_SIUL2_PINMUX(0, 0, 40, 0, 45, 3)
#define PC9_LPSPI0_SIN_O                NXP_SIUL2_PINMUX(0, 0, 41, 4, 0, 0)
#define PC9_LPSPI0_SIN_I                NXP_SIUL2_PINMUX(0, 0, 41, 0, 44, 2)
#define PC10_LPSPI0_PCS5_O              NXP_SIUL2_PINMUX(0, 0, 42, 4, 0, 0)
#define PC10_LPSPI0_PCS5_I              NXP_SIUL2_PINMUX(0, 0, 42, 0, 40, 1)
#define PC11_LPSPI0_PCS3_O              NXP_SIUL2_PINMUX(0, 0, 43, 6, 0, 0)
#define PC11_LPSPI0_PCS3_I              NXP_SIUL2_PINMUX(0, 0, 43, 0, 38, 2)
#define PC12_LPSPI0_PCS2_O              NXP_SIUL2_PINMUX(0, 0, 44, 3, 0, 0)
#define PC12_LPSPI0_PCS2_I              NXP_SIUL2_PINMUX(0, 0, 44, 0, 37, 2)
#define PE1_LPSPI0_PCS1_O               NXP_SIUL2_PINMUX(0, 0, 65, 5, 0, 0)
#define PE1_LPSPI0_PCS1_I               NXP_SIUL2_PINMUX(0, 0, 65, 0, 36, 2)
#define PE2_LPSPI0_PCS4_O               NXP_SIUL2_PINMUX(0, 0, 66, 5, 0, 0)
#define PE2_LPSPI0_PCS4_I               NXP_SIUL2_PINMUX(0, 0, 66, 0, 39, 2)
#define PE3_LPSPI0_SCK_O                NXP_SIUL2_PINMUX(0, 0, 67, 5, 0, 0)
#define PE3_LPSPI0_SCK_I                NXP_SIUL2_PINMUX(0, 0, 67, 0, 43, 5)
#define PE5_LPSPI0_PCS3_O               NXP_SIUL2_PINMUX(0, 0, 69, 4, 0, 0)
#define PE5_LPSPI0_PCS3_I               NXP_SIUL2_PINMUX(0, 0, 69, 0, 38, 3)
#define PE6_LPSPI0_PCS2_O               NXP_SIUL2_PINMUX(0, 0, 70, 4, 0, 0)
#define PE6_LPSPI0_PCS2_I               NXP_SIUL2_PINMUX(0, 0, 70, 0, 37, 3)
#define PE7_LPSPI0_PCS0_O               NXP_SIUL2_PINMUX(0, 0, 71, 6, 0, 0)
#define PE7_LPSPI0_PCS0_I               NXP_SIUL2_PINMUX(0, 0, 71, 0, 35, 4)
#define PE8_LPSPI0_SIN_O                NXP_SIUL2_PINMUX(0, 0, 72, 1, 0, 0)
#define PE8_LPSPI0_SIN_I                NXP_SIUL2_PINMUX(0, 0, 72, 0, 44, 3)
#define PE9_LPSPI0_SOUT_O               NXP_SIUL2_PINMUX(0, 0, 73, 6, 0, 0)
#define PE9_LPSPI0_SOUT_I               NXP_SIUL2_PINMUX(0, 0, 73, 0, 45, 4)
#define PE10_LPSPI0_PCS7_O              NXP_SIUL2_PINMUX(0, 0, 74, 5, 0, 0)
#define PE10_LPSPI0_PCS7_I              NXP_SIUL2_PINMUX(0, 0, 74, 0, 42, 2)
#define PE11_LPSPI0_PCS6_O              NXP_SIUL2_PINMUX(0, 0, 75, 6, 0, 0)
#define PE11_LPSPI0_PCS6_I              NXP_SIUL2_PINMUX(0, 0, 75, 0, 41, 2)
#define PE12_LPSPI0_PCS5_O              NXP_SIUL2_PINMUX(0, 0, 76, 4, 0, 0)
#define PE12_LPSPI0_PCS5_I              NXP_SIUL2_PINMUX(0, 0, 76, 0, 40, 2)

/* MAC0 */
#define PA10_MAC0_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 10, 0, 168, 1)
#define PA13_MAC0_SLV_MDIO_O            NXP_SIUL2_PINMUX(0, 0, 13, 6, 0, 0)
#define PA13_MAC0_MII_COL               NXP_SIUL2_PINMUX(0, 0, 13, 0, 145, 1)
#define PA13_MAC0_SLV_MDIO_I            NXP_SIUL2_PINMUX(0, 0, 13, 0, 167, 3)
#define PA14_MAC0_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 14, 0, 168, 2)
#define PB6_MAC0_SLV_MDIO_O             NXP_SIUL2_PINMUX(0, 0, 22, 5, 0, 0)
#define PB6_MAC0_SLV_MDIO_I             NXP_SIUL2_PINMUX(0, 0, 22, 0, 167, 1)
#define PB10_MAC0_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 26, 0, 168, 3)
#define PC1_MAC0_SLV_MDIO_O             NXP_SIUL2_PINMUX(0, 0, 33, 5, 0, 0)
#define PC1_MAC0_SLV_MDIO_I             NXP_SIUL2_PINMUX(0, 0, 33, 0, 167, 2)
#define PC7_MAC0_MII_CRS                NXP_SIUL2_PINMUX(0, 0, 39, 0, 146, 1)
#define PD3_MAC0_RGMII_RXD1_O           NXP_SIUL2_PINMUX(0, 0, 51, 2, 0, 0)
#define PD3_MAC0_MII_RXD1               NXP_SIUL2_PINMUX(0, 0, 51, 0, 148, 1)
#define PD3_MAC0_RMII_RXD1              NXP_SIUL2_PINMUX(0, 0, 51, 0, 157, 1)
#define PD3_MAC0_RGMII_RXD1_I           NXP_SIUL2_PINMUX(0, 0, 51, 0, 162, 1)
#define PD4_MAC0_RGMII_RXD0_O           NXP_SIUL2_PINMUX(0, 0, 52, 3, 0, 0)
#define PD4_MAC0_MII_RXD0               NXP_SIUL2_PINMUX(0, 0, 52, 0, 147, 1)
#define PD4_MAC0_RMII_RXD0              NXP_SIUL2_PINMUX(0, 0, 52, 0, 156, 1)
#define PD4_MAC0_RGMII_RXD0_I           NXP_SIUL2_PINMUX(0, 0, 52, 0, 161, 1)
#define PD5_MAC0_RGMII_RXD2_O           NXP_SIUL2_PINMUX(0, 0, 53, 3, 0, 0)
#define PD5_MAC0_MII_RXD2               NXP_SIUL2_PINMUX(0, 0, 53, 0, 149, 1)
#define PD5_MAC0_RGMII_RXD2_I           NXP_SIUL2_PINMUX(0, 0, 53, 0, 163, 1)
#define PD6_MAC0_MII_RXER               NXP_SIUL2_PINMUX(0, 0, 54, 0, 152, 1)
#define PD6_MAC0_RMII_RXER              NXP_SIUL2_PINMUX(0, 0, 54, 0, 158, 1)
#define PD7_MAC0_RGMII_RXD3_O           NXP_SIUL2_PINMUX(0, 0, 55, 4, 0, 0)
#define PD7_MAC0_MII_RXD3               NXP_SIUL2_PINMUX(0, 0, 55, 0, 150, 1)
#define PD7_MAC0_RGMII_RXD3_I           NXP_SIUL2_PINMUX(0, 0, 55, 0, 164, 1)
#define PD8_MAC0_MII_RXCLK_O            NXP_SIUL2_PINMUX(0, 0, 56, 2, 0, 0)
#define PD8_MAC0_RGMII_RXCLK_O          NXP_SIUL2_PINMUX(0, 0, 56, 5, 0, 0)
#define PD8_MAC0_MII_RXCLK_I            NXP_SIUL2_PINMUX(0, 0, 56, 0, 154, 1)
#define PD8_MAC0_RGMII_RXCLK_I          NXP_SIUL2_PINMUX(0, 0, 56, 0, 166, 1)
#define PD9_MAC0_RGMII_RXCTL_O          NXP_SIUL2_PINMUX(0, 0, 57, 6, 0, 0)
#define PD9_MAC0_MII_RXDV               NXP_SIUL2_PINMUX(0, 0, 57, 0, 151, 1)
#define PD9_MAC0_RMII_CRSDV             NXP_SIUL2_PINMUX(0, 0, 57, 0, 155, 1)
#define PD9_MAC0_RGMII_RXCTL_I          NXP_SIUL2_PINMUX(0, 0, 57, 0, 160, 1)
#define PD10_MAC0_RMII_TXER             NXP_SIUL2_PINMUX(0, 0, 58, 2, 0, 0)
#define PD10_MAC0_MII_TXER              NXP_SIUL2_PINMUX(0, 0, 58, 3, 0, 0)
#define PD11_MAC0_RGMII_TXD2_O          NXP_SIUL2_PINMUX(0, 0, 59, 2, 0, 0)
#define PD11_MAC0_MII_TXD2              NXP_SIUL2_PINMUX(0, 0, 59, 3, 0, 0)
#define PD11_MAC0_RGMII_TXD2_I          NXP_SIUL2_PINMUX(0, 0, 59, 0, 248, 1)
#define PD12_MAC0_RGMII_TXD3_O          NXP_SIUL2_PINMUX(0, 0, 60, 2, 0, 0)
#define PD12_MAC0_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 60, 3, 0, 0)
#define PD12_MAC0_RGMII_TXD3_I          NXP_SIUL2_PINMUX(0, 0, 60, 0, 249, 1)
#define PD13_MAC0_RGMII_TXD1_O          NXP_SIUL2_PINMUX(0, 0, 61, 2, 0, 0)
#define PD13_MAC0_MII_TXD1              NXP_SIUL2_PINMUX(0, 0, 61, 3, 0, 0)
#define PD13_MAC0_RMII_TXD1             NXP_SIUL2_PINMUX(0, 0, 61, 4, 0, 0)
#define PD13_MAC0_RGMII_TXD1_I          NXP_SIUL2_PINMUX(0, 0, 61, 0, 250, 1)
#define PD14_MAC0_RGMII_TXD0_O          NXP_SIUL2_PINMUX(0, 0, 62, 2, 0, 0)
#define PD14_MAC0_MII_TXD0              NXP_SIUL2_PINMUX(0, 0, 62, 3, 0, 0)
#define PD14_MAC0_RMII_TXD0             NXP_SIUL2_PINMUX(0, 0, 62, 4, 0, 0)
#define PD14_MAC0_RGMII_TXD0_I          NXP_SIUL2_PINMUX(0, 0, 62, 0, 251, 1)
#define PD15_MAC0_RGMII_TXCTL_O         NXP_SIUL2_PINMUX(0, 0, 63, 2, 0, 0)
#define PD15_MAC0_MII_TXEN              NXP_SIUL2_PINMUX(0, 0, 63, 3, 0, 0)
#define PD15_MAC0_RMII_TXEN             NXP_SIUL2_PINMUX(0, 0, 63, 4, 0, 0)
#define PD15_MAC0_RGMII_TXCTL_I         NXP_SIUL2_PINMUX(0, 0, 63, 0, 252, 1)
#define PE0_MAC0_RGMII_TXCLK_O          NXP_SIUL2_PINMUX(0, 0, 64, 2, 0, 0)
#define PE0_MAC0_MII_TXCLK_O            NXP_SIUL2_PINMUX(0, 0, 64, 3, 0, 0)
#define PE0_MAC0_MII_TXCLK_I            NXP_SIUL2_PINMUX(0, 0, 64, 0, 153, 1)
#define PE0_MAC0_RMII_REFCLK            NXP_SIUL2_PINMUX(0, 0, 64, 0, 159, 1)
#define PE0_MAC0_RGMII_TXCLK_I          NXP_SIUL2_PINMUX(0, 0, 64, 0, 253, 1)

