zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* MAC1 */
#define PA10_MAC1_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 10, 0, 196, 1)
#define PA13_MAC1_SLV_MDIO_O            NXP_SIUL2_PINMUX(0, 0, 13, 7, 0, 0)
#define PA13_MAC1_SLV_MDIO_I            NXP_SIUL2_PINMUX(0, 0, 13, 0, 195, 3)
#define PA14_MAC1_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 14, 0, 196, 2)
#define PB2_MAC1_RGMII_TXCTL_O          NXP_SIUL2_PINMUX(0, 0, 18, 1, 0, 0)
#define PB2_MAC1_RMII_TXEN              NXP_SIUL2_PINMUX(0, 0, 18, 2, 0, 0)
#define PB2_MAC1_RMII_TXER              NXP_SIUL2_PINMUX(0, 0, 18, 3, 0, 0)
#define PB2_MAC1_MII_TXEN               NXP_SIUL2_PINMUX(0, 0, 18, 4, 0, 0)
#define PB2_MAC1_MII_TXER               NXP_SIUL2_PINMUX(0, 0, 18, 5, 0, 0)
#define PB2_MAC1_RGMII_TXCTL_I          NXP_SIUL2_PINMUX(0, 0, 18, 0, 240, 1)
#define PB3_MAC1_RGMII_RXCTL_O          NXP_SIUL2_PINMUX(0, 0, 19, 8, 0, 0)
#define PB3_MAC1_MII_RXDV               NXP_SIUL2_PINMUX(0, 0, 19, 0, 176, 2)
#define PB3_MAC1_MII_RXER               NXP_SIUL2_PINMUX(0, 0, 19, 0, 177, 1)
#define PB3_MAC1_RMII_CRSDV             NXP_SIUL2_PINMUX(0, 0, 19, 0, 180, 2)
#define PB3_MAC1_RMII_RXER              NXP_SIUL2_PINMUX(0, 0, 19, 0, 183, 1)
#define PB3_MAC1_RGMII_RXCTL_I          NXP_SIUL2_PINMUX(0, 0, 19, 0, 184, 2)
#define PB4_MAC1_MII_COL                NXP_SIUL2_PINMUX(0, 0, 20, 0, 170, 1)
#define PB5_MAC1_RGMII_RXD0_O           NXP_SIUL2_PINMUX(0, 0, 21, 2, 0, 0)
#define PB5_MAC1_MII_RXD0               NXP_SIUL2_PINMUX(0, 0, 21, 0, 172, 2)
#define PB5_MAC1_MII_RXD3               NXP_SIUL2_PINMUX(0, 0, 21, 0, 175, 1)
#define PB5_MAC1_RMII_RXD0              NXP_SIUL2_PINMUX(0, 0, 21, 0, 181, 2)
#define PB5_MAC1_RGMII_RXD0_I           NXP_SIUL2_PINMUX(0, 0, 21, 0, 185, 2)
#define PB5_MAC1_RGMII_RXD3             NXP_SIUL2_PINMUX(0, 0, 21, 0, 188, 1)
#define PB6_MAC1_SLV_MDIO_O             NXP_SIUL2_PINMUX(0, 0, 22, 6, 0, 0)
#define PB6_MAC1_MII_CRS                NXP_SIUL2_PINMUX(0, 0, 22, 0, 171, 1)
#define PB6_MAC1_SLV_MDIO_I             NXP_SIUL2_PINMUX(0, 0, 22, 0, 195, 1)
#define PB10_MAC1_SLV_MDC               NXP_SIUL2_PINMUX(0, 0, 26, 0, 196, 3)
#define PB11_MAC1_RGMII_RXD1_O          NXP_SIUL2_PINMUX(0, 0, 27, 1, 0, 0)
#define PB11_MAC1_MII_RXD1              NXP_SIUL2_PINMUX(0, 0, 27, 0, 173, 1)
#define PB11_MAC1_RMII_RXD1             NXP_SIUL2_PINMUX(0, 0, 27, 0, 182, 1)
#define PB11_MAC1_RGMII_RXD1_I          NXP_SIUL2_PINMUX(0, 0, 27, 0, 186, 1)
#define PB12_MAC1_RGMII_RXD2_O          NXP_SIUL2_PINMUX(0, 0, 28, 2, 0, 0)
#define PB12_MAC1_MII_RXD2              NXP_SIUL2_PINMUX(0, 0, 28, 0, 174, 1)
#define PB12_MAC1_RGMII_RXD2_I          NXP_SIUL2_PINMUX(0, 0, 28, 0, 187, 1)
#define PC1_MAC1_SLV_MDIO_O             NXP_SIUL2_PINMUX(0, 0, 33, 6, 0, 0)
#define PC1_MAC1_SLV_MDIO_I             NXP_SIUL2_PINMUX(0, 0, 33, 0, 195, 2)
#define PC2_MAC1_MII_RXCLK_O            NXP_SIUL2_PINMUX(0, 0, 34, 1, 0, 0)
#define PC2_MAC1_RGMII_RXCLK_O          NXP_SIUL2_PINMUX(0, 0, 34, 3, 0, 0)
#define PC2_MAC1_MII_RXCLK_I            NXP_SIUL2_PINMUX(0, 0, 34, 0, 179, 1)
#define PC2_MAC1_RGMII_RXCLK_I          NXP_SIUL2_PINMUX(0, 0, 34, 0, 190, 1)
#define PC3_MAC1_MII_RXDV               NXP_SIUL2_PINMUX(0, 0, 35, 0, 176, 1)
#define PC3_MAC1_RMII_CRSDV             NXP_SIUL2_PINMUX(0, 0, 35, 0, 180, 1)
#define PC3_MAC1_RGMII_RXCTL            NXP_SIUL2_PINMUX(0, 0, 35, 0, 184, 1)
#define PC4_MAC1_RGMII_RXD3_O           NXP_SIUL2_PINMUX(0, 0, 36, 1, 0, 0)
#define PC4_MAC1_MII_RXD0               NXP_SIUL2_PINMUX(0, 0, 36, 0, 172, 1)
#define PC4_MAC1_MII_RXD3               NXP_SIUL2_PINMUX(0, 0, 36, 0, 175, 2)
#define PC4_MAC1_RMII_RXD0              NXP_SIUL2_PINMUX(0, 0, 36, 0, 181, 1)
#define PC4_MAC1_RGMII_RXD0             NXP_SIUL2_PINMUX(0, 0, 36, 0, 185, 1)
#define PC4_MAC1_RGMII_RXD3_I           NXP_SIUL2_PINMUX(0, 0, 36, 0, 188, 2)
#define PC5_MAC1_MII_TXCLK_O            NXP_SIUL2_PINMUX(0, 0, 37, 1, 0, 0)
#define PC5_MAC1_RGMII_TXCLK_O          NXP_SIUL2_PINMUX(0, 0, 37, 8, 0, 0)
#define PC5_MAC1_MII_TXCLK_I            NXP_SIUL2_PINMUX(0, 0, 37, 0, 178, 1)
#define PC5_MAC1_RMII_REFCLK            NXP_SIUL2_PINMUX(0, 0, 37, 0, 194, 1)
#define PC5_MAC1_RGMII_TXCLK_I          NXP_SIUL2_PINMUX(0, 0, 37, 0, 241, 1)
#define PC11_MAC1_RGMII_TXD3            NXP_SIUL2_PINMUX(0, 0, 43, 1, 0, 0)
#define PC11_MAC1_RGMII_TXD0_O          NXP_SIUL2_PINMUX(0, 0, 43, 2, 0, 0)
#define PC11_MAC1_RMII_TXD0             NXP_SIUL2_PINMUX(0, 0, 43, 3, 0, 0)
#define PC11_MAC1_MII_TXD0              NXP_SIUL2_PINMUX(0, 0, 43, 4, 0, 0)
#define PC11_MAC1_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 43, 5, 0, 0)
#define PC11_MAC1_RGMII_TXD0_I          NXP_SIUL2_PINMUX(0, 0, 43, 0, 242, 1)
#define PC12_MAC1_RGMII_TXD2_O          NXP_SIUL2_PINMUX(0, 0, 44, 1, 0, 0)
#define PC12_MAC1_MII_TXD2              NXP_SIUL2_PINMUX(0, 0, 44, 2, 0, 0)
#define PC12_MAC1_RGMII_TXD2_I          NXP_SIUL2_PINMUX(0, 0, 44, 0, 243, 1)
#define PC13_MAC1_RGMII_TXD1_O          NXP_SIUL2_PINMUX(0, 0, 45, 1, 0, 0)
#define PC13_MAC1_RMII_TXD1             NXP_SIUL2_PINMUX(0, 0, 45, 2, 0, 0)
#define PC13_MAC1_MII_TXD1              NXP_SIUL2_PINMUX(0, 0, 45, 3, 0, 0)
#define PC13_MAC1_RGMII_TXD1_I          NXP_SIUL2_PINMUX(0, 0, 45, 0, 244, 1)
#define PC14_MAC1_RGMII_TXD0            NXP_SIUL2_PINMUX(0, 0, 46, 1, 0, 0)
#define PC14_MAC1_RGMII_TXD3_O          NXP_SIUL2_PINMUX(0, 0, 46, 2, 0, 0)
#define PC14_MAC1_RMII_TXD0             NXP_SIUL2_PINMUX(0, 0, 46, 3, 0, 0)
#define PC14_MAC1_MII_TXD0              NXP_SIUL2_PINMUX(0, 0, 46, 4, 0, 0)
#define PC14_MAC1_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 46, 5, 0, 0)
#define PC14_MAC1_RGMII_TXD3_I          NXP_SIUL2_PINMUX(0, 0, 46, 0, 245, 1)
#define PC15_MAC1_RGMII_TXCTL           NXP_SIUL2_PINMUX(0, 0, 47, 1, 0, 0)
#define PC15_MAC1_RMII_TXEN             NXP_SIUL2_PINMUX(0, 0, 47, 2, 0, 0)
#define PC15_MAC1_MII_TXEN              NXP_SIUL2_PINMUX(0, 0, 47, 4, 0, 0)
#define PC15_MAC1_MII_TXER              NXP_SIUL2_PINMUX(0, 0, 47, 5, 0, 0)
#define PE3_MAC1_TC14_RX_O              NXP_SIUL2_PINMUX(0, 0, 67, 4, 0, 0)
#define PE3_MAC1_TC14_RX_I              NXP_SIUL2_PINMUX(0, 0, 67, 0, 192, 1)
#define PE8_MAC1_TC14_TX                NXP_SIUL2_PINMUX(0, 0, 72, 4, 0, 0)
#define PE9_MAC1_TC14_ED_O              NXP_SIUL2_PINMUX(0, 0, 73, 5, 0, 0)
#define PE9_MAC1_TC14_ED_I              NXP_SIUL2_PINMUX(0, 0, 73, 0, 193, 1)

/* CANXL0 */
#define PB4_CANXL0_TX                   NXP_SIUL2_PINMUX(0, 0, 20, 2, 0, 0)
#define PB6_CANXL0_RX                   NXP_SIUL2_PINMUX(0, 0, 22, 0, 235, 1)
#define PC8_CANXL0_TX                   NXP_SIUL2_PINMUX(0, 0, 40, 6, 0, 0)
#define PC9_CANXL0_RX                   NXP_SIUL2_PINMUX(0, 0, 41, 0, 235, 2)
#define PC15_CANXL0_TX                  NXP_SIUL2_PINMUX(0, 0, 47, 8, 0, 0)
#define PE3_CANXL0_RX                   NXP_SIUL2_PINMUX(0, 0, 67, 0, 235, 3)
#define PE13_CANXL0_RX                  NXP_SIUL2_PINMUX(0, 0, 77, 0, 235, 4)
#define PE14_CANXL0_TX                  NXP_SIUL2_PINMUX(0, 0, 78, 1, 0, 0)

