zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* SYSTEM */
#define PC3_CLKOUT_RUN                  NXP_SIUL2_PINMUX(0, 0, 35, 7, 0, 0)
#define PC7_CLKOUT_RUN                  NXP_SIUL2_PINMUX(0, 0, 39, 1, 0, 0)
#define PC8_CLKOUT_RUN                  NXP_SIUL2_PINMUX(0, 0, 40, 5, 0, 0)
#define PK3_CLKOUT_LPRUN                NXP_SIUL2_PINMUX(2, 2, 163, 10, 0, 0)
#define PK7_CLKOUT_STANDBY              NXP_SIUL2_PINMUX(2, 2, 167, 7, 0, 0)
#define PK8_CLKOUT_LPRUN                NXP_SIUL2_PINMUX(2, 2, 168, 7, 0, 0)
#define PK10_CLKOUT_STANDBY             NXP_SIUL2_PINMUX(2, 2, 170, 8, 0, 0)
#define PL4_CLKOUT_LPRUN                NXP_SIUL2_PINMUX(2, 2, 180, 4, 0, 0)
#define PM3_CLKOUT_LPRUN                NXP_SIUL2_PINMUX(2, 2, 195, 7, 0, 0)

/* MAC3 */
#define PE2_MAC3_TC14_ED_O              NXP_SIUL2_PINMUX(0, 0, 66, 1, 0, 0)
#define PE2_MAC3_TC14_ED_I              NXP_SIUL2_PINMUX(0, 0, 66, 0, 226, 1)
#define PE4_MAC3_TC14_RX_O              NXP_SIUL2_PINMUX(0, 0, 68, 1, 0, 0)
#define PE4_MAC3_TC14_RX_I              NXP_SIUL2_PINMUX(0, 0, 68, 0, 225, 1)
#define PE12_MAC3_TC14_TX               NXP_SIUL2_PINMUX(0, 0, 76, 1, 0, 0)

/* MAC4 */
#define PE5_MAC4_TC14_ED_O              NXP_SIUL2_PINMUX(0, 0, 69, 1, 0, 0)
#define PE5_MAC4_TC14_ED_I              NXP_SIUL2_PINMUX(0, 0, 69, 0, 232, 1)
#define PE10_MAC4_TC14_TX               NXP_SIUL2_PINMUX(0, 0, 74, 1, 0, 0)
#define PE11_MAC4_TC14_RX_O             NXP_SIUL2_PINMUX(0, 0, 75, 1, 0, 0)
#define PE11_MAC4_TC14_RX_I             NXP_SIUL2_PINMUX(0, 0, 75, 0, 231, 1)

/* SIUL1 */
#define PF0_SIUL1_EIRQ0                 NXP_SIUL2_PINMUX(1, 1, 80, 0, 0, 1)
#define PF1_SIUL1_EIRQ1                 NXP_SIUL2_PINMUX(1, 1, 81, 0, 1, 1)
#define PF2_SIUL1_EIRQ11                NXP_SIUL2_PINMUX(1, 1, 82, 0, 11, 1)
#define PF3_SIUL1_EIRQ3                 NXP_SIUL2_PINMUX(1, 1, 83, 0, 3, 2)
#define PF4_SIUL1_EIRQ3                 NXP_SIUL2_PINMUX(1, 1, 84, 0, 3, 1)
#define PF5_SIUL1_EIRQ5                 NXP_SIUL2_PINMUX(1, 1, 85, 0, 5, 2)
#define PF6_SIUL1_EIRQ2                 NXP_SIUL2_PINMUX(1, 1, 86, 0, 2, 1)
#define PF7_SIUL1_EIRQ12                NXP_SIUL2_PINMUX(1, 1, 87, 0, 12, 1)
#define PF9_SIUL1_EIRQ9                 NXP_SIUL2_PINMUX(1, 1, 89, 0, 9, 2)
#define PF10_SIUL1_EIRQ10               NXP_SIUL2_PINMUX(1, 1, 90, 0, 10, 1)
#define PF11_SIUL1_EIRQ4                NXP_SIUL2_PINMUX(1, 1, 91, 0, 4, 1)
#define PF13_SIUL1_EIRQ7                NXP_SIUL2_PINMUX(1, 1, 93, 0, 7, 1)
#define PF15_SIUL1_EIRQ8                NXP_SIUL2_PINMUX(1, 1, 95, 0, 8, 1)
#define PG0_SIUL1_EIRQ9                 NXP_SIUL2_PINMUX(1, 1, 96, 0, 9, 1)
#define PG1_SIUL1_EIRQ0                 NXP_SIUL2_PINMUX(1, 1, 97, 0, 0, 2)
#define PG2_SIUL1_EIRQ10                NXP_SIUL2_PINMUX(1, 1, 98, 0, 10, 2)
#define PG3_SIUL1_EIRQ1                 NXP_SIUL2_PINMUX(1, 1, 99, 0, 1, 2)
#define PG4_SIUL1_EIRQ13                NXP_SIUL2_PINMUX(1, 1, 100, 0, 13, 1)
#define PG5_SIUL1_EIRQ14                NXP_SIUL2_PINMUX(1, 1, 101, 0, 14, 1)
#define PG6_SIUL1_EIRQ15                NXP_SIUL2_PINMUX(1, 1, 102, 0, 15, 1)
#define PG8_SIUL1_EIRQ5                 NXP_SIUL2_PINMUX(1, 1, 104, 0, 5, 1)
#define PG9_SIUL1_EIRQ2                 NXP_SIUL2_PINMUX(1, 1, 105, 0, 2, 2)
#define PG10_SIUL1_EIRQ4                NXP_SIUL2_PINMUX(1, 1, 106, 0, 4, 2)
#define PG13_SIUL1_EIRQ6                NXP_SIUL2_PINMUX(1, 1, 109, 0, 6, 2)
#define PG14_SIUL1_EIRQ7                NXP_SIUL2_PINMUX(1, 1, 110, 0, 7, 2)
#define PG15_SIUL1_EIRQ6                NXP_SIUL2_PINMUX(1, 1, 111, 0, 6, 1)
#define PH0_SIUL1_EIRQ8                 NXP_SIUL2_PINMUX(1, 1, 112, 0, 8, 2)
#define PH4_SIUL1_EIRQ15                NXP_SIUL2_PINMUX(1, 1, 116, 0, 15, 2)
#define PH14_SIUL1_EIRQ11               NXP_SIUL2_PINMUX(1, 1, 126, 0, 11, 2)
#define PH15_SIUL1_EIRQ12               NXP_SIUL2_PINMUX(1, 1, 127, 0, 12, 2)
#define PI0_SIUL1_EIRQ13                NXP_SIUL2_PINMUX(1, 1, 128, 0, 13, 2)
#define PI1_SIUL1_EIRQ14                NXP_SIUL2_PINMUX(1, 1, 129, 0, 14, 2)
#define PI2_SIUL1_EIRQ0                 NXP_SIUL2_PINMUX(1, 1, 130, 0, 0, 3)
#define PI3_SIUL1_EIRQ1                 NXP_SIUL2_PINMUX(1, 1, 131, 0, 1, 3)
#define PI4_SIUL1_EIRQ2                 NXP_SIUL2_PINMUX(1, 1, 132, 0, 2, 3)
#define PI5_SIUL1_EIRQ3                 NXP_SIUL2_PINMUX(1, 1, 133, 0, 3, 3)
#define PI6_SIUL1_EIRQ4                 NXP_SIUL2_PINMUX(1, 1, 134, 0, 4, 3)
#define PI7_SIUL1_EIRQ5                 NXP_SIUL2_PINMUX(1, 1, 135, 0, 5, 3)
#define PI8_SIUL1_EIRQ6                 NXP_SIUL2_PINMUX(1, 1, 136, 0, 6, 3)
#define PI9_SIUL1_EIRQ7                 NXP_SIUL2_PINMUX(1, 1, 137, 0, 7, 3)
#define PI10_SIUL1_EIRQ8                NXP_SIUL2_PINMUX(1, 1, 138, 0, 8, 3)

/* SAI0 */
#define PF0_SAI0_SYNC_O                 NXP_SIUL2_PINMUX(1, 1, 80, 1, 0, 0)
#define PF0_SAI0_SYNC_I                 NXP_SIUL2_PINMUX(1, 1, 80, 0, 170, 1)
#define PF1_SAI0_D1_O                   NXP_SIUL2_PINMUX(1, 1, 81, 7, 0, 0)
#define PF1_SAI0_D1_I                   NXP_SIUL2_PINMUX(1, 1, 81, 0, 166, 1)
#define PF2_SAI0_D0_O                   NXP_SIUL2_PINMUX(1, 1, 82, 1, 0, 0)
#define PF2_SAI0_D0_I                   NXP_SIUL2_PINMUX(1, 1, 82, 0, 165, 1)
#define PF4_SAI0_D2_O                   NXP_SIUL2_PINMUX(1, 1, 84, 1, 0, 0)
#define PF4_SAI0_D2_I                   NXP_SIUL2_PINMUX(1, 1, 84, 0, 167, 1)
#define PF5_SAI0_D3_O                   NXP_SIUL2_PINMUX(1, 1, 85, 4, 0, 0)
#define PF5_SAI0_D3_I                   NXP_SIUL2_PINMUX(1, 1, 85, 0, 168, 1)
#define PG4_SAI0_D2_O                   NXP_SIUL2_PINMUX(1, 1, 100, 3, 0, 0)
#define PG4_SAI0_D2_I                   NXP_SIUL2_PINMUX(1, 1, 100, 0, 167, 2)
#define PG5_SAI0_D3_O                   NXP_SIUL2_PINMUX(1, 1, 101, 4, 0, 0)
#define PG5_SAI0_D3_I                   NXP_SIUL2_PINMUX(1, 1, 101, 0, 168, 2)
#define PG8_SAI0_D1_O                   NXP_SIUL2_PINMUX(1, 1, 104, 4, 0, 0)
#define PG8_SAI0_D1_I                   NXP_SIUL2_PINMUX(1, 1, 104, 0, 166, 2)
#define PG9_SAI0_D0_O                   NXP_SIUL2_PINMUX(1, 1, 105, 1, 0, 0)
#define PG9_SAI0_D0_I                   NXP_SIUL2_PINMUX(1, 1, 105, 0, 165, 2)
#define PG10_SAI0_SYNC_O                NXP_SIUL2_PINMUX(1, 1, 106, 1, 0, 0)
#define PG10_SAI0_SYNC_I                NXP_SIUL2_PINMUX(1, 1, 106, 0, 170, 2)
#define PG14_SAI0_MCLK_O                NXP_SIUL2_PINMUX(1, 1, 110, 5, 0, 0)
#define PG14_SAI0_MCLK_I                NXP_SIUL2_PINMUX(1, 1, 110, 0, 169, 1)
#define PG15_SAI0_BCLK_O                NXP_SIUL2_PINMUX(1, 1, 111, 1, 0, 0)
#define PG15_SAI0_BCLK_I                NXP_SIUL2_PINMUX(1, 1, 111, 0, 164, 1)

/* FXIO0 */
#define PF0_FXIO0_D31_O                 NXP_SIUL2_PINMUX(1, 1, 80, 2, 0, 0)
#define PF0_FXIO0_D15_O                 NXP_SIUL2_PINMUX(1, 1, 80, 3, 0, 0)
#define PF0_FXIO0_D15_I                 NXP_SIUL2_PINMUX(1, 1, 80, 0, 132, 1)
#define PF0_FXIO0_D31_I                 NXP_SIUL2_PINMUX(1, 1, 80, 0, 148, 1)
#define PF1_FXIO0_D22_O                 NXP_SIUL2_PINMUX(1, 1, 81, 3, 0, 0)
#define PF1_FXIO0_D6_O                  NXP_SIUL2_PINMUX(1, 1, 81, 6, 0, 0)
#define PF1_FXIO0_D6_I                  NXP_SIUL2_PINMUX(1, 1, 81, 0, 123, 1)
#define PF1_FXIO0_D22_I                 NXP_SIUL2_PINMUX(1, 1, 81, 0, 139, 2)
#define PF2_FXIO0_D7_O                  NXP_SIUL2_PINMUX(1, 1, 82, 4, 0, 0)
#define PF2_FXIO0_D23_O                 NXP_SIUL2_PINMUX(1, 1, 82, 6, 0, 0)
#define PF2_FXIO0_D7_I                  NXP_SIUL2_PINMUX(1, 1, 82, 0, 124, 1)
#define PF2_FXIO0_D23_I                 NXP_SIUL2_PINMUX(1, 1, 82, 0, 140, 1)
#define PF3_FXIO0_D25_O                 NXP_SIUL2_PINMUX(1, 1, 83, 2, 0, 0)
#define PF3_FXIO0_D9_O                  NXP_SIUL2_PINMUX(1, 1, 83, 5, 0, 0)
#define PF3_FXIO0_D9_I                  NXP_SIUL2_PINMUX(1, 1, 83, 0, 126, 1)
#define PF3_FXIO0_D25_I                 NXP_SIUL2_PINMUX(1, 1, 83, 0, 142, 1)
#define PF4_FXIO0_D26_O                 NXP_SIUL2_PINMUX(1, 1, 84, 2, 0, 0)
#define PF4_FXIO0_D10_O                 NXP_SIUL2_PINMUX(1, 1, 84, 3, 0, 0)
#define PF4_FXIO0_D10_I                 NXP_SIUL2_PINMUX(1, 1, 84, 0, 127, 1)
#define PF4_FXIO0_D26_I                 NXP_SIUL2_PINMUX(1, 1, 84, 0, 143, 1)
#define PF5_FXIO0_D12_O                 NXP_SIUL2_PINMUX(1, 1, 85, 5, 0, 0)
#define PF5_FXIO0_D28_O                 NXP_SIUL2_PINMUX(1, 1, 85, 6, 0, 0)
#define PF5_FXIO0_D12_I                 NXP_SIUL2_PINMUX(1, 1, 85, 0, 129, 1)
#define PF5_FXIO0_D28_I                 NXP_SIUL2_PINMUX(1, 1, 85, 0, 145, 1)
#define PF6_FXIO0_D13_O                 NXP_SIUL2_PINMUX(1, 1, 86, 2, 0, 0)
#define PF6_FXIO0_D29_O                 NXP_SIUL2_PINMUX(1, 1, 86, 5, 0, 0)
#define PF6_FXIO0_D13_I                 NXP_SIUL2_PINMUX(1, 1, 86, 0, 130, 1)
#define PF6_FXIO0_D29_I                 NXP_SIUL2_PINMUX(1, 1, 86, 0, 146, 1)
#define PF7_FXIO0_D14_O                 NXP_SIUL2_PINMUX(1, 1, 87, 2, 0, 0)
#define PF7_FXIO0_D30_O                 NXP_SIUL2_PINMUX(1, 1, 87, 3, 0, 0)
#define PF7_FXIO0_D14_I                 NXP_SIUL2_PINMUX(1, 1, 87, 0, 131, 1)
#define PF7_FXIO0_D30_I                 NXP_SIUL2_PINMUX(1, 1, 87, 0, 147, 1)
#define PF9_FXIO0_D0_O                  NXP_SIUL2_PINMUX(1, 1, 89, 3, 0, 0)
#define PF9_FXIO0_D16_O                 NXP_SIUL2_PINMUX(1, 1, 89, 4, 0, 0)
#define PF9_FXIO0_D0_I                  NXP_SIUL2_PINMUX(1, 1, 89, 0, 117, 1)
#define PF9_FXIO0_D16_I                 NXP_SIUL2_PINMUX(1, 1, 89, 0, 133, 1)
#define PF10_FXIO0_D16_O                NXP_SIUL2_PINMUX(1, 1, 90, 2, 0, 0)
#define PF10_FXIO0_D0_O                 NXP_SIUL2_PINMUX(1, 1, 90, 3, 0, 0)
#define PF10_FXIO0_D0_I                 NXP_SIUL2_PINMUX(1, 1, 90, 0, 117, 2)
#define PF10_FXIO0_D16_I                NXP_SIUL2_PINMUX(1, 1, 90, 0, 133, 2)
#define PF11_FXIO0_D26_O                NXP_SIUL2_PINMUX(1, 1, 91, 2, 0, 0)
#define PF11_FXIO0_D10_O                NXP_SIUL2_PINMUX(1, 1, 91, 3, 0, 0)
#define PF11_FXIO0_D10_I                NXP_SIUL2_PINMUX(1, 1, 91, 0, 127, 2)
#define PF11_FXIO0_D26_I                NXP_SIUL2_PINMUX(1, 1, 91, 0, 143, 2)
#define PF13_FXIO0_D25_O                NXP_SIUL2_PINMUX(1, 1, 93, 2, 0, 0)
#define PF13_FXIO0_D9_O                 NXP_SIUL2_PINMUX(1, 1, 93, 4, 0, 0)
#define PF13_FXIO0_D9_I                 NXP_SIUL2_PINMUX(1, 1, 93, 0, 126, 2)
#define PF13_FXIO0_D25_I                NXP_SIUL2_PINMUX(1, 1, 93, 0, 142, 2)
#define PF14_FXIO0_D20_O                NXP_SIUL2_PINMUX(1, 1, 94, 1, 0, 0)
#define PF14_FXIO0_D4_O                 NXP_SIUL2_PINMUX(1, 1, 94, 8, 0, 0)
#define PF14_FXIO0_D4_I                 NXP_SIUL2_PINMUX(1, 1, 94, 0, 121, 1)
#define PF14_FXIO0_D20_I                NXP_SIUL2_PINMUX(1, 1, 94, 0, 137, 1)
#define PF15_FXIO0_D6_O                 NXP_SIUL2_PINMUX(1, 1, 95, 1, 0, 0)
#define PF15_FXIO0_D22_O                NXP_SIUL2_PINMUX(1, 1, 95, 9, 0, 0)
#define PF15_FXIO0_D6_I                 NXP_SIUL2_PINMUX(1, 1, 95, 0, 123, 2)
#define PF15_FXIO0_D22_I                NXP_SIUL2_PINMUX(1, 1, 95, 0, 139, 1)
#define PG0_FXIO0_D23_O                 NXP_SIUL2_PINMUX(1, 1, 96, 3, 0, 0)
#define PG0_FXIO0_D7_O                  NXP_SIUL2_PINMUX(1, 1, 96, 5, 0, 0)
#define PG0_FXIO0_D7_I                  NXP_SIUL2_PINMUX(1, 1, 96, 0, 124, 2)
#define PG0_FXIO0_D23_I                 NXP_SIUL2_PINMUX(1, 1, 96, 0, 140, 2)
#define PG1_FXIO0_D17_O                 NXP_SIUL2_PINMUX(1, 1, 97, 3, 0, 0)
#define PG1_FXIO0_D1_O                  NXP_SIUL2_PINMUX(1, 1, 97, 4, 0, 0)
#define PG1_FXIO0_D1_I                  NXP_SIUL2_PINMUX(1, 1, 97, 0, 118, 1)
#define PG1_FXIO0_D17_I                 NXP_SIUL2_PINMUX(1, 1, 97, 0, 134, 1)
#define PG2_FXIO0_D18_O                 NXP_SIUL2_PINMUX(1, 1, 98, 1, 0, 0)
#define PG2_FXIO0_D2_O                  NXP_SIUL2_PINMUX(1, 1, 98, 4, 0, 0)
#define PG2_FXIO0_D2_I                  NXP_SIUL2_PINMUX(1, 1, 98, 0, 119, 2)
#define PG2_FXIO0_D18_I                 NXP_SIUL2_PINMUX(1, 1, 98, 0, 135, 1)
#define PG3_FXIO0_D21_O                 NXP_SIUL2_PINMUX(1, 1, 99, 1, 0, 0)
#define PG3_FXIO0_D5_O                  NXP_SIUL2_PINMUX(1, 1, 99, 7, 0, 0)
#define PG3_FXIO0_D5_I                  NXP_SIUL2_PINMUX(1, 1, 99, 0, 122, 1)
#define PG3_FXIO0_D21_I                 NXP_SIUL2_PINMUX(1, 1, 99, 0, 138, 2)
#define PG4_FXIO0_D12_O                 NXP_SIUL2_PINMUX(1, 1, 100, 1, 0, 0)
#define PG4_FXIO0_D28_O                 NXP_SIUL2_PINMUX(1, 1, 100, 9, 0, 0)
#define PG4_FXIO0_D12_I                 NXP_SIUL2_PINMUX(1, 1, 100, 0, 129, 2)
#define PG4_FXIO0_D28_I                 NXP_SIUL2_PINMUX(1, 1, 100, 0, 145, 2)
#define PG5_FXIO0_D4_O                  NXP_SIUL2_PINMUX(1, 1, 101, 1, 0, 0)
#define PG5_FXIO0_D20_O                 NXP_SIUL2_PINMUX(1, 1, 101, 6, 0, 0)
#define PG5_FXIO0_D4_I                  NXP_SIUL2_PINMUX(1, 1, 101, 0, 121, 2)
#define PG5_FXIO0_D20_I                 NXP_SIUL2_PINMUX(1, 1, 101, 0, 137, 2)
#define PG6_FXIO0_D5_O                  NXP_SIUL2_PINMUX(1, 1, 102, 1, 0, 0)
#define PG6_FXIO0_D21_O                 NXP_SIUL2_PINMUX(1, 1, 102, 8, 0, 0)
#define PG6_FXIO0_D5_I                  NXP_SIUL2_PINMUX(1, 1, 102, 0, 122, 2)
#define PG6_FXIO0_D21_I                 NXP_SIUL2_PINMUX(1, 1, 102, 0, 138, 1)
#define PG7_FXIO0_D3_O                  NXP_SIUL2_PINMUX(1, 1, 103, 1, 0, 0)
#define PG7_FXIO0_D19_O                 NXP_SIUL2_PINMUX(1, 1, 103, 9, 0, 0)
#define PG7_FXIO0_D3_I                  NXP_SIUL2_PINMUX(1, 1, 103, 0, 120, 1)
#define PG7_FXIO0_D19_I                 NXP_SIUL2_PINMUX(1, 1, 103, 0, 136, 1)
#define PG8_FXIO0_D24_O                 NXP_SIUL2_PINMUX(1, 1, 104, 3, 0, 0)
#define PG8_FXIO0_D8_O                  NXP_SIUL2_PINMUX(1, 1, 104, 5, 0, 0)
#define PG8_FXIO0_D8_I                  NXP_SIUL2_PINMUX(1, 1, 104, 0, 125, 1)
#define PG8_FXIO0_D24_I                 NXP_SIUL2_PINMUX(1, 1, 104, 0, 141, 1)
#define PG9_FXIO0_D17_O                 NXP_SIUL2_PINMUX(1, 1, 105, 3, 0, 0)
#define PG9_FXIO0_D1_O                  NXP_SIUL2_PINMUX(1, 1, 105, 4, 0, 0)
#define PG9_FXIO0_D1_I                  NXP_SIUL2_PINMUX(1, 1, 105, 0, 118, 2)
#define PG9_FXIO0_D17_I                 NXP_SIUL2_PINMUX(1, 1, 105, 0, 134, 2)
#define PG10_FXIO0_D3_O                 NXP_SIUL2_PINMUX(1, 1, 106, 2, 0, 0)
#define PG10_FXIO0_D19_O                NXP_SIUL2_PINMUX(1, 1, 106, 4, 0, 0)
#define PG10_FXIO0_D3_I                 NXP_SIUL2_PINMUX(1, 1, 106, 0, 120, 2)
#define PG10_FXIO0_D19_I                NXP_SIUL2_PINMUX(1, 1, 106, 0, 136, 2)
#define PG11_FXIO0_D2_O                 NXP_SIUL2_PINMUX(1, 1, 107, 3, 0, 0)
#define PG11_FXIO0_D18_O                NXP_SIUL2_PINMUX(1, 1, 107, 4, 0, 0)
#define PG11_FXIO0_D2_I                 NXP_SIUL2_PINMUX(1, 1, 107, 0, 119, 1)
#define PG11_FXIO0_D18_I                NXP_SIUL2_PINMUX(1, 1, 107, 0, 135, 2)
#define PG12_FXIO0_D13_O                NXP_SIUL2_PINMUX(1, 1, 108, 1, 0, 0)
#define PG12_FXIO0_D29_O                NXP_SIUL2_PINMUX(1, 1, 108, 8, 0, 0)
#define PG12_FXIO0_D13_I                NXP_SIUL2_PINMUX(1, 1, 108, 0, 130, 2)
#define PG12_FXIO0_D29_I                NXP_SIUL2_PINMUX(1, 1, 108, 0, 146, 2)
#define PG14_FXIO0_D15_O                NXP_SIUL2_PINMUX(1, 1, 110, 2, 0, 0)
#define PG14_FXIO0_D31_O                NXP_SIUL2_PINMUX(1, 1, 110, 6, 0, 0)
#define PG14_FXIO0_D15_I                NXP_SIUL2_PINMUX(1, 1, 110, 0, 132, 2)
#define PG14_FXIO0_D31_I                NXP_SIUL2_PINMUX(1, 1, 110, 0, 148, 2)
#define PG15_FXIO0_D30_O                NXP_SIUL2_PINMUX(1, 1, 111, 4, 0, 0)
#define PG15_FXIO0_D14_O                NXP_SIUL2_PINMUX(1, 1, 111, 5, 0, 0)
#define PG15_FXIO0_D14_I                NXP_SIUL2_PINMUX(1, 1, 111, 0, 131, 2)
#define PG15_FXIO0_D30_I                NXP_SIUL2_PINMUX(1, 1, 111, 0, 147, 2)
#define PH0_FXIO0_D11_O                 NXP_SIUL2_PINMUX(1, 1, 112, 2, 0, 0)
#define PH0_FXIO0_D27_O                 NXP_SIUL2_PINMUX(1, 1, 112, 4, 0, 0)
#define PH0_FXIO0_D11_I                 NXP_SIUL2_PINMUX(1, 1, 112, 0, 128, 1)
#define PH0_FXIO0_D27_I                 NXP_SIUL2_PINMUX(1, 1, 112, 0, 144, 1)
#define PH4_FXIO0_D0_O                  NXP_SIUL2_PINMUX(1, 1, 116, 1, 0, 0)
#define PH4_FXIO0_D16_O                 NXP_SIUL2_PINMUX(1, 1, 116, 2, 0, 0)
#define PH4_FXIO0_D0_I                  NXP_SIUL2_PINMUX(1, 1, 116, 0, 117, 3)
#define PH4_FXIO0_D16_I                 NXP_SIUL2_PINMUX(1, 1, 116, 0, 133, 3)
#define PH14_FXIO0_D0_O                 NXP_SIUL2_PINMUX(1, 1, 126, 1, 0, 0)
#define PH14_FXIO0_D16_O                NXP_SIUL2_PINMUX(1, 1, 126, 2, 0, 0)
#define PH14_FXIO0_D0_I                 NXP_SIUL2_PINMUX(1, 1, 126, 0, 117, 4)
#define PH14_FXIO0_D16_I                NXP_SIUL2_PINMUX(1, 1, 126, 0, 133, 4)
#define PH15_FXIO0_D1_O                 NXP_SIUL2_PINMUX(1, 1, 127, 2, 0, 0)
#define PH15_FXIO0_D17_O                NXP_SIUL2_PINMUX(1, 1, 127, 3, 0, 0)
#define PH15_FXIO0_D1_I                 NXP_SIUL2_PINMUX(1, 1, 127, 0, 118, 3)
#define PH15_FXIO0_D17_I                NXP_SIUL2_PINMUX(1, 1, 127, 0, 134, 3)
#define PI0_FXIO0_D2_O                  NXP_SIUL2_PINMUX(1, 1, 128, 4, 0, 0)
#define PI0_FXIO0_D18_O                 NXP_SIUL2_PINMUX(1, 1, 128, 5, 0, 0)
#define PI0_FXIO0_D2_I                  NXP_SIUL2_PINMUX(1, 1, 128, 0, 119, 3)
#define PI0_FXIO0_D18_I                 NXP_SIUL2_PINMUX(1, 1, 128, 0, 135, 3)
#define PI1_FXIO0_D3_O                  NXP_SIUL2_PINMUX(1, 1, 129, 1, 0, 0)
#define PI1_FXIO0_D19_O                 NXP_SIUL2_PINMUX(1, 1, 129, 4, 0, 0)
#define PI1_FXIO0_D3_I                  NXP_SIUL2_PINMUX(1, 1, 129, 0, 120, 3)
#define PI1_FXIO0_D19_I                 NXP_SIUL2_PINMUX(1, 1, 129, 0, 136, 3)
#define PI2_FXIO0_D4_O                  NXP_SIUL2_PINMUX(1, 1, 130, 2, 0, 0)
#define PI2_FXIO0_D20_O                 NXP_SIUL2_PINMUX(1, 1, 130, 3, 0, 0)
#define PI2_FXIO0_D4_I                  NXP_SIUL2_PINMUX(1, 1, 130, 0, 121, 3)
#define PI2_FXIO0_D20_I                 NXP_SIUL2_PINMUX(1, 1, 130, 0, 137, 3)
#define PI3_FXIO0_D5_O                  NXP_SIUL2_PINMUX(1, 1, 131, 1, 0, 0)
#define PI3_FXIO0_D21_O                 NXP_SIUL2_PINMUX(1, 1, 131, 2, 0, 0)
#define PI3_FXIO0_D5_I                  NXP_SIUL2_PINMUX(1, 1, 131, 0, 122, 3)
#define PI3_FXIO0_D21_I                 NXP_SIUL2_PINMUX(1, 1, 131, 0, 138, 3)
#define PI4_FXIO0_D6_O                  NXP_SIUL2_PINMUX(1, 1, 132, 3, 0, 0)
#define PI4_FXIO0_D22_O                 NXP_SIUL2_PINMUX(1, 1, 132, 4, 0, 0)
#define PI4_FXIO0_D6_I                  NXP_SIUL2_PINMUX(1, 1, 132, 0, 123, 3)
#define PI4_FXIO0_D22_I                 NXP_SIUL2_PINMUX(1, 1, 132, 0, 139, 3)
#define PI5_FXIO0_D7_O                  NXP_SIUL2_PINMUX(1, 1, 133, 1, 0, 0)
#define PI5_FXIO0_D23_O                 NXP_SIUL2_PINMUX(1, 1, 133, 2, 0, 0)
#define PI5_FXIO0_D7_I                  NXP_SIUL2_PINMUX(1, 1, 133, 0, 124, 3)
#define PI5_FXIO0_D23_I                 NXP_SIUL2_PINMUX(1, 1, 133, 0, 140, 3)
#define PI6_FXIO0_D8_O                  NXP_SIUL2_PINMUX(1, 1, 134, 2, 0, 0)
#define PI6_FXIO0_D24_O                 NXP_SIUL2_PINMUX(1, 1, 134, 3, 0, 0)
#define PI6_FXIO0_D8_I                  NXP_SIUL2_PINMUX(1, 1, 134, 0, 125, 2)
#define PI6_FXIO0_D24_I                 NXP_SIUL2_PINMUX(1, 1, 134, 0, 141, 2)
#define PI7_FXIO0_D9_O                  NXP_SIUL2_PINMUX(1, 1, 135, 3, 0, 0)
#define PI7_FXIO0_D25_O                 NXP_SIUL2_PINMUX(1, 1, 135, 4, 0, 0)
#define PI7_FXIO0_D9_I                  NXP_SIUL2_PINMUX(1, 1, 135, 0, 126, 3)
#define PI7_FXIO0_D25_I                 NXP_SIUL2_PINMUX(1, 1, 135, 0, 142, 3)
#define PI8_FXIO0_D10_O                 NXP_SIUL2_PINMUX(1, 1, 136, 1, 0, 0)
#define PI8_FXIO0_D26_O                 NXP_SIUL2_PINMUX(1, 1, 136, 3, 0, 0)
#define PI8_FXIO0_D10_I                 NXP_SIUL2_PINMUX(1, 1, 136, 0, 127, 3)
#define PI8_FXIO0_D26_I                 NXP_SIUL2_PINMUX(1, 1, 136, 0, 143, 3)
#define PI9_FXIO0_D11_O                 NXP_SIUL2_PINMUX(1, 1, 137, 3, 0, 0)
#define PI9_FXIO0_D27_O                 NXP_SIUL2_PINMUX(1, 1, 137, 4, 0, 0)
#define PI9_FXIO0_D11_I                 NXP_SIUL2_PINMUX(1, 1, 137, 0, 128, 2)
#define PI9_FXIO0_D27_I                 NXP_SIUL2_PINMUX(1, 1, 137, 0, 144, 2)
#define PI10_FXIO0_D12_O                NXP_SIUL2_PINMUX(1, 1, 138, 1, 0, 0)
#define PI10_FXIO0_D28_O                NXP_SIUL2_PINMUX(1, 1, 138, 2, 0, 0)
#define PI10_FXIO0_D12_I                NXP_SIUL2_PINMUX(1, 1, 138, 0, 129, 3)
#define PI10_FXIO0_D28_I                NXP_SIUL2_PINMUX(1, 1, 138, 0, 145, 3)

