zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPSPI2 */
#define PF0_LPSPI2_SOUT_O               NXP_SIUL2_PINMUX(1, 1, 80, 5, 0, 0)
#define PF0_LPSPI2_SOUT_I               NXP_SIUL2_PINMUX(1, 1, 80, 0, 41, 1)
#define PF1_LPSPI2_PCS3_O               NXP_SIUL2_PINMUX(1, 1, 81, 4, 0, 0)
#define PF1_LPSPI2_PCS3_I               NXP_SIUL2_PINMUX(1, 1, 81, 0, 38, 1)
#define PF2_LPSPI2_PCS0_O               NXP_SIUL2_PINMUX(1, 1, 82, 3, 0, 0)
#define PF2_LPSPI2_PCS0_I               NXP_SIUL2_PINMUX(1, 1, 82, 0, 35, 1)
#define PF3_LPSPI2_PCS2_O               NXP_SIUL2_PINMUX(1, 1, 83, 4, 0, 0)
#define PF3_LPSPI2_PCS2_I               NXP_SIUL2_PINMUX(1, 1, 83, 0, 37, 1)
#define PF4_LPSPI2_SCK_O                NXP_SIUL2_PINMUX(1, 1, 84, 5, 0, 0)
#define PF4_LPSPI2_SCK_I                NXP_SIUL2_PINMUX(1, 1, 84, 0, 39, 1)
#define PF5_LPSPI2_SIN_O                NXP_SIUL2_PINMUX(1, 1, 85, 3, 0, 0)
#define PF5_LPSPI2_SIN_I                NXP_SIUL2_PINMUX(1, 1, 85, 0, 40, 1)
#define PF6_LPSPI2_PCS3_O               NXP_SIUL2_PINMUX(1, 1, 86, 4, 0, 0)
#define PF6_LPSPI2_PCS3_I               NXP_SIUL2_PINMUX(1, 1, 86, 0, 38, 2)
#define PF9_LPSPI2_PCS1_O               NXP_SIUL2_PINMUX(1, 1, 89, 2, 0, 0)
#define PF9_LPSPI2_PCS1_I               NXP_SIUL2_PINMUX(1, 1, 89, 0, 36, 1)
#define PF14_LPSPI2_PCS3_O              NXP_SIUL2_PINMUX(1, 1, 94, 6, 0, 0)
#define PF14_LPSPI2_PCS3_I              NXP_SIUL2_PINMUX(1, 1, 94, 0, 38, 3)
#define PF15_LPSPI2_SIN_O               NXP_SIUL2_PINMUX(1, 1, 95, 4, 0, 0)
#define PF15_LPSPI2_SIN_I               NXP_SIUL2_PINMUX(1, 1, 95, 0, 40, 2)
#define PG0_LPSPI2_SCK_O                NXP_SIUL2_PINMUX(1, 1, 96, 4, 0, 0)
#define PG0_LPSPI2_SCK_I                NXP_SIUL2_PINMUX(1, 1, 96, 0, 39, 2)
#define PG4_LPSPI2_PCS0_O               NXP_SIUL2_PINMUX(1, 1, 100, 2, 0, 0)
#define PG4_LPSPI2_PCS0_I               NXP_SIUL2_PINMUX(1, 1, 100, 0, 35, 2)
#define PG5_LPSPI2_PCS3_O               NXP_SIUL2_PINMUX(1, 1, 101, 2, 0, 0)
#define PG5_LPSPI2_PCS3_I               NXP_SIUL2_PINMUX(1, 1, 101, 0, 38, 4)
#define PG6_LPSPI2_SOUT_O               NXP_SIUL2_PINMUX(1, 1, 102, 4, 0, 0)
#define PG6_LPSPI2_SOUT_I               NXP_SIUL2_PINMUX(1, 1, 102, 0, 41, 2)
#define PG10_LPSPI2_PCS1_O              NXP_SIUL2_PINMUX(1, 1, 106, 5, 0, 0)
#define PG10_LPSPI2_PCS1_I              NXP_SIUL2_PINMUX(1, 1, 106, 0, 36, 2)
#define PG11_LPSPI2_SIN_O               NXP_SIUL2_PINMUX(1, 1, 107, 6, 0, 0)
#define PG11_LPSPI2_SIN_I               NXP_SIUL2_PINMUX(1, 1, 107, 0, 40, 3)
#define PG12_LPSPI2_SOUT_O              NXP_SIUL2_PINMUX(1, 1, 108, 7, 0, 0)
#define PG12_LPSPI2_SOUT_I              NXP_SIUL2_PINMUX(1, 1, 108, 0, 41, 3)
#define PG14_LPSPI2_PCS1_O              NXP_SIUL2_PINMUX(1, 1, 110, 4, 0, 0)
#define PG14_LPSPI2_PCS1_I              NXP_SIUL2_PINMUX(1, 1, 110, 0, 36, 3)
#define PG15_LPSPI2_PCS2_O              NXP_SIUL2_PINMUX(1, 1, 111, 6, 0, 0)
#define PG15_LPSPI2_PCS2_I              NXP_SIUL2_PINMUX(1, 1, 111, 0, 37, 2)
#define PH0_LPSPI2_SCK_O                NXP_SIUL2_PINMUX(1, 1, 112, 1, 0, 0)
#define PH0_LPSPI2_SCK_I                NXP_SIUL2_PINMUX(1, 1, 112, 0, 39, 3)
#define PH14_LPSPI2_SIN_O               NXP_SIUL2_PINMUX(1, 1, 126, 3, 0, 0)
#define PH14_LPSPI2_SIN_I               NXP_SIUL2_PINMUX(1, 1, 126, 0, 40, 4)
#define PH15_LPSPI2_SCK_O               NXP_SIUL2_PINMUX(1, 1, 127, 1, 0, 0)
#define PH15_LPSPI2_SCK_I               NXP_SIUL2_PINMUX(1, 1, 127, 0, 39, 4)
#define PI0_LPSPI2_SOUT_O               NXP_SIUL2_PINMUX(1, 1, 128, 2, 0, 0)
#define PI0_LPSPI2_SOUT_I               NXP_SIUL2_PINMUX(1, 1, 128, 0, 41, 4)
#define PI1_LPSPI2_PCS2_O               NXP_SIUL2_PINMUX(1, 1, 129, 6, 0, 0)
#define PI1_LPSPI2_PCS2_I               NXP_SIUL2_PINMUX(1, 1, 129, 0, 37, 3)
#define PI2_LPSPI2_SIN_O                NXP_SIUL2_PINMUX(1, 1, 130, 4, 0, 0)
#define PI2_LPSPI2_SIN_I                NXP_SIUL2_PINMUX(1, 1, 130, 0, 40, 5)
#define PI3_LPSPI2_SOUT_O               NXP_SIUL2_PINMUX(1, 1, 131, 4, 0, 0)
#define PI3_LPSPI2_SOUT_I               NXP_SIUL2_PINMUX(1, 1, 131, 0, 41, 5)
#define PI4_LPSPI2_SCK_O                NXP_SIUL2_PINMUX(1, 1, 132, 5, 0, 0)
#define PI4_LPSPI2_SCK_I                NXP_SIUL2_PINMUX(1, 1, 132, 0, 39, 5)
#define PI5_LPSPI2_PCS0_O               NXP_SIUL2_PINMUX(1, 1, 133, 3, 0, 0)
#define PI5_LPSPI2_PCS0_I               NXP_SIUL2_PINMUX(1, 1, 133, 0, 35, 3)
#define PI6_LPSPI2_PCS1_O               NXP_SIUL2_PINMUX(1, 1, 134, 4, 0, 0)
#define PI6_LPSPI2_PCS1_I               NXP_SIUL2_PINMUX(1, 1, 134, 0, 36, 4)
#define PI7_LPSPI2_PCS3_O               NXP_SIUL2_PINMUX(1, 1, 135, 7, 0, 0)
#define PI7_LPSPI2_PCS3_I               NXP_SIUL2_PINMUX(1, 1, 135, 0, 38, 5)

/* FCCU */
#define PF0_FCCU_EOUT1                  NXP_SIUL2_PINMUX(1, 1, 80, 6, 0, 0)
#define PF1_FCCU_EOUT2                  NXP_SIUL2_PINMUX(1, 1, 81, 5, 0, 0)
#define PO4_FCCU_EOUT1                  NXP_SIUL2_PINMUX(3, 3, 228, 1, 0, 0)
#define PO11_FCCU_EOUT2                 NXP_SIUL2_PINMUX(3, 3, 235, 1, 0, 0)
#define PU8_FCCU_EOUT1                  NXP_SIUL2_PINMUX(4, 4, 328, 2, 0, 0)
#define PU12_FCCU_EOUT2                 NXP_SIUL2_PINMUX(4, 4, 332, 1, 0, 0)

/* CANHUB */
#define PF0_CAN1_RX                     NXP_SIUL2_PINMUX(1, 1, 80, 0, 107, 1)
#define PF1_CAN0_TX                     NXP_SIUL2_PINMUX(1, 1, 81, 2, 0, 0)
#define PF1_CAN1_TX                     NXP_SIUL2_PINMUX(1, 1, 81, 9, 0, 0)
#define PF2_CAN3_TX                     NXP_SIUL2_PINMUX(1, 1, 82, 2, 0, 0)
#define PF3_CAN7_TX                     NXP_SIUL2_PINMUX(1, 1, 83, 3, 0, 0)
#define PF4_CAN1_RX                     NXP_SIUL2_PINMUX(1, 1, 84, 0, 107, 2)
#define PF5_CAN1_TX                     NXP_SIUL2_PINMUX(1, 1, 85, 1, 0, 0)
#define PF5_CAN0_RX                     NXP_SIUL2_PINMUX(1, 1, 85, 0, 106, 1)
#define PF6_CAN4_RX                     NXP_SIUL2_PINMUX(1, 1, 86, 0, 110, 1)
#define PF7_CAN4_TX                     NXP_SIUL2_PINMUX(1, 1, 87, 4, 0, 0)
#define PF7_CAN0_TX                     NXP_SIUL2_PINMUX(1, 1, 87, 6, 0, 0)
#define PF9_CAN7_RX                     NXP_SIUL2_PINMUX(1, 1, 89, 0, 113, 1)
#define PF10_CAN6_TX                    NXP_SIUL2_PINMUX(1, 1, 90, 4, 0, 0)
#define PF11_CAN5_RX                    NXP_SIUL2_PINMUX(1, 1, 91, 0, 111, 1)
#define PF13_CAN6_RX                    NXP_SIUL2_PINMUX(1, 1, 93, 0, 112, 1)
#define PF14_CAN0_TX                    NXP_SIUL2_PINMUX(1, 1, 94, 7, 0, 0)
#define PF15_CAN2_RX                    NXP_SIUL2_PINMUX(1, 1, 95, 0, 108, 1)
#define PG0_CAN2_TX                     NXP_SIUL2_PINMUX(1, 1, 96, 1, 0, 0)
#define PG1_CAN7_RX                     NXP_SIUL2_PINMUX(1, 1, 97, 0, 113, 2)
#define PG2_CAN7_TX                     NXP_SIUL2_PINMUX(1, 1, 98, 3, 0, 0)
#define PG4_CAN5_TX                     NXP_SIUL2_PINMUX(1, 1, 100, 7, 0, 0)
#define PG4_CAN0_RX                     NXP_SIUL2_PINMUX(1, 1, 100, 0, 106, 3)
#define PG5_CAN3_TX                     NXP_SIUL2_PINMUX(1, 1, 101, 3, 0, 0)
#define PG5_CAN5_RX                     NXP_SIUL2_PINMUX(1, 1, 101, 0, 111, 2)
#define PG6_CAN3_RX                     NXP_SIUL2_PINMUX(1, 1, 102, 0, 109, 1)
#define PG7_CAN6_TX                     NXP_SIUL2_PINMUX(1, 1, 103, 7, 0, 0)
#define PG9_CAN4_RX                     NXP_SIUL2_PINMUX(1, 1, 105, 0, 110, 2)
#define PG10_CAN2_RX                    NXP_SIUL2_PINMUX(1, 1, 106, 0, 108, 2)
#define PG11_CAN2_TX                    NXP_SIUL2_PINMUX(1, 1, 107, 2, 0, 0)
#define PG12_CAN1_TX                    NXP_SIUL2_PINMUX(1, 1, 108, 3, 0, 0)
#define PG13_CAN6_RX                    NXP_SIUL2_PINMUX(1, 1, 109, 0, 112, 2)
#define PG14_CAN4_TX                    NXP_SIUL2_PINMUX(1, 1, 110, 1, 0, 0)
#define PG15_CAN0_RX                    NXP_SIUL2_PINMUX(1, 1, 111, 0, 106, 2)
#define PH0_CAN1_RX                     NXP_SIUL2_PINMUX(1, 1, 112, 0, 107, 3)
#define PH0_CAN3_RX                     NXP_SIUL2_PINMUX(1, 1, 112, 0, 109, 2)
#define PH4_CAN5_TX                     NXP_SIUL2_PINMUX(1, 1, 116, 3, 0, 0)
#define PH14_CAN2_RX                    NXP_SIUL2_PINMUX(1, 1, 126, 0, 108, 3)
#define PH15_CAN3_RX                    NXP_SIUL2_PINMUX(1, 1, 127, 0, 109, 3)
#define PI0_CAN3_TX                     NXP_SIUL2_PINMUX(1, 1, 128, 1, 0, 0)
#define PI2_CAN4_TX                     NXP_SIUL2_PINMUX(1, 1, 130, 1, 0, 0)
#define PI3_CAN4_RX                     NXP_SIUL2_PINMUX(1, 1, 131, 0, 110, 3)
#define PI4_CAN5_TX                     NXP_SIUL2_PINMUX(1, 1, 132, 1, 0, 0)
#define PI5_CAN5_RX                     NXP_SIUL2_PINMUX(1, 1, 133, 0, 111, 3)
#define PI6_CAN2_TX                     NXP_SIUL2_PINMUX(1, 1, 134, 1, 0, 0)
#define PI6_CAN7_TX                     NXP_SIUL2_PINMUX(1, 1, 134, 5, 0, 0)
#define PI7_CAN6_TX                     NXP_SIUL2_PINMUX(1, 1, 135, 1, 0, 0)
#define PI7_CAN7_RX                     NXP_SIUL2_PINMUX(1, 1, 135, 0, 113, 3)
#define PI8_CAN6_RX                     NXP_SIUL2_PINMUX(1, 1, 136, 0, 112, 3)
#define PI9_CAN1_TX                     NXP_SIUL2_PINMUX(1, 1, 137, 1, 0, 0)
#define PI10_CAN1_RX                    NXP_SIUL2_PINMUX(1, 1, 138, 0, 107, 4)
#define PN5_CAN10_TX                    NXP_SIUL2_PINMUX(3, 3, 213, 1, 0, 0)
#define PN6_CAN10_RX                    NXP_SIUL2_PINMUX(3, 3, 214, 0, 86, 1)
#define PN7_CAN10_TX                    NXP_SIUL2_PINMUX(3, 3, 215, 2, 0, 0)
#define PN9_CAN10_RX                    NXP_SIUL2_PINMUX(3, 3, 217, 0, 86, 2)
#define PN14_CAN10_RX                   NXP_SIUL2_PINMUX(3, 3, 222, 0, 86, 3)
#define PN15_CAN10_TX                   NXP_SIUL2_PINMUX(3, 3, 223, 4, 0, 0)
#define PO0_CAN8_RX                     NXP_SIUL2_PINMUX(3, 3, 224, 0, 84, 1)
#define PO2_CAN10_TX                    NXP_SIUL2_PINMUX(3, 3, 226, 7, 0, 0)
#define PO9_CAN8_RX                     NXP_SIUL2_PINMUX(3, 3, 233, 0, 84, 4)
#define PO10_CAN9_TX                    NXP_SIUL2_PINMUX(3, 3, 234, 7, 0, 0)
#define PO11_CAN9_RX                    NXP_SIUL2_PINMUX(3, 3, 235, 0, 85, 1)
#define PO12_CAN8_TX                    NXP_SIUL2_PINMUX(3, 3, 236, 1, 0, 0)
#define PO13_CAN9_TX                    NXP_SIUL2_PINMUX(3, 3, 237, 1, 0, 0)
#define PO14_CAN9_RX                    NXP_SIUL2_PINMUX(3, 3, 238, 0, 85, 2)
#define PO15_CAN8_RX                    NXP_SIUL2_PINMUX(3, 3, 239, 0, 84, 3)
#define PP0_CAN8_TX                     NXP_SIUL2_PINMUX(3, 3, 240, 1, 0, 0)
#define PP1_CAN9_RX                     NXP_SIUL2_PINMUX(3, 3, 241, 0, 85, 3)
#define PP2_CAN8_TX                     NXP_SIUL2_PINMUX(3, 3, 242, 1, 0, 0)
#define PP3_CAN9_RX                     NXP_SIUL2_PINMUX(3, 3, 243, 0, 85, 4)
#define PP4_CAN9_TX                     NXP_SIUL2_PINMUX(3, 3, 244, 5, 0, 0)
#define PP5_CAN8_RX                     NXP_SIUL2_PINMUX(3, 3, 245, 0, 84, 2)
#define PP6_CAN9_TX                     NXP_SIUL2_PINMUX(3, 3, 246, 4, 0, 0)
#define PP7_CAN8_TX                     NXP_SIUL2_PINMUX(3, 3, 247, 1, 0, 0)
#define PP9_CAN10_TX                    NXP_SIUL2_PINMUX(3, 3, 249, 2, 0, 0)
#define PP11_CAN10_RX                   NXP_SIUL2_PINMUX(3, 3, 251, 0, 86, 6)
#define PP13_CAN10_TX                   NXP_SIUL2_PINMUX(3, 3, 253, 9, 0, 0)
#define PP14_CAN10_RX                   NXP_SIUL2_PINMUX(3, 3, 254, 0, 86, 5)
#define PQ2_CAN10_TX                    NXP_SIUL2_PINMUX(3, 3, 258, 5, 0, 0)
#define PQ4_CAN10_RX                    NXP_SIUL2_PINMUX(3, 3, 260, 0, 86, 4)
#define PT1_CAN14_RX                    NXP_SIUL2_PINMUX(4, 4, 305, 0, 96, 1)
#define PT2_CAN14_TX                    NXP_SIUL2_PINMUX(4, 4, 306, 8, 0, 0)
#define PT3_CAN15_RX                    NXP_SIUL2_PINMUX(4, 4, 307, 0, 97, 1)
#define PT5_CAN16_RX                    NXP_SIUL2_PINMUX(4, 4, 309, 0, 98, 1)
#define PT6_CAN16_TX                    NXP_SIUL2_PINMUX(4, 4, 310, 4, 0, 0)
#define PT10_CAN15_RX                   NXP_SIUL2_PINMUX(4, 4, 314, 0, 97, 2)
#define PT11_CAN15_TX                   NXP_SIUL2_PINMUX(4, 4, 315, 1, 0, 0)
#define PT12_CAN16_RX                   NXP_SIUL2_PINMUX(4, 4, 316, 0, 98, 2)
#define PT13_CAN16_TX                   NXP_SIUL2_PINMUX(4, 4, 317, 5, 0, 0)
#define PT14_CAN11_RX                   NXP_SIUL2_PINMUX(4, 4, 318, 0, 93, 1)
#define PT15_CAN11_RX                   NXP_SIUL2_PINMUX(4, 4, 319, 0, 93, 2)
#define PU0_CAN15_TX                    NXP_SIUL2_PINMUX(4, 4, 320, 6, 0, 0)
#define PU1_CAN12_RX                    NXP_SIUL2_PINMUX(4, 4, 321, 0, 94, 1)
#define PU3_CAN11_TX                    NXP_SIUL2_PINMUX(4, 4, 323, 7, 0, 0)
#define PU6_CAN12_TX                    NXP_SIUL2_PINMUX(4, 4, 326, 4, 0, 0)
#define PU7_CAN13_RX                    NXP_SIUL2_PINMUX(4, 4, 327, 0, 95, 2)
#define PU8_CAN14_TX                    NXP_SIUL2_PINMUX(4, 4, 328, 10, 0, 0)
#define PU8_CAN12_RX                    NXP_SIUL2_PINMUX(4, 4, 328, 0, 94, 2)
#define PU9_CAN13_RX                    NXP_SIUL2_PINMUX(4, 4, 329, 0, 95, 1)
#define PU10_CAN13_RX                   NXP_SIUL2_PINMUX(4, 4, 330, 0, 95, 3)
#define PU11_CAN13_TX                   NXP_SIUL2_PINMUX(4, 4, 331, 6, 0, 0)
#define PU12_CAN13_TX                   NXP_SIUL2_PINMUX(4, 4, 332, 5, 0, 0)
#define PU13_CAN12_TX                   NXP_SIUL2_PINMUX(4, 4, 333, 4, 0, 0)
#define PU13_CAN14_RX                   NXP_SIUL2_PINMUX(4, 4, 333, 0, 96, 2)
#define PU14_CAN11_TX                   NXP_SIUL2_PINMUX(4, 4, 334, 5, 0, 0)
#define PU15_CAN13_TX                   NXP_SIUL2_PINMUX(4, 4, 335, 5, 0, 0)
#define PV0_CAN11_RX                    NXP_SIUL2_PINMUX(4, 4, 336, 0, 93, 3)
#define PV1_CAN11_TX                    NXP_SIUL2_PINMUX(4, 4, 337, 4, 0, 0)
#define PV2_CAN11_TX                    NXP_SIUL2_PINMUX(4, 4, 338, 4, 0, 0)
#define PV4_CAN13_RX                    NXP_SIUL2_PINMUX(4, 4, 340, 0, 95, 4)
#define PV5_CAN13_TX                    NXP_SIUL2_PINMUX(4, 4, 341, 2, 0, 0)
#define PV6_CAN16_TX                    NXP_SIUL2_PINMUX(4, 4, 342, 2, 0, 0)
#define PV7_CAN16_RX                    NXP_SIUL2_PINMUX(4, 4, 343, 0, 98, 4)
#define PV9_CAN15_TX                    NXP_SIUL2_PINMUX(4, 4, 345, 6, 0, 0)
#define PV10_CAN15_TX                   NXP_SIUL2_PINMUX(4, 4, 346, 2, 0, 0)
#define PV11_CAN15_RX                   NXP_SIUL2_PINMUX(4, 4, 347, 0, 97, 4)
#define PV12_CAN14_RX                   NXP_SIUL2_PINMUX(4, 4, 348, 0, 96, 3)
#define PV13_CAN14_TX                   NXP_SIUL2_PINMUX(4, 4, 349, 4, 0, 0)
#define PV14_CAN15_RX                   NXP_SIUL2_PINMUX(4, 4, 350, 0, 97, 5)
#define PW0_CAN12_RX                    NXP_SIUL2_PINMUX(4, 4, 352, 0, 94, 4)
#define PW1_CAN15_RX                    NXP_SIUL2_PINMUX(4, 4, 353, 0, 97, 3)
#define PW2_CAN15_TX                    NXP_SIUL2_PINMUX(4, 4, 354, 7, 0, 0)
#define PW3_CAN16_RX                    NXP_SIUL2_PINMUX(4, 4, 355, 0, 98, 3)
#define PW4_CAN12_TX                    NXP_SIUL2_PINMUX(4, 4, 356, 4, 0, 0)
#define PW5_CAN16_TX                    NXP_SIUL2_PINMUX(4, 4, 357, 4, 0, 0)
#define PW6_CAN14_TX                    NXP_SIUL2_PINMUX(4, 4, 358, 4, 0, 0)
#define PW7_CAN12_TX                    NXP_SIUL2_PINMUX(4, 4, 359, 3, 0, 0)
#define PW7_CAN16_RX                    NXP_SIUL2_PINMUX(4, 4, 359, 0, 98, 5)
#define PW8_CAN12_RX                    NXP_SIUL2_PINMUX(4, 4, 360, 0, 94, 3)
#define PW9_CAN11_TX                    NXP_SIUL2_PINMUX(4, 4, 361, 4, 0, 0)
#define PW9_CAN14_TX                    NXP_SIUL2_PINMUX(4, 4, 361, 7, 0, 0)
#define PW10_CAN11_RX                   NXP_SIUL2_PINMUX(4, 4, 362, 0, 93, 4)
#define PW10_CAN14_RX                   NXP_SIUL2_PINMUX(4, 4, 362, 0, 96, 4)
#define PW11_CAN14_RX                   NXP_SIUL2_PINMUX(4, 4, 363, 0, 96, 5)

/* LPUART2 */
#define PF0_LPUART2_RX                  NXP_SIUL2_PINMUX(1, 1, 80, 0, 46, 1)
#define PF2_LPUART2_RTS                 NXP_SIUL2_PINMUX(1, 1, 82, 7, 0, 0)
#define PF3_LPUART2_TX_O                NXP_SIUL2_PINMUX(1, 1, 83, 6, 0, 0)
#define PF3_LPUART2_TX_I                NXP_SIUL2_PINMUX(1, 1, 83, 0, 45, 1)
#define PF3_LPUART2_CTS                 NXP_SIUL2_PINMUX(1, 1, 83, 0, 47, 1)
#define PF4_LPUART2_TX_O                NXP_SIUL2_PINMUX(1, 1, 84, 4, 0, 0)
#define PF4_LPUART2_TX_I                NXP_SIUL2_PINMUX(1, 1, 84, 0, 45, 2)
#define PF5_LPUART2_TX_O                NXP_SIUL2_PINMUX(1, 1, 85, 2, 0, 0)
#define PF5_LPUART2_TX_I                NXP_SIUL2_PINMUX(1, 1, 85, 0, 45, 3)
#define PF6_LPUART2_RX                  NXP_SIUL2_PINMUX(1, 1, 86, 0, 46, 2)
#define PF7_LPUART2_RTS                 NXP_SIUL2_PINMUX(1, 1, 87, 1, 0, 0)
#define PF9_LPUART2_RX                  NXP_SIUL2_PINMUX(1, 1, 89, 0, 46, 3)
#define PG15_LPUART2_CTS                NXP_SIUL2_PINMUX(1, 1, 111, 0, 47, 2)

/* LPUART3 */
#define PF1_LPUART3_TX_O                NXP_SIUL2_PINMUX(1, 1, 81, 1, 0, 0)
#define PF1_LPUART3_TX_I                NXP_SIUL2_PINMUX(1, 1, 81, 0, 51, 1)
#define PF15_LPUART3_RX                 NXP_SIUL2_PINMUX(1, 1, 95, 0, 52, 1)
#define PG0_LPUART3_TX_O                NXP_SIUL2_PINMUX(1, 1, 96, 2, 0, 0)
#define PG0_LPUART3_TX_I                NXP_SIUL2_PINMUX(1, 1, 96, 0, 51, 2)
#define PG15_LPUART3_RX                 NXP_SIUL2_PINMUX(1, 1, 111, 0, 52, 2)
#define PI9_LPUART3_TX_O                NXP_SIUL2_PINMUX(1, 1, 137, 2, 0, 0)
#define PI9_LPUART3_TX_I                NXP_SIUL2_PINMUX(1, 1, 137, 0, 51, 3)
#define PI10_LPUART3_RX                 NXP_SIUL2_PINMUX(1, 1, 138, 0, 52, 3)

/* LPUART13 */
#define PF1_LPUART13_TX_O               NXP_SIUL2_PINMUX(1, 1, 81, 8, 0, 0)
#define PF1_LPUART13_TX_I               NXP_SIUL2_PINMUX(1, 1, 81, 0, 101, 1)
#define PF11_LPUART13_TX_O              NXP_SIUL2_PINMUX(1, 1, 91, 1, 0, 0)
#define PF11_LPUART13_TX_I              NXP_SIUL2_PINMUX(1, 1, 91, 0, 101, 2)
#define PG15_LPUART13_RX                NXP_SIUL2_PINMUX(1, 1, 111, 0, 102, 1)
#define PH4_LPUART13_RX                 NXP_SIUL2_PINMUX(1, 1, 116, 0, 102, 2)
#define PI7_LPUART13_TX_O               NXP_SIUL2_PINMUX(1, 1, 135, 6, 0, 0)
#define PI7_LPUART13_TX_I               NXP_SIUL2_PINMUX(1, 1, 135, 0, 101, 4)
#define PI8_LPUART13_RX                 NXP_SIUL2_PINMUX(1, 1, 136, 0, 102, 3)
#define PI9_LPUART13_TX_O               NXP_SIUL2_PINMUX(1, 1, 137, 5, 0, 0)
#define PI9_LPUART13_TX_I               NXP_SIUL2_PINMUX(1, 1, 137, 0, 101, 3)

/* LPUART7 */
#define PF2_LPUART7_TX_O                NXP_SIUL2_PINMUX(1, 1, 82, 5, 0, 0)
#define PF2_LPUART7_TX_I                NXP_SIUL2_PINMUX(1, 1, 82, 0, 71, 2)
#define PF5_LPUART7_RX                  NXP_SIUL2_PINMUX(1, 1, 85, 0, 72, 1)
#define PG6_LPUART7_RX                  NXP_SIUL2_PINMUX(1, 1, 102, 0, 72, 2)
#define PG8_LPUART7_TX_O                NXP_SIUL2_PINMUX(1, 1, 104, 2, 0, 0)
#define PG8_LPUART7_TX_I                NXP_SIUL2_PINMUX(1, 1, 104, 0, 71, 1)
#define PG9_LPUART7_RX                  NXP_SIUL2_PINMUX(1, 1, 105, 0, 72, 3)
#define PI1_LPUART7_TX_O                NXP_SIUL2_PINMUX(1, 1, 129, 3, 0, 0)
#define PI1_LPUART7_TX_I                NXP_SIUL2_PINMUX(1, 1, 129, 0, 71, 3)
#define PI2_LPUART7_RX                  NXP_SIUL2_PINMUX(1, 1, 130, 0, 72, 4)

/* LPUART12 */
#define PF2_LPUART12_TX_O               NXP_SIUL2_PINMUX(1, 1, 82, 8, 0, 0)
#define PF2_LPUART12_TX_I               NXP_SIUL2_PINMUX(1, 1, 82, 0, 96, 1)
#define PF4_LPUART12_RX                 NXP_SIUL2_PINMUX(1, 1, 84, 0, 97, 1)
#define PG12_LPUART12_TX_O              NXP_SIUL2_PINMUX(1, 1, 108, 2, 0, 0)
#define PG12_LPUART12_TX_I              NXP_SIUL2_PINMUX(1, 1, 108, 0, 96, 2)
#define PH0_LPUART12_RX                 NXP_SIUL2_PINMUX(1, 1, 112, 0, 97, 2)
#define PI1_LPUART12_TX_O               NXP_SIUL2_PINMUX(1, 1, 129, 5, 0, 0)
#define PI1_LPUART12_TX_I               NXP_SIUL2_PINMUX(1, 1, 129, 0, 96, 3)
#define PI2_LPUART12_RX                 NXP_SIUL2_PINMUX(1, 1, 130, 0, 97, 3)
#define PI5_LPUART12_TX_O               NXP_SIUL2_PINMUX(1, 1, 133, 4, 0, 0)
#define PI5_LPUART12_TX_I               NXP_SIUL2_PINMUX(1, 1, 133, 0, 96, 5)
#define PI6_LPUART12_RX                 NXP_SIUL2_PINMUX(1, 1, 134, 0, 97, 4)
#define PI7_LPUART12_TX_O               NXP_SIUL2_PINMUX(1, 1, 135, 2, 0, 0)
#define PI7_LPUART12_TX_I               NXP_SIUL2_PINMUX(1, 1, 135, 0, 96, 4)

/* LPUART5 */
#define PF3_LPUART5_TX_O                NXP_SIUL2_PINMUX(1, 1, 83, 1, 0, 0)
#define PF3_LPUART5_TX_I                NXP_SIUL2_PINMUX(1, 1, 83, 0, 61, 1)
#define PF7_LPUART5_RX                  NXP_SIUL2_PINMUX(1, 1, 87, 0, 62, 2)
#define PG3_LPUART5_RX                  NXP_SIUL2_PINMUX(1, 1, 99, 0, 62, 1)
#define PG8_LPUART5_TX_O                NXP_SIUL2_PINMUX(1, 1, 104, 6, 0, 0)
#define PG8_LPUART5_TX_I                NXP_SIUL2_PINMUX(1, 1, 104, 0, 61, 2)
#define PI3_LPUART5_RX                  NXP_SIUL2_PINMUX(1, 1, 131, 0, 62, 4)
#define PI4_LPUART5_TX_O                NXP_SIUL2_PINMUX(1, 1, 132, 2, 0, 0)
#define PI4_LPUART5_TX_I                NXP_SIUL2_PINMUX(1, 1, 132, 0, 61, 3)
#define PI5_LPUART5_RX                  NXP_SIUL2_PINMUX(1, 1, 133, 0, 62, 3)

/* LPUART9 */
#define PF5_LPUART9_RX                  NXP_SIUL2_PINMUX(1, 1, 85, 0, 82, 1)
#define PF6_LPUART9_TX_O                NXP_SIUL2_PINMUX(1, 1, 86, 3, 0, 0)
#define PF6_LPUART9_TX_I                NXP_SIUL2_PINMUX(1, 1, 86, 0, 81, 1)
#define PG1_LPUART9_RX                  NXP_SIUL2_PINMUX(1, 1, 97, 0, 82, 2)
#define PG2_LPUART9_TX_O                NXP_SIUL2_PINMUX(1, 1, 98, 2, 0, 0)
#define PG2_LPUART9_TX_I                NXP_SIUL2_PINMUX(1, 1, 98, 0, 81, 2)
#define PI6_LPUART9_RX                  NXP_SIUL2_PINMUX(1, 1, 134, 0, 82, 3)
#define PI7_LPUART9_TX_O                NXP_SIUL2_PINMUX(1, 1, 135, 5, 0, 0)
#define PI7_LPUART9_TX_I                NXP_SIUL2_PINMUX(1, 1, 135, 0, 81, 3)

