zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPUART6 */
#define PF7_LPUART6_TX_O                NXP_SIUL2_PINMUX(1, 1, 87, 5, 0, 0)
#define PF7_LPUART6_TX_I                NXP_SIUL2_PINMUX(1, 1, 87, 0, 66, 1)
#define PF9_LPUART6_RX                  NXP_SIUL2_PINMUX(1, 1, 89, 0, 67, 1)
#define PG13_LPUART6_TX_O               NXP_SIUL2_PINMUX(1, 1, 109, 1, 0, 0)
#define PG13_LPUART6_TX_I               NXP_SIUL2_PINMUX(1, 1, 109, 0, 66, 2)
#define PG14_LPUART6_RX                 NXP_SIUL2_PINMUX(1, 1, 110, 0, 67, 2)

/* LPUART8 */
#define PF10_LPUART8_RX                 NXP_SIUL2_PINMUX(1, 1, 90, 0, 77, 1)
#define PF13_LPUART8_TX_O               NXP_SIUL2_PINMUX(1, 1, 93, 5, 0, 0)
#define PF13_LPUART8_TX_I               NXP_SIUL2_PINMUX(1, 1, 93, 0, 76, 1)
#define PG10_LPUART8_RX                 NXP_SIUL2_PINMUX(1, 1, 106, 0, 77, 2)
#define PG11_LPUART8_TX_O               NXP_SIUL2_PINMUX(1, 1, 107, 1, 0, 0)
#define PG11_LPUART8_TX_I               NXP_SIUL2_PINMUX(1, 1, 107, 0, 76, 2)
#define PH15_LPUART8_RX                 NXP_SIUL2_PINMUX(1, 1, 127, 0, 77, 3)
#define PI0_LPUART8_TX_O                NXP_SIUL2_PINMUX(1, 1, 128, 3, 0, 0)
#define PI0_LPUART8_TX_I                NXP_SIUL2_PINMUX(1, 1, 128, 0, 76, 3)

/* LPUART4 */
#define PF14_LPUART4_TX_O               NXP_SIUL2_PINMUX(1, 1, 94, 2, 0, 0)
#define PF14_LPUART4_TX_I               NXP_SIUL2_PINMUX(1, 1, 94, 0, 56, 1)
#define PG4_LPUART4_RX                  NXP_SIUL2_PINMUX(1, 1, 100, 0, 57, 1)
#define PG5_LPUART4_RX                  NXP_SIUL2_PINMUX(1, 1, 101, 0, 57, 2)
#define PG6_LPUART4_TX_O                NXP_SIUL2_PINMUX(1, 1, 102, 5, 0, 0)
#define PG6_LPUART4_TX_I                NXP_SIUL2_PINMUX(1, 1, 102, 0, 56, 2)
#define PG7_LPUART4_TX_O                NXP_SIUL2_PINMUX(1, 1, 103, 3, 0, 0)
#define PG7_LPUART4_TX_I                NXP_SIUL2_PINMUX(1, 1, 103, 0, 56, 3)
#define PG9_LPUART4_RX                  NXP_SIUL2_PINMUX(1, 1, 105, 0, 57, 3)

/* SAI1 */
#define PG1_SAI1_D1_O                   NXP_SIUL2_PINMUX(1, 1, 97, 1, 0, 0)
#define PG1_SAI1_D1_I                   NXP_SIUL2_PINMUX(1, 1, 97, 0, 154, 1)
#define PG2_SAI1_D0                     NXP_SIUL2_PINMUX(1, 1, 98, 0, 153, 1)
#define PG3_SAI1_MCLK_O                 NXP_SIUL2_PINMUX(1, 1, 99, 2, 0, 0)
#define PG3_SAI1_MCLK_I                 NXP_SIUL2_PINMUX(1, 1, 99, 0, 155, 1)
#define PG7_SAI1_BCLK_O                 NXP_SIUL2_PINMUX(1, 1, 103, 2, 0, 0)
#define PG7_SAI1_BCLK_I                 NXP_SIUL2_PINMUX(1, 1, 103, 0, 152, 1)
#define PG8_SAI1_D1_O                   NXP_SIUL2_PINMUX(1, 1, 104, 1, 0, 0)
#define PG8_SAI1_D1_I                   NXP_SIUL2_PINMUX(1, 1, 104, 0, 154, 2)
#define PG9_SAI1_D0                     NXP_SIUL2_PINMUX(1, 1, 105, 0, 153, 2)
#define PG10_SAI1_SYNC_O                NXP_SIUL2_PINMUX(1, 1, 106, 3, 0, 0)
#define PG10_SAI1_SYNC_I                NXP_SIUL2_PINMUX(1, 1, 106, 0, 156, 1)
#define PG13_SAI1_SYNC_O                NXP_SIUL2_PINMUX(1, 1, 109, 2, 0, 0)
#define PG13_SAI1_SYNC_I                NXP_SIUL2_PINMUX(1, 1, 109, 0, 156, 2)
#define PG14_SAI1_MCLK_O                NXP_SIUL2_PINMUX(1, 1, 110, 3, 0, 0)
#define PG14_SAI1_MCLK_I                NXP_SIUL2_PINMUX(1, 1, 110, 0, 155, 2)
#define PG15_SAI1_BCLK_O                NXP_SIUL2_PINMUX(1, 1, 111, 2, 0, 0)
#define PG15_SAI1_BCLK_I                NXP_SIUL2_PINMUX(1, 1, 111, 0, 152, 2)

/* LPUART11 */
#define PG1_LPUART11_RX                 NXP_SIUL2_PINMUX(1, 1, 97, 0, 92, 1)
#define PG2_LPUART11_TX_O               NXP_SIUL2_PINMUX(1, 1, 98, 5, 0, 0)
#define PG2_LPUART11_TX_I               NXP_SIUL2_PINMUX(1, 1, 98, 0, 91, 1)
#define PG3_LPUART11_RX                 NXP_SIUL2_PINMUX(1, 1, 99, 0, 92, 2)
#define PG8_LPUART11_TX_O               NXP_SIUL2_PINMUX(1, 1, 104, 7, 0, 0)
#define PG8_LPUART11_TX_I               NXP_SIUL2_PINMUX(1, 1, 104, 0, 91, 2)
#define PI0_LPUART11_RX                 NXP_SIUL2_PINMUX(1, 1, 128, 0, 92, 3)
#define PI1_LPUART11_TX_O               NXP_SIUL2_PINMUX(1, 1, 129, 2, 0, 0)
#define PI1_LPUART11_TX_I               NXP_SIUL2_PINMUX(1, 1, 129, 0, 91, 3)
#define PI3_LPUART11_TX_O               NXP_SIUL2_PINMUX(1, 1, 131, 3, 0, 0)
#define PI3_LPUART11_TX_I               NXP_SIUL2_PINMUX(1, 1, 131, 0, 91, 4)
#define PI4_LPUART11_RX                 NXP_SIUL2_PINMUX(1, 1, 132, 0, 92, 4)

/* HSE2_LPUART */
#define PG9_HSE2_LPUART_CTS             NXP_SIUL2_PINMUX(1, 1, 105, 0, 202, 1)
#define PG10_HSE2_LPUART_RTS            NXP_SIUL2_PINMUX(1, 1, 106, 15, 0, 0)
#define PG11_HSE2_LPUART_RX             NXP_SIUL2_PINMUX(1, 1, 107, 0, 201, 1)
#define PG12_HSE2_LPUART_TX_O           NXP_SIUL2_PINMUX(1, 1, 108, 15, 0, 0)
#define PG12_HSE2_LPUART_TX_I           NXP_SIUL2_PINMUX(1, 1, 108, 0, 200, 1)

/* LPUART10 */
#define PG10_LPUART10_RX                NXP_SIUL2_PINMUX(1, 1, 106, 0, 87, 1)
#define PG11_LPUART10_TX_O              NXP_SIUL2_PINMUX(1, 1, 107, 5, 0, 0)
#define PG11_LPUART10_TX_I              NXP_SIUL2_PINMUX(1, 1, 107, 0, 86, 1)
#define PH14_LPUART10_TX_O              NXP_SIUL2_PINMUX(1, 1, 126, 4, 0, 0)
#define PH14_LPUART10_TX_I              NXP_SIUL2_PINMUX(1, 1, 126, 0, 86, 2)
#define PH15_LPUART10_RX                NXP_SIUL2_PINMUX(1, 1, 127, 0, 87, 2)
#define PI8_LPUART10_RX                 NXP_SIUL2_PINMUX(1, 1, 136, 0, 87, 3)

/* LPE_SIUL2 */
#define PK0_LPE_SIUL2_EIRQ0             NXP_SIUL2_PINMUX(2, 2, 160, 0, 0, 1)
#define PK1_LPE_SIUL2_EIRQ1             NXP_SIUL2_PINMUX(2, 2, 161, 0, 1, 1)
#define PK2_LPE_SIUL2_EIRQ10            NXP_SIUL2_PINMUX(2, 2, 162, 0, 10, 1)
#define PK3_LPE_SIUL2_EIRQ4             NXP_SIUL2_PINMUX(2, 2, 163, 0, 4, 1)
#define PK4_LPE_SIUL2_EIRQ6             NXP_SIUL2_PINMUX(2, 2, 164, 0, 6, 1)
#define PK5_LPE_SIUL2_EIRQ13            NXP_SIUL2_PINMUX(2, 2, 165, 0, 13, 1)
#define PK6_LPE_SIUL2_EIRQ12            NXP_SIUL2_PINMUX(2, 2, 166, 0, 12, 1)
#define PK7_LPE_SIUL2_EIRQ11            NXP_SIUL2_PINMUX(2, 2, 167, 0, 11, 1)
#define PK8_LPE_SIUL2_EIRQ9             NXP_SIUL2_PINMUX(2, 2, 168, 0, 9, 1)
#define PK9_LPE_SIUL2_EIRQ14            NXP_SIUL2_PINMUX(2, 2, 169, 0, 14, 1)
#define PK11_LPE_SIUL2_EIRQ4            NXP_SIUL2_PINMUX(2, 2, 171, 0, 4, 2)
#define PK12_LPE_SIUL2_EIRQ5            NXP_SIUL2_PINMUX(2, 2, 172, 0, 5, 2)
#define PK13_LPE_SIUL2_EIRQ6            NXP_SIUL2_PINMUX(2, 2, 173, 0, 6, 3)
#define PK14_LPE_SIUL2_EIRQ7            NXP_SIUL2_PINMUX(2, 2, 174, 0, 7, 2)
#define PK15_LPE_SIUL2_EIRQ8            NXP_SIUL2_PINMUX(2, 2, 175, 0, 8, 2)
#define PL0_LPE_SIUL2_EIRQ9             NXP_SIUL2_PINMUX(2, 2, 176, 0, 9, 2)
#define PL1_LPE_SIUL2_EIRQ10            NXP_SIUL2_PINMUX(2, 2, 177, 0, 10, 2)
#define PL2_LPE_SIUL2_EIRQ11            NXP_SIUL2_PINMUX(2, 2, 178, 0, 11, 2)
#define PL3_LPE_SIUL2_EIRQ12            NXP_SIUL2_PINMUX(2, 2, 179, 0, 12, 3)
#define PL4_LPE_SIUL2_EIRQ13            NXP_SIUL2_PINMUX(2, 2, 180, 0, 13, 3)
#define PL5_LPE_SIUL2_EIRQ14            NXP_SIUL2_PINMUX(2, 2, 181, 0, 14, 3)
#define PL6_LPE_SIUL2_EIRQ15            NXP_SIUL2_PINMUX(2, 2, 182, 0, 15, 2)
#define PL7_LPE_SIUL2_EIRQ0             NXP_SIUL2_PINMUX(2, 2, 183, 0, 0, 3)
#define PL8_LPE_SIUL2_EIRQ1             NXP_SIUL2_PINMUX(2, 2, 184, 0, 1, 3)
#define PL9_LPE_SIUL2_EIRQ2             NXP_SIUL2_PINMUX(2, 2, 185, 0, 2, 3)
#define PL10_LPE_SIUL2_EIRQ3            NXP_SIUL2_PINMUX(2, 2, 186, 0, 3, 3)
#define PL11_LPE_SIUL2_EIRQ4            NXP_SIUL2_PINMUX(2, 2, 187, 0, 4, 3)
#define PL12_LPE_SIUL2_EIRQ5            NXP_SIUL2_PINMUX(2, 2, 188, 0, 5, 3)
#define PL13_LPE_SIUL2_EIRQ5            NXP_SIUL2_PINMUX(2, 2, 189, 0, 5, 4)
#define PL14_LPE_SIUL2_EIRQ6            NXP_SIUL2_PINMUX(2, 2, 190, 0, 6, 4)
#define PL15_LPE_SIUL2_EIRQ7            NXP_SIUL2_PINMUX(2, 2, 191, 0, 7, 3)
#define PM0_LPE_SIUL2_EIRQ5             NXP_SIUL2_PINMUX(2, 2, 192, 0, 5, 1)
#define PM1_LPE_SIUL2_EIRQ8             NXP_SIUL2_PINMUX(2, 2, 193, 0, 8, 1)
#define PM2_LPE_SIUL2_EIRQ3             NXP_SIUL2_PINMUX(2, 2, 194, 0, 3, 1)
#define PM3_LPE_SIUL2_EIRQ7             NXP_SIUL2_PINMUX(2, 2, 195, 0, 7, 1)
#define PM4_LPE_SIUL2_EIRQ2             NXP_SIUL2_PINMUX(2, 2, 196, 0, 2, 1)
#define PM6_LPE_SIUL2_EIRQ6             NXP_SIUL2_PINMUX(2, 2, 198, 0, 6, 2)
#define PM7_LPE_SIUL2_EIRQ12            NXP_SIUL2_PINMUX(2, 2, 199, 0, 12, 2)
#define PM8_LPE_SIUL2_EIRQ13            NXP_SIUL2_PINMUX(2, 2, 200, 0, 13, 2)
#define PM9_LPE_SIUL2_EIRQ14            NXP_SIUL2_PINMUX(2, 2, 201, 0, 14, 2)
#define PM10_LPE_SIUL2_EIRQ15           NXP_SIUL2_PINMUX(2, 2, 202, 0, 15, 1)
#define PM12_LPE_SIUL2_EIRQ0            NXP_SIUL2_PINMUX(2, 2, 204, 0, 0, 2)
#define PM13_LPE_SIUL2_EIRQ1            NXP_SIUL2_PINMUX(2, 2, 205, 0, 1, 2)
#define PM14_LPE_SIUL2_EIRQ2            NXP_SIUL2_PINMUX(2, 2, 206, 0, 2, 2)
#define PM15_LPE_SIUL2_EIRQ3            NXP_SIUL2_PINMUX(2, 2, 207, 0, 3, 2)

/* LPE_LPSPI1 */
#define PK0_LPE_LPSPI1_SCK_O            NXP_SIUL2_PINMUX(2, 2, 160, 1, 0, 0)
#define PK0_LPE_LPSPI1_SCK_I            NXP_SIUL2_PINMUX(2, 2, 160, 0, 31, 1)
#define PK1_LPE_LPSPI1_SCK_O            NXP_SIUL2_PINMUX(2, 2, 161, 1, 0, 0)
#define PK1_LPE_LPSPI1_SCK_I            NXP_SIUL2_PINMUX(2, 2, 161, 0, 31, 2)
#define PK2_LPE_LPSPI1_PCS1_O           NXP_SIUL2_PINMUX(2, 2, 162, 3, 0, 0)
#define PK2_LPE_LPSPI1_PCS1_I           NXP_SIUL2_PINMUX(2, 2, 162, 0, 30, 1)
#define PK3_LPE_LPSPI1_SOUT_O           NXP_SIUL2_PINMUX(2, 2, 163, 1, 0, 0)
#define PK3_LPE_LPSPI1_SOUT_I           NXP_SIUL2_PINMUX(2, 2, 163, 0, 33, 1)
#define PK4_LPE_LPSPI1_SCK_O            NXP_SIUL2_PINMUX(2, 2, 164, 2, 0, 0)
#define PK4_LPE_LPSPI1_SCK_I            NXP_SIUL2_PINMUX(2, 2, 164, 0, 31, 3)
#define PK5_LPE_LPSPI1_PCS0_O           NXP_SIUL2_PINMUX(2, 2, 165, 6, 0, 0)
#define PK5_LPE_LPSPI1_PCS0_I           NXP_SIUL2_PINMUX(2, 2, 165, 0, 29, 1)
#define PK6_LPE_LPSPI1_SIN_O            NXP_SIUL2_PINMUX(2, 2, 166, 1, 0, 0)
#define PK6_LPE_LPSPI1_SIN_I            NXP_SIUL2_PINMUX(2, 2, 166, 0, 32, 1)
#define PL7_LPE_LPSPI1_SOUT_O           NXP_SIUL2_PINMUX(2, 2, 183, 3, 0, 0)
#define PL7_LPE_LPSPI1_SOUT_I           NXP_SIUL2_PINMUX(2, 2, 183, 0, 33, 4)
#define PL8_LPE_LPSPI1_PCS0_O           NXP_SIUL2_PINMUX(2, 2, 184, 4, 0, 0)
#define PL8_LPE_LPSPI1_PCS0_I           NXP_SIUL2_PINMUX(2, 2, 184, 0, 29, 4)
#define PL9_LPE_LPSPI1_PCS1_O           NXP_SIUL2_PINMUX(2, 2, 185, 1, 0, 0)
#define PL9_LPE_LPSPI1_PCS1_I           NXP_SIUL2_PINMUX(2, 2, 185, 0, 30, 3)
#define PL10_LPE_LPSPI1_SCK_O           NXP_SIUL2_PINMUX(2, 2, 186, 1, 0, 0)
#define PL10_LPE_LPSPI1_SCK_I           NXP_SIUL2_PINMUX(2, 2, 186, 0, 31, 5)
#define PL11_LPE_LPSPI1_SIN_O           NXP_SIUL2_PINMUX(2, 2, 187, 4, 0, 0)
#define PL11_LPE_LPSPI1_SIN_I           NXP_SIUL2_PINMUX(2, 2, 187, 0, 32, 4)
#define PM1_LPE_LPSPI1_PCS0_O           NXP_SIUL2_PINMUX(2, 2, 193, 1, 0, 0)
#define PM1_LPE_LPSPI1_PCS0_I           NXP_SIUL2_PINMUX(2, 2, 193, 0, 29, 2)
#define PM3_LPE_LPSPI1_SIN_O            NXP_SIUL2_PINMUX(2, 2, 195, 1, 0, 0)
#define PM3_LPE_LPSPI1_SIN_I            NXP_SIUL2_PINMUX(2, 2, 195, 0, 32, 2)
#define PM9_LPE_LPSPI1_SOUT_O           NXP_SIUL2_PINMUX(2, 2, 201, 3, 0, 0)
#define PM9_LPE_LPSPI1_SOUT_I           NXP_SIUL2_PINMUX(2, 2, 201, 0, 33, 2)
#define PM11_LPE_LPSPI1_PCS1_O          NXP_SIUL2_PINMUX(2, 2, 203, 3, 0, 0)
#define PM11_LPE_LPSPI1_PCS1_I          NXP_SIUL2_PINMUX(2, 2, 203, 0, 30, 2)
#define PM12_LPE_LPSPI1_PCS0_O          NXP_SIUL2_PINMUX(2, 2, 204, 5, 0, 0)
#define PM12_LPE_LPSPI1_PCS0_I          NXP_SIUL2_PINMUX(2, 2, 204, 0, 29, 3)
#define PM13_LPE_LPSPI1_SOUT_O          NXP_SIUL2_PINMUX(2, 2, 205, 3, 0, 0)
#define PM13_LPE_LPSPI1_SOUT_I          NXP_SIUL2_PINMUX(2, 2, 205, 0, 33, 3)
#define PM14_LPE_LPSPI1_SCK_O           NXP_SIUL2_PINMUX(2, 2, 206, 4, 0, 0)
#define PM14_LPE_LPSPI1_SCK_I           NXP_SIUL2_PINMUX(2, 2, 206, 0, 31, 4)
#define PM15_LPE_LPSPI1_SIN_O           NXP_SIUL2_PINMUX(2, 2, 207, 2, 0, 0)
#define PM15_LPE_LPSPI1_SIN_I           NXP_SIUL2_PINMUX(2, 2, 207, 0, 32, 3)

/* LPE_CXPI0 */
#define PK0_LPE_CXPI0_TX                NXP_SIUL2_PINMUX(2, 2, 160, 2, 0, 0)
#define PK2_LPE_CXPI0_RX                NXP_SIUL2_PINMUX(2, 2, 162, 0, 101, 1)
#define PK7_LPE_CXPI0_TX                NXP_SIUL2_PINMUX(2, 2, 167, 8, 0, 0)
#define PK8_LPE_CXPI0_RX                NXP_SIUL2_PINMUX(2, 2, 168, 0, 101, 2)
#define PL4_LPE_CXPI0_TX                NXP_SIUL2_PINMUX(2, 2, 180, 2, 0, 0)
#define PL5_LPE_CXPI0_RX                NXP_SIUL2_PINMUX(2, 2, 181, 0, 101, 5)
#define PM0_LPE_CXPI0_RX                NXP_SIUL2_PINMUX(2, 2, 192, 0, 101, 3)
#define PM2_LPE_CXPI0_TX                NXP_SIUL2_PINMUX(2, 2, 194, 6, 0, 0)
#define PM12_LPE_CXPI0_TX               NXP_SIUL2_PINMUX(2, 2, 204, 3, 0, 0)
#define PM13_LPE_CXPI0_RX               NXP_SIUL2_PINMUX(2, 2, 205, 0, 101, 4)

/* LPE_LPUART0 */
#define PK0_LPE_LPUART0_RTS             NXP_SIUL2_PINMUX(2, 2, 160, 3, 0, 0)
#define PK1_LPE_LPUART0_CTS             NXP_SIUL2_PINMUX(2, 2, 161, 0, 45, 1)
#define PK2_LPE_LPUART0_RX              NXP_SIUL2_PINMUX(2, 2, 162, 0, 44, 1)
#define PK3_LPE_LPUART0_TX_O            NXP_SIUL2_PINMUX(2, 2, 163, 5, 0, 0)
#define PK3_LPE_LPUART0_TX_I            NXP_SIUL2_PINMUX(2, 2, 163, 0, 43, 1)
#define PK4_LPE_LPUART0_RX              NXP_SIUL2_PINMUX(2, 2, 164, 0, 44, 2)
#define PK5_LPE_LPUART0_CTS             NXP_SIUL2_PINMUX(2, 2, 165, 0, 45, 2)
#define PK6_LPE_LPUART0_RTS             NXP_SIUL2_PINMUX(2, 2, 166, 7, 0, 0)
#define PK7_LPUART_RIN_B                NXP_SIUL2_PINMUX(2, 2, 167, 0, 48, 1)
#define PK9_LPUART_DTR_B                NXP_SIUL2_PINMUX(2, 2, 169, 4, 0, 0)
#define PL2_LPE_LPUART0_RTS             NXP_SIUL2_PINMUX(2, 2, 178, 6, 0, 0)
#define PL3_LPE_LPUART0_CTS             NXP_SIUL2_PINMUX(2, 2, 179, 0, 45, 4)
#define PL4_LPE_LPUART0_RX              NXP_SIUL2_PINMUX(2, 2, 180, 0, 44, 4)
#define PL5_LPE_LPUART0_TX_O            NXP_SIUL2_PINMUX(2, 2, 181, 1, 0, 0)
#define PL5_LPE_LPUART0_TX_I            NXP_SIUL2_PINMUX(2, 2, 181, 0, 43, 4)
#define PL7_LPE_LPUART0_RX              NXP_SIUL2_PINMUX(2, 2, 183, 0, 44, 5)
#define PL8_LPE_LPUART0_TX_O            NXP_SIUL2_PINMUX(2, 2, 184, 6, 0, 0)
#define PL8_LPE_LPUART0_TX_I            NXP_SIUL2_PINMUX(2, 2, 184, 0, 43, 5)
#define PL9_LPUART_DCD_B                NXP_SIUL2_PINMUX(2, 2, 185, 0, 47, 2)
#define PL10_LPE_LPUART0_RTS            NXP_SIUL2_PINMUX(2, 2, 186, 6, 0, 0)
#define PL11_LPE_LPUART0_CTS            NXP_SIUL2_PINMUX(2, 2, 187, 0, 45, 5)
#define PL12_LPUART_DSR_B               NXP_SIUL2_PINMUX(2, 2, 188, 0, 46, 2)
#define PL13_LPUART_DTR_B               NXP_SIUL2_PINMUX(2, 2, 189, 4, 0, 0)
#define PL14_LPUART_RIN_B               NXP_SIUL2_PINMUX(2, 2, 190, 0, 48, 2)
#define PM3_LPE_LPUART0_TX_O            NXP_SIUL2_PINMUX(2, 2, 195, 5, 0, 0)
#define PM3_LPE_LPUART0_TX_I            NXP_SIUL2_PINMUX(2, 2, 195, 0, 43, 2)
#define PM6_LPE_LPUART0_RTS             NXP_SIUL2_PINMUX(2, 2, 198, 4, 0, 0)
#define PM7_LPE_LPUART0_TX_O            NXP_SIUL2_PINMUX(2, 2, 199, 2, 0, 0)
#define PM7_LPE_LPUART0_TX_I            NXP_SIUL2_PINMUX(2, 2, 199, 0, 43, 3)
#define PM8_LPE_LPUART0_RX              NXP_SIUL2_PINMUX(2, 2, 200, 0, 44, 3)
#define PM9_LPE_LPUART0_CTS             NXP_SIUL2_PINMUX(2, 2, 201, 0, 45, 3)
#define PM10_LPUART_DCD_B               NXP_SIUL2_PINMUX(2, 2, 202, 0, 47, 1)
#define PM11_LPUART_DSR_B               NXP_SIUL2_PINMUX(2, 2, 203, 0, 46, 1)

/* LPE_LPI2C0 */
#define PK0_LPE_LPI2C0_SCLS_O           NXP_SIUL2_PINMUX(2, 2, 160, 4, 0, 0)
#define PK0_LPE_LPI2C0_SCLS_I           NXP_SIUL2_PINMUX(2, 2, 160, 0, 40, 1)
#define PK2_LPE_LPI2C0_SCLS_O           NXP_SIUL2_PINMUX(2, 2, 162, 9, 0, 0)
#define PK2_LPE_LPI2C0_SCLS_I           NXP_SIUL2_PINMUX(2, 2, 162, 0, 40, 2)
#define PK3_LPE_LPI2C0_SDAS_O           NXP_SIUL2_PINMUX(2, 2, 163, 2, 0, 0)
#define PK3_LPE_LPI2C0_SCL_O            NXP_SIUL2_PINMUX(2, 2, 163, 13, 0, 0)
#define PK3_LPE_LPI2C0_SCL_I            NXP_SIUL2_PINMUX(2, 2, 163, 0, 38, 2)
#define PK3_LPE_LPI2C0_SDAS_I           NXP_SIUL2_PINMUX(2, 2, 163, 0, 41, 1)
#define PK4_LPE_LPI2C0_HREQ             NXP_SIUL2_PINMUX(2, 2, 164, 0, 37, 1)
#define PK5_LPE_LPI2C0_SDAS_O           NXP_SIUL2_PINMUX(2, 2, 165, 1, 0, 0)
#define PK5_LPE_LPI2C0_SDAS_I           NXP_SIUL2_PINMUX(2, 2, 165, 0, 41, 2)
#define PK6_LPE_LPI2C0_SDA_O            NXP_SIUL2_PINMUX(2, 2, 166, 2, 0, 0)
#define PK6_LPE_LPI2C0_SDA_I            NXP_SIUL2_PINMUX(2, 2, 166, 0, 39, 2)
#define PK7_LPE_LPI2C0_SCL_O            NXP_SIUL2_PINMUX(2, 2, 167, 3, 0, 0)
#define PK7_LPE_LPI2C0_SCL_I            NXP_SIUL2_PINMUX(2, 2, 167, 0, 38, 3)
#define PK9_LPE_LPI2C0_SCL_O            NXP_SIUL2_PINMUX(2, 2, 169, 2, 0, 0)
#define PK9_LPE_LPI2C0_SCL_I            NXP_SIUL2_PINMUX(2, 2, 169, 0, 38, 4)
#define PL7_LPE_LPI2C0_SDAS_O           NXP_SIUL2_PINMUX(2, 2, 183, 4, 0, 0)
#define PL7_LPE_LPI2C0_SDAS_I           NXP_SIUL2_PINMUX(2, 2, 183, 0, 41, 6)
#define PL8_LPE_LPI2C0_SCL_O            NXP_SIUL2_PINMUX(2, 2, 184, 3, 0, 0)
#define PL8_LPE_LPI2C0_SCL_I            NXP_SIUL2_PINMUX(2, 2, 184, 0, 38, 6)
#define PL9_LPE_LPI2C0_HREQ             NXP_SIUL2_PINMUX(2, 2, 185, 0, 37, 5)
#define PL10_LPE_LPI2C0_SCLS_O          NXP_SIUL2_PINMUX(2, 2, 186, 4, 0, 0)
#define PL10_LPE_LPI2C0_SCLS_I          NXP_SIUL2_PINMUX(2, 2, 186, 0, 40, 5)
#define PL11_LPE_LPI2C0_SDA_O           NXP_SIUL2_PINMUX(2, 2, 187, 3, 0, 0)
#define PL11_LPE_LPI2C0_SDA_I           NXP_SIUL2_PINMUX(2, 2, 187, 0, 39, 6)
#define PM0_LPE_LPI2C0_SDA_O            NXP_SIUL2_PINMUX(2, 2, 192, 2, 0, 0)
#define PM0_LPE_LPI2C0_SDA_I            NXP_SIUL2_PINMUX(2, 2, 192, 0, 39, 3)
#define PM1_LPE_LPI2C0_SDAS_O           NXP_SIUL2_PINMUX(2, 2, 193, 4, 0, 0)
#define PM1_LPE_LPI2C0_SDAS_I           NXP_SIUL2_PINMUX(2, 2, 193, 0, 41, 3)
#define PM2_LPE_LPI2C0_SCL_O            NXP_SIUL2_PINMUX(2, 2, 194, 3, 0, 0)
#define PM2_LPE_LPI2C0_SCL_I            NXP_SIUL2_PINMUX(2, 2, 194, 0, 38, 5)
#define PM3_LPE_LPI2C0_HREQ             NXP_SIUL2_PINMUX(2, 2, 195, 0, 37, 2)
#define PM6_LPE_LPI2C0_SDA_O            NXP_SIUL2_PINMUX(2, 2, 198, 2, 0, 0)
#define PM6_LPE_LPI2C0_SDA_I            NXP_SIUL2_PINMUX(2, 2, 198, 0, 39, 4)
#define PM7_LPE_LPI2C0_SDAS_O           NXP_SIUL2_PINMUX(2, 2, 199, 1, 0, 0)
#define PM7_LPE_LPI2C0_SDAS_I           NXP_SIUL2_PINMUX(2, 2, 199, 0, 41, 4)
#define PM8_LPE_LPI2C0_SCLS_O           NXP_SIUL2_PINMUX(2, 2, 200, 1, 0, 0)
#define PM8_LPE_LPI2C0_SCLS_I           NXP_SIUL2_PINMUX(2, 2, 200, 0, 40, 3)
#define PM9_LPE_LPI2C0_HREQ             NXP_SIUL2_PINMUX(2, 2, 201, 0, 37, 3)
#define PM12_LPE_LPI2C0_SDA_O           NXP_SIUL2_PINMUX(2, 2, 204, 1, 0, 0)
#define PM12_LPE_LPI2C0_SDA_I           NXP_SIUL2_PINMUX(2, 2, 204, 0, 39, 5)
#define PM13_LPE_LPI2C0_SDAS_O          NXP_SIUL2_PINMUX(2, 2, 205, 1, 0, 0)
#define PM13_LPE_LPI2C0_SDAS_I          NXP_SIUL2_PINMUX(2, 2, 205, 0, 41, 5)
#define PM14_LPE_LPI2C0_SCLS_O          NXP_SIUL2_PINMUX(2, 2, 206, 1, 0, 0)
#define PM14_LPE_LPI2C0_SCLS_I          NXP_SIUL2_PINMUX(2, 2, 206, 0, 40, 4)
#define PM15_LPE_LPI2C0_HREQ            NXP_SIUL2_PINMUX(2, 2, 207, 0, 37, 4)

