zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPE_FTM */
#define PK0_LPE_FTM_CH3_O               NXP_SIUL2_PINMUX(2, 2, 160, 5, 0, 0)
#define PK0_LPE_FTM_CH3_I               NXP_SIUL2_PINMUX(2, 2, 160, 0, 77, 1)
#define PK1_LPE_FTM_CH0_O               NXP_SIUL2_PINMUX(2, 2, 161, 3, 0, 0)
#define PK1_LPE_FTM_CH0_I               NXP_SIUL2_PINMUX(2, 2, 161, 0, 74, 1)
#define PK2_LPE_FTM_CH1_O               NXP_SIUL2_PINMUX(2, 2, 162, 4, 0, 0)
#define PK2_LPE_FTM_CH1_I               NXP_SIUL2_PINMUX(2, 2, 162, 0, 75, 1)
#define PK3_LPE_FTM_CH4_O               NXP_SIUL2_PINMUX(2, 2, 163, 3, 0, 0)
#define PK3_LPE_FTM_CH4_I               NXP_SIUL2_PINMUX(2, 2, 163, 0, 78, 1)
#define PK3_LPE_FTM_QD_PHA              NXP_SIUL2_PINMUX(2, 2, 163, 0, 86, 2)
#define PK4_LPE_FTM_CH6_O               NXP_SIUL2_PINMUX(2, 2, 164, 1, 0, 0)
#define PK4_LPE_FTM_CH6_I               NXP_SIUL2_PINMUX(2, 2, 164, 0, 80, 1)
#define PK5_LPE_FTM_CH7_O               NXP_SIUL2_PINMUX(2, 2, 165, 3, 0, 0)
#define PK5_LPE_FTM_CH7_I               NXP_SIUL2_PINMUX(2, 2, 165, 0, 81, 1)
#define PK6_LPE_FTM_CH5_O               NXP_SIUL2_PINMUX(2, 2, 166, 8, 0, 0)
#define PK6_LPE_FTM_CH5_I               NXP_SIUL2_PINMUX(2, 2, 166, 0, 79, 1)
#define PK6_LPE_FTM_QD_PHB              NXP_SIUL2_PINMUX(2, 2, 166, 0, 87, 2)
#define PK7_LPE_FTM_CH4_O               NXP_SIUL2_PINMUX(2, 2, 167, 4, 0, 0)
#define PK7_LPE_FTM_CH4_I               NXP_SIUL2_PINMUX(2, 2, 167, 0, 78, 2)
#define PK8_LPE_FTM_FLT3                NXP_SIUL2_PINMUX(2, 2, 168, 0, 85, 1)
#define PK9_LPE_FTM_FLT3                NXP_SIUL2_PINMUX(2, 2, 169, 0, 85, 2)
#define PK9_LPE_FTM_QD_PHA              NXP_SIUL2_PINMUX(2, 2, 169, 0, 86, 3)
#define PK10_LPE_FTM_CH5_O              NXP_SIUL2_PINMUX(2, 2, 170, 2, 0, 0)
#define PK10_LPE_FTM_CH5_I              NXP_SIUL2_PINMUX(2, 2, 170, 0, 79, 3)
#define PK11_LPE_FTM_FLT3               NXP_SIUL2_PINMUX(2, 2, 171, 0, 85, 4)
#define PK12_LPE_FTM_QD_PHB             NXP_SIUL2_PINMUX(2, 2, 172, 0, 87, 4)
#define PK13_LPE_FTM_CH0_O              NXP_SIUL2_PINMUX(2, 2, 173, 2, 0, 0)
#define PK13_LPE_FTM_CH0_I              NXP_SIUL2_PINMUX(2, 2, 173, 0, 74, 7)
#define PK14_LPE_FTM_QD_PHA             NXP_SIUL2_PINMUX(2, 2, 174, 0, 86, 4)
#define PK15_LPE_FTM_CH2_O              NXP_SIUL2_PINMUX(2, 2, 175, 2, 0, 0)
#define PK15_LPE_FTM_CH2_I              NXP_SIUL2_PINMUX(2, 2, 175, 0, 76, 4)
#define PL0_LPE_FTM_CH1_O               NXP_SIUL2_PINMUX(2, 2, 176, 2, 0, 0)
#define PL0_LPE_FTM_CH1_I               NXP_SIUL2_PINMUX(2, 2, 176, 0, 75, 3)
#define PL1_LPE_FTM_CH4_O               NXP_SIUL2_PINMUX(2, 2, 177, 1, 0, 0)
#define PL1_LPE_FTM_CH4_I               NXP_SIUL2_PINMUX(2, 2, 177, 0, 78, 5)
#define PL2_LPE_FTM_CH3_O               NXP_SIUL2_PINMUX(2, 2, 178, 1, 0, 0)
#define PL2_LPE_FTM_CH3_I               NXP_SIUL2_PINMUX(2, 2, 178, 0, 77, 5)
#define PL3_LPE_FTM_CH6_O               NXP_SIUL2_PINMUX(2, 2, 179, 3, 0, 0)
#define PL3_LPE_FTM_CH6_I               NXP_SIUL2_PINMUX(2, 2, 179, 0, 80, 4)
#define PL4_LPE_FTM_CH5_O               NXP_SIUL2_PINMUX(2, 2, 180, 5, 0, 0)
#define PL4_LPE_FTM_CH5_I               NXP_SIUL2_PINMUX(2, 2, 180, 0, 79, 6)
#define PL5_LPE_FTM_CH7_O               NXP_SIUL2_PINMUX(2, 2, 181, 2, 0, 0)
#define PL5_LPE_FTM_CH7_I               NXP_SIUL2_PINMUX(2, 2, 181, 0, 81, 5)
#define PL6_LPE_FTM_CH5_O               NXP_SIUL2_PINMUX(2, 2, 182, 3, 0, 0)
#define PL6_LPE_FTM_CH5_I               NXP_SIUL2_PINMUX(2, 2, 182, 0, 79, 5)
#define PL7_LPE_FTM_CH4_O               NXP_SIUL2_PINMUX(2, 2, 183, 2, 0, 0)
#define PL7_LPE_FTM_CH4_I               NXP_SIUL2_PINMUX(2, 2, 183, 0, 78, 4)
#define PL8_LPE_FTM_CH1_O               NXP_SIUL2_PINMUX(2, 2, 184, 1, 0, 0)
#define PL8_LPE_FTM_CH1_I               NXP_SIUL2_PINMUX(2, 2, 184, 0, 75, 4)
#define PL9_LPE_FTM_FLT3                NXP_SIUL2_PINMUX(2, 2, 185, 0, 85, 5)
#define PL10_LPE_FTM_CH5_O              NXP_SIUL2_PINMUX(2, 2, 186, 2, 0, 0)
#define PL10_LPE_FTM_CH5_I              NXP_SIUL2_PINMUX(2, 2, 186, 0, 79, 4)
#define PL11_LPE_FTM_CH0_O              NXP_SIUL2_PINMUX(2, 2, 187, 1, 0, 0)
#define PL11_LPE_FTM_CH0_I              NXP_SIUL2_PINMUX(2, 2, 187, 0, 74, 6)
#define PL12_LPE_FTM_CH3_O              NXP_SIUL2_PINMUX(2, 2, 188, 1, 0, 0)
#define PL12_LPE_FTM_CH3_I              NXP_SIUL2_PINMUX(2, 2, 188, 0, 77, 4)
#define PL13_LPE_FTM_CH2_O              NXP_SIUL2_PINMUX(2, 2, 189, 2, 0, 0)
#define PL13_LPE_FTM_CH2_I              NXP_SIUL2_PINMUX(2, 2, 189, 0, 76, 5)
#define PL14_LPE_FTM_CH7_O              NXP_SIUL2_PINMUX(2, 2, 190, 2, 0, 0)
#define PL14_LPE_FTM_CH7_I              NXP_SIUL2_PINMUX(2, 2, 190, 0, 81, 4)
#define PL15_LPE_FTM_CH6_O              NXP_SIUL2_PINMUX(2, 2, 191, 4, 0, 0)
#define PL15_LPE_FTM_CH6_I              NXP_SIUL2_PINMUX(2, 2, 191, 0, 80, 5)
#define PM0_LPE_FTM_QD_PHB              NXP_SIUL2_PINMUX(2, 2, 192, 0, 87, 3)
#define PM1_LPE_FTM_CH6_O               NXP_SIUL2_PINMUX(2, 2, 193, 2, 0, 0)
#define PM1_LPE_FTM_CH6_I               NXP_SIUL2_PINMUX(2, 2, 193, 0, 80, 2)
#define PM2_LPE_FTM_CH7_O               NXP_SIUL2_PINMUX(2, 2, 194, 2, 0, 0)
#define PM2_LPE_FTM_CH7_I               NXP_SIUL2_PINMUX(2, 2, 194, 0, 81, 2)
#define PM3_LPE_FTM_CH2_O               NXP_SIUL2_PINMUX(2, 2, 195, 2, 0, 0)
#define PM3_LPE_FTM_CH2_I               NXP_SIUL2_PINMUX(2, 2, 195, 0, 76, 1)
#define PM6_LPE_FTM_CH5_O               NXP_SIUL2_PINMUX(2, 2, 198, 6, 0, 0)
#define PM6_LPE_FTM_CH5_I               NXP_SIUL2_PINMUX(2, 2, 198, 0, 79, 2)
#define PM7_LPE_FTM_CH4_O               NXP_SIUL2_PINMUX(2, 2, 199, 4, 0, 0)
#define PM7_LPE_FTM_CH4_I               NXP_SIUL2_PINMUX(2, 2, 199, 0, 78, 3)
#define PM8_LPE_FTM_CH3_O               NXP_SIUL2_PINMUX(2, 2, 200, 5, 0, 0)
#define PM8_LPE_FTM_CH3_I               NXP_SIUL2_PINMUX(2, 2, 200, 0, 77, 2)
#define PM9_LPE_FTM_CH2_O               NXP_SIUL2_PINMUX(2, 2, 201, 2, 0, 0)
#define PM9_LPE_FTM_CH2_I               NXP_SIUL2_PINMUX(2, 2, 201, 0, 76, 2)
#define PM10_LPE_FTM_CH0_O              NXP_SIUL2_PINMUX(2, 2, 202, 2, 0, 0)
#define PM10_LPE_FTM_CH0_I              NXP_SIUL2_PINMUX(2, 2, 202, 0, 74, 2)
#define PM11_LPE_FTM_CH1_O              NXP_SIUL2_PINMUX(2, 2, 203, 1, 0, 0)
#define PM11_LPE_FTM_CH1_I              NXP_SIUL2_PINMUX(2, 2, 203, 0, 75, 2)
#define PM12_LPE_FTM_CH3_O              NXP_SIUL2_PINMUX(2, 2, 204, 4, 0, 0)
#define PM12_LPE_FTM_CH3_I              NXP_SIUL2_PINMUX(2, 2, 204, 0, 77, 3)
#define PM13_LPE_FTM_CH2_O              NXP_SIUL2_PINMUX(2, 2, 205, 2, 0, 0)
#define PM13_LPE_FTM_CH2_I              NXP_SIUL2_PINMUX(2, 2, 205, 0, 76, 3)
#define PM14_LPE_FTM_CH6_O              NXP_SIUL2_PINMUX(2, 2, 206, 3, 0, 0)
#define PM14_LPE_FTM_CH6_I              NXP_SIUL2_PINMUX(2, 2, 206, 0, 80, 3)
#define PM15_LPE_FTM_CH7_O              NXP_SIUL2_PINMUX(2, 2, 207, 1, 0, 0)
#define PM15_LPE_FTM_CH7_I              NXP_SIUL2_PINMUX(2, 2, 207, 0, 81, 3)

