zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* CMP1 */
#define PK0_LPE_CMP1_OUT                NXP_SIUL2_PINMUX(2, 2, 160, 6, 0, 0)
#define PK2_LPE_CMP1_OUT                NXP_SIUL2_PINMUX(2, 2, 162, 6, 0, 0)
#define PK3_LPE_CMP1_RRT                NXP_SIUL2_PINMUX(2, 2, 163, 4, 0, 0)
#define PK3_LPE_CMP1_OUT                NXP_SIUL2_PINMUX(2, 2, 163, 11, 0, 0)
#define PK4_LPE_CMP1_RRT                NXP_SIUL2_PINMUX(2, 2, 164, 6, 0, 0)
#define PK9_LPE_CMP1_OUT                NXP_SIUL2_PINMUX(2, 2, 169, 3, 0, 0)
#define PL3_LPE_CMP1_RRT                NXP_SIUL2_PINMUX(2, 2, 179, 2, 0, 0)
#define PL4_LPE_CMP1_OUT                NXP_SIUL2_PINMUX(2, 2, 180, 1, 0, 0)
#define PM3_LPE_CMP1_RRT                NXP_SIUL2_PINMUX(2, 2, 195, 4, 0, 0)

/* LPE_LCU */
#define PK0_LPE_LCU0_OUT2               NXP_SIUL2_PINMUX(2, 2, 160, 7, 0, 0)
#define PK2_LPE_LCU0_OUT3               NXP_SIUL2_PINMUX(2, 2, 162, 1, 0, 0)
#define PK3_LPE_LCU0_OUT1               NXP_SIUL2_PINMUX(2, 2, 163, 12, 0, 0)
#define PK4_LPE_LCU0_OUT0               NXP_SIUL2_PINMUX(2, 2, 164, 3, 0, 0)
#define PK7_LPE_LCU0_OUT3               NXP_SIUL2_PINMUX(2, 2, 167, 1, 0, 0)
#define PK8_LPE_LCU0_OUT1               NXP_SIUL2_PINMUX(2, 2, 168, 2, 0, 0)
#define PK9_LPE_LCU0_OUT0               NXP_SIUL2_PINMUX(2, 2, 169, 5, 0, 0)
#define PK10_LPE_LCU0_OUT1              NXP_SIUL2_PINMUX(2, 2, 170, 1, 0, 0)
#define PK13_LPE_LCU0_OUT1              NXP_SIUL2_PINMUX(2, 2, 173, 1, 0, 0)
#define PK14_LPE_LCU0_OUT0              NXP_SIUL2_PINMUX(2, 2, 174, 4, 0, 0)
#define PK15_LPE_LCU0_OUT3              NXP_SIUL2_PINMUX(2, 2, 175, 4, 0, 0)
#define PL0_LPE_LCU0_OUT2               NXP_SIUL2_PINMUX(2, 2, 176, 1, 0, 0)
#define PL1_LPE_LCU0_OUT3               NXP_SIUL2_PINMUX(2, 2, 177, 4, 0, 0)
#define PL2_LPE_LCU0_OUT2               NXP_SIUL2_PINMUX(2, 2, 178, 4, 0, 0)
#define PM0_LPE_LCU0_OUT2               NXP_SIUL2_PINMUX(2, 2, 192, 5, 0, 0)
#define PM3_LPE_LCU0_OUT0               NXP_SIUL2_PINMUX(2, 2, 195, 8, 0, 0)
#define PM6_LPE_LCU0_OUT0               NXP_SIUL2_PINMUX(2, 2, 198, 5, 0, 0)
#define PM7_LPE_LCU0_OUT1               NXP_SIUL2_PINMUX(2, 2, 199, 3, 0, 0)
#define PM8_LPE_LCU0_OUT2               NXP_SIUL2_PINMUX(2, 2, 200, 4, 0, 0)
#define PM9_LPE_LCU0_OUT3               NXP_SIUL2_PINMUX(2, 2, 201, 1, 0, 0)
#define PM10_LPE_LCU0_OUT0              NXP_SIUL2_PINMUX(2, 2, 202, 5, 0, 0)
#define PM11_LPE_LCU0_OUT1              NXP_SIUL2_PINMUX(2, 2, 203, 2, 0, 0)
#define PM14_LPE_LCU0_OUT2              NXP_SIUL2_PINMUX(2, 2, 206, 5, 0, 0)
#define PM15_LPE_LCU0_OUT3              NXP_SIUL2_PINMUX(2, 2, 207, 4, 0, 0)

/* LPE_TRGMUX */
#define PK0_LPE_TRGMUX_OUT7             NXP_SIUL2_PINMUX(2, 2, 160, 8, 0, 0)
#define PK1_LPE_TRGMUX_OUT6             NXP_SIUL2_PINMUX(2, 2, 161, 4, 0, 0)
#define PK2_LPE_TRGMUX_OUT0             NXP_SIUL2_PINMUX(2, 2, 162, 7, 0, 0)
#define PK3_LPE_TRGMUX_OUT1             NXP_SIUL2_PINMUX(2, 2, 163, 6, 0, 0)
#define PK4_LPE_TRGMUX_OUT5             NXP_SIUL2_PINMUX(2, 2, 164, 7, 0, 0)
#define PK5_LPE_TRGMUX_IN0              NXP_SIUL2_PINMUX(2, 2, 165, 0, 92, 1)
#define PK6_LPE_TRGMUX_IN1              NXP_SIUL2_PINMUX(2, 2, 166, 0, 93, 1)
#define PK7_LPE_TRGMUX_OUT4             NXP_SIUL2_PINMUX(2, 2, 167, 6, 0, 0)
#define PK8_LPE_TRGMUX_IN2              NXP_SIUL2_PINMUX(2, 2, 168, 0, 94, 1)
#define PK9_LPE_TRGMUX_IN3              NXP_SIUL2_PINMUX(2, 2, 169, 0, 95, 1)
#define PK10_LPE_TRGMUX_IN4             NXP_SIUL2_PINMUX(2, 2, 170, 0, 97, 1)
#define PK12_LPE_TRGMUX_IN0             NXP_SIUL2_PINMUX(2, 2, 172, 0, 92, 3)
#define PK13_LPE_TRGMUX_IN1             NXP_SIUL2_PINMUX(2, 2, 173, 0, 93, 3)
#define PK14_LPE_TRGMUX_IN7             NXP_SIUL2_PINMUX(2, 2, 174, 0, 100, 3)
#define PK15_LPE_TRGMUX_IN6             NXP_SIUL2_PINMUX(2, 2, 175, 0, 99, 3)
#define PL0_LPE_TRGMUX_IN2              NXP_SIUL2_PINMUX(2, 2, 176, 0, 94, 2)
#define PL1_LPE_TRGMUX_IN3              NXP_SIUL2_PINMUX(2, 2, 177, 0, 95, 2)
#define PL7_LPE_TRGMUX_OUT1             NXP_SIUL2_PINMUX(2, 2, 183, 5, 0, 0)
#define PL8_LPE_TRGMUX_OUT2             NXP_SIUL2_PINMUX(2, 2, 184, 2, 0, 0)
#define PL9_LPE_TRGMUX_OUT6             NXP_SIUL2_PINMUX(2, 2, 185, 2, 0, 0)
#define PL10_LPE_TRGMUX_OUT0            NXP_SIUL2_PINMUX(2, 2, 186, 7, 0, 0)
#define PL11_LPE_TRGMUX_OUT3            NXP_SIUL2_PINMUX(2, 2, 187, 7, 0, 0)
#define PL12_LPE_TRGMUX_OUT7            NXP_SIUL2_PINMUX(2, 2, 188, 3, 0, 0)
#define PL14_LPE_TRGMUX_OUT4            NXP_SIUL2_PINMUX(2, 2, 190, 1, 0, 0)
#define PL15_LPE_TRGMUX_OUT5            NXP_SIUL2_PINMUX(2, 2, 191, 2, 0, 0)
#define PM0_LPE_TRGMUX_IN0              NXP_SIUL2_PINMUX(2, 2, 192, 0, 92, 2)
#define PM1_LPE_TRGMUX_OUT0             NXP_SIUL2_PINMUX(2, 2, 193, 7, 0, 0)
#define PM2_LPE_TRGMUX_IN1              NXP_SIUL2_PINMUX(2, 2, 194, 0, 93, 2)
#define PM3_LPE_TRGMUX_OUT1             NXP_SIUL2_PINMUX(2, 2, 195, 6, 0, 0)
#define PM6_LPE_TRGMUX_OUT5             NXP_SIUL2_PINMUX(2, 2, 198, 8, 0, 0)
#define PM7_LPE_TRGMUX_IN7              NXP_SIUL2_PINMUX(2, 2, 199, 0, 100, 1)
#define PM8_LPE_TRGMUX_IN6              NXP_SIUL2_PINMUX(2, 2, 200, 0, 99, 1)
#define PM9_LPE_TRGMUX_IN5              NXP_SIUL2_PINMUX(2, 2, 201, 0, 98, 1)
#define PM10_LPE_TRGMUX_OUT3            NXP_SIUL2_PINMUX(2, 2, 202, 4, 0, 0)
#define PM11_LPE_TRGMUX_OUT2            NXP_SIUL2_PINMUX(2, 2, 203, 4, 0, 0)
#define PM11_LPE_TRGMUX_IN4             NXP_SIUL2_PINMUX(2, 2, 203, 0, 97, 2)
#define PM12_LPE_TRGMUX_IN6             NXP_SIUL2_PINMUX(2, 2, 204, 0, 99, 2)
#define PM13_LPE_TRGMUX_IN7             NXP_SIUL2_PINMUX(2, 2, 205, 0, 100, 2)
#define PM14_LPE_TRGMUX_IN5             NXP_SIUL2_PINMUX(2, 2, 206, 0, 98, 2)
#define PM15_LPE_TRGMUX_OUT7            NXP_SIUL2_PINMUX(2, 2, 207, 3, 0, 0)

/* LPE_ADC */
#define PK2_LPE_ADC_MA0                 NXP_SIUL2_PINMUX(2, 2, 162, 8, 0, 0)
#define PK4_LPE_ADC_MA1                 NXP_SIUL2_PINMUX(2, 2, 164, 8, 0, 0)
#define PK8_LPE_ADC_MA2                 NXP_SIUL2_PINMUX(2, 2, 168, 5, 0, 0)
#define PL5_LPE_ADC_MA2                 NXP_SIUL2_PINMUX(2, 2, 181, 4, 0, 0)
#define PL6_LPE_ADC_MA0                 NXP_SIUL2_PINMUX(2, 2, 182, 2, 0, 0)
#define PL7_LPE_ADC_MA1                 NXP_SIUL2_PINMUX(2, 2, 183, 1, 0, 0)
#define PL10_LPE_ADC_MA2                NXP_SIUL2_PINMUX(2, 2, 186, 5, 0, 0)
#define PL12_LPE_ADC_MA0                NXP_SIUL2_PINMUX(2, 2, 188, 2, 0, 0)
#define PL13_LPE_ADC_MA1                NXP_SIUL2_PINMUX(2, 2, 189, 5, 0, 0)
#define PL14_LPE_ADC_MA2                NXP_SIUL2_PINMUX(2, 2, 190, 3, 0, 0)
#define PM0_LPE_ADC_MA0                 NXP_SIUL2_PINMUX(2, 2, 192, 8, 0, 0)
#define PM2_LPE_ADC_MA1                 NXP_SIUL2_PINMUX(2, 2, 194, 4, 0, 0)
#define PM3_LPE_ADC_MA2                 NXP_SIUL2_PINMUX(2, 2, 195, 3, 0, 0)

/* JTAG */
#define PK3_JTAG_TDOTRACENOETM_SWO      NXP_SIUL2_PINMUX(2, 2, 163, 7, 0, 0)
#define PK5_JTAG_TMSSWD_DIO_O           NXP_SIUL2_PINMUX(2, 2, 165, 5, 0, 0)
#define PK5_JTAG_TMSSWD_DIO_I           NXP_SIUL2_PINMUX(2, 2, 165, 0, 108, 0)
#define PK6_JTAG_TDI                    NXP_SIUL2_PINMUX(2, 2, 166, 0, 109, 0)

/* LPE_CAN0 */
#define PK3_LPE_CAN0_TX                 NXP_SIUL2_PINMUX(2, 2, 163, 9, 0, 0)
#define PK4_LPE_CAN0_RX                 NXP_SIUL2_PINMUX(2, 2, 164, 0, 63, 1)
#define PK5_LPE_CAN0_TX                 NXP_SIUL2_PINMUX(2, 2, 165, 4, 0, 0)
#define PK6_LPE_CAN0_RX                 NXP_SIUL2_PINMUX(2, 2, 166, 0, 63, 2)
#define PK7_LPE_CAN0_TX                 NXP_SIUL2_PINMUX(2, 2, 167, 10, 0, 0)
#define PK9_LPE_CAN0_RX                 NXP_SIUL2_PINMUX(2, 2, 169, 0, 63, 3)
#define PL1_LPE_CAN0_RX                 NXP_SIUL2_PINMUX(2, 2, 177, 0, 63, 6)
#define PL2_LPE_CAN0_TX                 NXP_SIUL2_PINMUX(2, 2, 178, 7, 0, 0)
#define PL12_LPE_CAN0_RX                NXP_SIUL2_PINMUX(2, 2, 188, 0, 63, 7)
#define PL13_LPE_CAN0_TX                NXP_SIUL2_PINMUX(2, 2, 189, 3, 0, 0)
#define PM0_LPE_CAN0_RX                 NXP_SIUL2_PINMUX(2, 2, 192, 0, 63, 4)
#define PM2_LPE_CAN0_TX                 NXP_SIUL2_PINMUX(2, 2, 194, 9, 0, 0)
#define PM6_LPE_CAN0_TX                 NXP_SIUL2_PINMUX(2, 2, 198, 1, 0, 0)
#define PM8_LPE_CAN0_RX                 NXP_SIUL2_PINMUX(2, 2, 200, 0, 63, 5)

/* CMP0 */
#define PK5_LPE_CMP0_OUT                NXP_SIUL2_PINMUX(2, 2, 165, 2, 0, 0)
#define PK6_LPE_CMP0_OUT                NXP_SIUL2_PINMUX(2, 2, 166, 4, 0, 0)
#define PK6_LPE_CMP0_RRT                NXP_SIUL2_PINMUX(2, 2, 166, 6, 0, 0)
#define PK7_LPE_CMP0_OUT                NXP_SIUL2_PINMUX(2, 2, 167, 5, 0, 0)
#define PK8_LPE_CMP0_RRT                NXP_SIUL2_PINMUX(2, 2, 168, 6, 0, 0)
#define PL5_LPE_CMP0_OUT                NXP_SIUL2_PINMUX(2, 2, 181, 5, 0, 0)
#define PL6_LPE_CMP0_RRT                NXP_SIUL2_PINMUX(2, 2, 182, 1, 0, 0)
#define PL15_LPE_CMP0_RRT               NXP_SIUL2_PINMUX(2, 2, 191, 1, 0, 0)
#define PM0_LPE_CMP0_OUT                NXP_SIUL2_PINMUX(2, 2, 192, 4, 0, 0)
#define PM2_LPE_CMP0_RRT                NXP_SIUL2_PINMUX(2, 2, 194, 5, 0, 0)

/* LPE_LPSPI0 */
#define PK7_LPE_LPSPI0_PCS3_O           NXP_SIUL2_PINMUX(2, 2, 167, 2, 0, 0)
#define PK7_LPE_LPSPI0_PCS3_I           NXP_SIUL2_PINMUX(2, 2, 167, 0, 22, 1)
#define PK8_LPE_LPSPI0_PCS2_O           NXP_SIUL2_PINMUX(2, 2, 168, 1, 0, 0)
#define PK8_LPE_LPSPI0_PCS2_I           NXP_SIUL2_PINMUX(2, 2, 168, 0, 21, 1)
#define PK9_LPE_LPSPI0_PCS1_O           NXP_SIUL2_PINMUX(2, 2, 169, 1, 0, 0)
#define PK9_LPE_LPSPI0_PCS1_I           NXP_SIUL2_PINMUX(2, 2, 169, 0, 20, 1)
#define PK10_LPE_LPSPI0_SCK_O           NXP_SIUL2_PINMUX(2, 2, 170, 3, 0, 0)
#define PK10_LPE_LPSPI0_SCK_I           NXP_SIUL2_PINMUX(2, 2, 170, 0, 23, 1)
#define PK15_LPE_LPSPI0_PCS1_O          NXP_SIUL2_PINMUX(2, 2, 175, 3, 0, 0)
#define PK15_LPE_LPSPI0_PCS1_I          NXP_SIUL2_PINMUX(2, 2, 175, 0, 20, 2)
#define PL0_LPE_LPSPI0_PCS3_O           NXP_SIUL2_PINMUX(2, 2, 176, 3, 0, 0)
#define PL0_LPE_LPSPI0_PCS3_I           NXP_SIUL2_PINMUX(2, 2, 176, 0, 22, 2)
#define PL1_LPE_LPSPI0_PCS2_O           NXP_SIUL2_PINMUX(2, 2, 177, 2, 0, 0)
#define PL1_LPE_LPSPI0_PCS2_I           NXP_SIUL2_PINMUX(2, 2, 177, 0, 21, 2)
#define PL2_LPE_LPSPI0_PCS0_O           NXP_SIUL2_PINMUX(2, 2, 178, 2, 0, 0)
#define PL2_LPE_LPSPI0_PCS0_I           NXP_SIUL2_PINMUX(2, 2, 178, 0, 19, 3)
#define PL3_LPE_LPSPI0_SIN_O            NXP_SIUL2_PINMUX(2, 2, 179, 1, 0, 0)
#define PL3_LPE_LPSPI0_SIN_I            NXP_SIUL2_PINMUX(2, 2, 179, 0, 24, 4)
#define PL4_LPE_LPSPI0_SCK_O            NXP_SIUL2_PINMUX(2, 2, 180, 3, 0, 0)
#define PL4_LPE_LPSPI0_SCK_I            NXP_SIUL2_PINMUX(2, 2, 180, 0, 23, 3)
#define PL5_LPE_LPSPI0_SOUT_O           NXP_SIUL2_PINMUX(2, 2, 181, 3, 0, 0)
#define PL5_LPE_LPSPI0_SOUT_I           NXP_SIUL2_PINMUX(2, 2, 181, 0, 25, 3)
#define PM0_LPE_LPSPI0_SIN_O            NXP_SIUL2_PINMUX(2, 2, 192, 1, 0, 0)
#define PM0_LPE_LPSPI0_SIN_I            NXP_SIUL2_PINMUX(2, 2, 192, 0, 24, 2)
#define PM1_LPE_LPSPI0_PCS0_O           NXP_SIUL2_PINMUX(2, 2, 193, 6, 0, 0)
#define PM1_LPE_LPSPI0_PCS0_I           NXP_SIUL2_PINMUX(2, 2, 193, 0, 19, 1)
#define PM2_LPE_LPSPI0_SOUT_O           NXP_SIUL2_PINMUX(2, 2, 194, 1, 0, 0)
#define PM2_LPE_LPSPI0_SOUT_I           NXP_SIUL2_PINMUX(2, 2, 194, 0, 25, 1)
#define PM6_LPE_LPSPI0_PCS0_O           NXP_SIUL2_PINMUX(2, 2, 198, 7, 0, 0)
#define PM6_LPE_LPSPI0_PCS0_I           NXP_SIUL2_PINMUX(2, 2, 198, 0, 19, 2)
#define PM7_LPE_LPSPI0_SOUT_O           NXP_SIUL2_PINMUX(2, 2, 199, 5, 0, 0)
#define PM7_LPE_LPSPI0_SOUT_I           NXP_SIUL2_PINMUX(2, 2, 199, 0, 25, 2)
#define PM8_LPE_LPSPI0_SCK_O            NXP_SIUL2_PINMUX(2, 2, 200, 6, 0, 0)
#define PM8_LPE_LPSPI0_SCK_I            NXP_SIUL2_PINMUX(2, 2, 200, 0, 23, 2)
#define PM10_LPE_LPSPI0_SIN_O           NXP_SIUL2_PINMUX(2, 2, 202, 3, 0, 0)
#define PM10_LPE_LPSPI0_SIN_I           NXP_SIUL2_PINMUX(2, 2, 202, 0, 24, 3)

/* LPE_LPUART1 */
#define PK8_LPE_LPUART1_RX              NXP_SIUL2_PINMUX(2, 2, 168, 0, 54, 1)
#define PK10_LPE_LPUART1_TX_O           NXP_SIUL2_PINMUX(2, 2, 170, 4, 0, 0)
#define PK10_LPE_LPUART1_TX_I           NXP_SIUL2_PINMUX(2, 2, 170, 0, 53, 1)
#define PK11_LPE_LPUART1_TX_O           NXP_SIUL2_PINMUX(2, 2, 171, 4, 0, 0)
#define PK11_LPE_LPUART1_TX_I           NXP_SIUL2_PINMUX(2, 2, 171, 0, 53, 4)
#define PK12_LPE_LPUART1_RX             NXP_SIUL2_PINMUX(2, 2, 172, 0, 54, 4)
#define PL1_LPE_LPUART1_TX_O            NXP_SIUL2_PINMUX(2, 2, 177, 3, 0, 0)
#define PL1_LPE_LPUART1_TX_I            NXP_SIUL2_PINMUX(2, 2, 177, 0, 53, 5)
#define PL2_LPE_LPUART1_RX              NXP_SIUL2_PINMUX(2, 2, 178, 0, 54, 5)
#define PL13_LPE_LPUART1_TX_O           NXP_SIUL2_PINMUX(2, 2, 189, 1, 0, 0)
#define PL13_LPE_LPUART1_TX_I           NXP_SIUL2_PINMUX(2, 2, 189, 0, 53, 6)
#define PL15_LPE_LPUART1_RX             NXP_SIUL2_PINMUX(2, 2, 191, 0, 54, 6)
#define PM0_LPE_LPUART1_RX              NXP_SIUL2_PINMUX(2, 2, 192, 0, 54, 2)
#define PM2_LPE_LPUART1_TX_O            NXP_SIUL2_PINMUX(2, 2, 194, 8, 0, 0)
#define PM2_LPE_LPUART1_TX_I            NXP_SIUL2_PINMUX(2, 2, 194, 0, 53, 2)
#define PM12_LPE_LPUART1_TX_O           NXP_SIUL2_PINMUX(2, 2, 204, 2, 0, 0)
#define PM12_LPE_LPUART1_TX_I           NXP_SIUL2_PINMUX(2, 2, 204, 0, 53, 3)
#define PM13_LPE_LPUART1_RX             NXP_SIUL2_PINMUX(2, 2, 205, 0, 54, 3)

/* CMP2 */
#define PK10_LPE_CMP2_OUT               NXP_SIUL2_PINMUX(2, 2, 170, 5, 0, 0)
#define PK10_LPE_CMP2_RRT               NXP_SIUL2_PINMUX(2, 2, 170, 6, 0, 0)
#define PL1_LPE_CMP2_RRT                NXP_SIUL2_PINMUX(2, 2, 177, 7, 0, 0)
#define PL2_LPE_CMP2_OUT                NXP_SIUL2_PINMUX(2, 2, 178, 3, 0, 0)
#define PM0_LPE_CMP2_OUT                NXP_SIUL2_PINMUX(2, 2, 192, 3, 0, 0)
#define PM2_LPE_CMP2_RRT                NXP_SIUL2_PINMUX(2, 2, 194, 7, 0, 0)
#define PM6_LPE_CMP2_OUT                NXP_SIUL2_PINMUX(2, 2, 198, 3, 0, 0)
#define PM8_LPE_CMP2_RRT                NXP_SIUL2_PINMUX(2, 2, 200, 2, 0, 0)

