zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPE_CXPI1 */
#define PK11_LPE_CXPI1_TX               NXP_SIUL2_PINMUX(2, 2, 171, 3, 0, 0)
#define PK12_LPE_CXPI1_RX               NXP_SIUL2_PINMUX(2, 2, 172, 0, 102, 4)
#define PL8_LPE_CXPI1_TX                NXP_SIUL2_PINMUX(2, 2, 184, 5, 0, 0)
#define PL9_LPE_CXPI1_RX                NXP_SIUL2_PINMUX(2, 2, 185, 0, 102, 5)
#define PM1_LPE_CXPI1_TX                NXP_SIUL2_PINMUX(2, 2, 193, 5, 0, 0)
#define PM3_LPE_CXPI1_RX                NXP_SIUL2_PINMUX(2, 2, 195, 0, 102, 1)
#define PM8_LPE_CXPI1_TX                NXP_SIUL2_PINMUX(2, 2, 200, 3, 0, 0)
#define PM9_LPE_CXPI1_RX                NXP_SIUL2_PINMUX(2, 2, 201, 0, 102, 2)
#define PM14_LPE_CXPI1_TX               NXP_SIUL2_PINMUX(2, 2, 206, 2, 0, 0)
#define PM15_LPE_CXPI1_RX               NXP_SIUL2_PINMUX(2, 2, 207, 0, 102, 3)

/* LPE_LPUART2 */
#define PK13_LPE_LPUART2_RX             NXP_SIUL2_PINMUX(2, 2, 173, 0, 59, 4)
#define PK14_LPE_LPUART2_TX_O           NXP_SIUL2_PINMUX(2, 2, 174, 1, 0, 0)
#define PK14_LPE_LPUART2_TX_I           NXP_SIUL2_PINMUX(2, 2, 174, 0, 58, 4)
#define PK15_LPE_LPUART2_TX_O           NXP_SIUL2_PINMUX(2, 2, 175, 1, 0, 0)
#define PK15_LPE_LPUART2_TX_I           NXP_SIUL2_PINMUX(2, 2, 175, 0, 58, 5)
#define PL0_LPE_LPUART2_RX              NXP_SIUL2_PINMUX(2, 2, 176, 0, 59, 5)
#define PL6_LPE_LPUART2_RX              NXP_SIUL2_PINMUX(2, 2, 182, 0, 59, 6)
#define PL10_LPE_LPUART2_TX_O           NXP_SIUL2_PINMUX(2, 2, 186, 3, 0, 0)
#define PL10_LPE_LPUART2_TX_I           NXP_SIUL2_PINMUX(2, 2, 186, 0, 58, 6)
#define PM0_LPE_LPUART2_RX              NXP_SIUL2_PINMUX(2, 2, 192, 0, 59, 1)
#define PM1_LPE_LPUART2_TX_O            NXP_SIUL2_PINMUX(2, 2, 193, 3, 0, 0)
#define PM1_LPE_LPUART2_TX_I            NXP_SIUL2_PINMUX(2, 2, 193, 0, 58, 1)
#define PM7_LPE_LPUART2_RX              NXP_SIUL2_PINMUX(2, 2, 199, 0, 59, 2)
#define PM9_LPE_LPUART2_TX_O            NXP_SIUL2_PINMUX(2, 2, 201, 4, 0, 0)
#define PM9_LPE_LPUART2_TX_I            NXP_SIUL2_PINMUX(2, 2, 201, 0, 58, 2)
#define PM10_LPE_LPUART2_TX_O           NXP_SIUL2_PINMUX(2, 2, 202, 1, 0, 0)
#define PM10_LPE_LPUART2_TX_I           NXP_SIUL2_PINMUX(2, 2, 202, 0, 58, 3)
#define PM11_LPE_LPUART2_RX             NXP_SIUL2_PINMUX(2, 2, 203, 0, 59, 3)

/* PG */
#define PM5_EXTWAKE2                    NXP_SIUL2_PINMUX(2, 2, 197, 1, 0, 0)

/* SIUL3 */
#define PN0_SIUL3_EIRQ7                 NXP_SIUL2_PINMUX(3, 3, 208, 0, 7, 1)
#define PN1_SIUL3_EIRQ6                 NXP_SIUL2_PINMUX(3, 3, 209, 0, 6, 1)
#define PN4_SIUL3_EIRQ1                 NXP_SIUL2_PINMUX(3, 3, 212, 0, 1, 1)
#define PN5_SIUL3_EIRQ0                 NXP_SIUL2_PINMUX(3, 3, 213, 0, 0, 1)
#define PN6_SIUL3_EIRQ10                NXP_SIUL2_PINMUX(3, 3, 214, 0, 10, 1)
#define PN8_SIUL3_EIRQ11                NXP_SIUL2_PINMUX(3, 3, 216, 0, 11, 1)
#define PN9_SIUL3_EIRQ12                NXP_SIUL2_PINMUX(3, 3, 217, 0, 12, 1)
#define PN10_SIUL3_EIRQ0                NXP_SIUL2_PINMUX(3, 3, 218, 0, 0, 2)
#define PN11_SIUL3_EIRQ4                NXP_SIUL2_PINMUX(3, 3, 219, 0, 4, 1)
#define PN14_SIUL3_EIRQ1                NXP_SIUL2_PINMUX(3, 3, 222, 0, 1, 2)
#define PN15_SIUL3_EIRQ8                NXP_SIUL2_PINMUX(3, 3, 223, 0, 8, 1)
#define PO0_SIUL3_EIRQ8                 NXP_SIUL2_PINMUX(3, 3, 224, 0, 8, 2)
#define PO2_SIUL3_EIRQ5                 NXP_SIUL2_PINMUX(3, 3, 226, 0, 5, 1)
#define PO3_SIUL3_EIRQ5                 NXP_SIUL2_PINMUX(3, 3, 227, 0, 5, 2)
#define PO4_SIUL3_EIRQ15                NXP_SIUL2_PINMUX(3, 3, 228, 0, 15, 1)
#define PO7_SIUL3_EIRQ2                 NXP_SIUL2_PINMUX(3, 3, 231, 0, 2, 1)
#define PO8_SIUL3_EIRQ4                 NXP_SIUL2_PINMUX(3, 3, 232, 0, 4, 2)
#define PO10_SIUL3_EIRQ3                NXP_SIUL2_PINMUX(3, 3, 234, 0, 3, 1)
#define PO11_SIUL3_EIRQ14               NXP_SIUL2_PINMUX(3, 3, 235, 0, 14, 1)
#define PO14_SIUL3_EIRQ3                NXP_SIUL2_PINMUX(3, 3, 238, 0, 3, 2)
#define PO15_SIUL3_EIRQ6                NXP_SIUL2_PINMUX(3, 3, 239, 0, 6, 2)
#define PP2_SIUL3_EIRQ13                NXP_SIUL2_PINMUX(3, 3, 242, 0, 13, 1)
#define PP3_SIUL3_EIRQ10                NXP_SIUL2_PINMUX(3, 3, 243, 0, 10, 2)
#define PP4_SIUL3_EIRQ9                 NXP_SIUL2_PINMUX(3, 3, 244, 0, 9, 1)
#define PP5_SIUL3_EIRQ9                 NXP_SIUL2_PINMUX(3, 3, 245, 0, 9, 2)
#define PP6_SIUL3_EIRQ2                 NXP_SIUL2_PINMUX(3, 3, 246, 0, 2, 2)
#define PP7_SIUL3_EIRQ7                 NXP_SIUL2_PINMUX(3, 3, 247, 0, 7, 2)
#define PP9_SIUL3_EIRQ0                 NXP_SIUL2_PINMUX(3, 3, 249, 0, 0, 3)
#define PP11_SIUL3_EIRQ1                NXP_SIUL2_PINMUX(3, 3, 251, 0, 1, 3)
#define PP13_SIUL3_EIRQ2                NXP_SIUL2_PINMUX(3, 3, 253, 0, 2, 3)
#define PP14_SIUL3_EIRQ3                NXP_SIUL2_PINMUX(3, 3, 254, 0, 3, 3)
#define PQ0_SIUL3_EIRQ4                 NXP_SIUL2_PINMUX(3, 3, 256, 0, 4, 3)
#define PQ1_SIUL3_EIRQ5                 NXP_SIUL2_PINMUX(3, 3, 257, 0, 5, 3)
#define PQ2_SIUL3_EIRQ11                NXP_SIUL2_PINMUX(3, 3, 258, 0, 11, 2)
#define PQ3_SIUL3_EIRQ6                 NXP_SIUL2_PINMUX(3, 3, 259, 0, 6, 3)
#define PQ4_SIUL3_EIRQ12                NXP_SIUL2_PINMUX(3, 3, 260, 0, 12, 2)
#define PQ5_SIUL3_EIRQ13                NXP_SIUL2_PINMUX(3, 3, 261, 0, 13, 2)
#define PQ6_SIUL3_EIRQ14                NXP_SIUL2_PINMUX(3, 3, 262, 0, 14, 2)
#define PQ7_SIUL3_EIRQ15                NXP_SIUL2_PINMUX(3, 3, 263, 0, 15, 2)

/* LPSPI4 */
#define PN0_LPSPI4_SIN_O                NXP_SIUL2_PINMUX(3, 3, 208, 1, 0, 0)
#define PN0_LPSPI4_SIN_I                NXP_SIUL2_PINMUX(3, 3, 208, 0, 50, 1)
#define PN1_LPSPI4_SCK_O                NXP_SIUL2_PINMUX(3, 3, 209, 4, 0, 0)
#define PN1_LPSPI4_SCK_I                NXP_SIUL2_PINMUX(3, 3, 209, 0, 49, 1)
#define PN5_LPSPI4_SCK_O                NXP_SIUL2_PINMUX(3, 3, 213, 5, 0, 0)
#define PN5_LPSPI4_SCK_I                NXP_SIUL2_PINMUX(3, 3, 213, 0, 49, 2)
#define PN10_LPSPI4_SOUT_O              NXP_SIUL2_PINMUX(3, 3, 218, 3, 0, 0)
#define PN10_LPSPI4_SOUT_I              NXP_SIUL2_PINMUX(3, 3, 218, 0, 51, 1)
#define PN11_LPSPI4_PCS0_O              NXP_SIUL2_PINMUX(3, 3, 219, 3, 0, 0)
#define PN11_LPSPI4_PCS0_I              NXP_SIUL2_PINMUX(3, 3, 219, 0, 45, 1)
#define PN14_LPSPI4_PCS0_O              NXP_SIUL2_PINMUX(3, 3, 222, 7, 0, 0)
#define PN14_LPSPI4_PCS0_I              NXP_SIUL2_PINMUX(3, 3, 222, 0, 45, 2)
#define PN15_LPSPI4_PCS1_O              NXP_SIUL2_PINMUX(3, 3, 223, 11, 0, 0)
#define PN15_LPSPI4_PCS1_I              NXP_SIUL2_PINMUX(3, 3, 223, 0, 46, 1)
#define PO2_LPSPI4_SOUT_O               NXP_SIUL2_PINMUX(3, 3, 226, 2, 0, 0)
#define PO2_LPSPI4_SOUT_I               NXP_SIUL2_PINMUX(3, 3, 226, 0, 51, 2)
#define PO3_LPSPI4_SCK_O                NXP_SIUL2_PINMUX(3, 3, 227, 4, 0, 0)
#define PO3_LPSPI4_SCK_I                NXP_SIUL2_PINMUX(3, 3, 227, 0, 49, 3)
#define PO4_LPSPI4_SIN_O                NXP_SIUL2_PINMUX(3, 3, 228, 3, 0, 0)
#define PO4_LPSPI4_SIN_I                NXP_SIUL2_PINMUX(3, 3, 228, 0, 50, 2)
#define PO9_LPSPI4_PCS1_O               NXP_SIUL2_PINMUX(3, 3, 233, 5, 0, 0)
#define PO9_LPSPI4_PCS1_I               NXP_SIUL2_PINMUX(3, 3, 233, 0, 46, 2)
#define PO10_LPSPI4_PCS0_O              NXP_SIUL2_PINMUX(3, 3, 234, 4, 0, 0)
#define PO10_LPSPI4_PCS0_I              NXP_SIUL2_PINMUX(3, 3, 234, 0, 45, 3)
#define PQ1_LPSPI4_PCS0_O               NXP_SIUL2_PINMUX(3, 3, 257, 8, 0, 0)
#define PQ1_LPSPI4_PCS0_I               NXP_SIUL2_PINMUX(3, 3, 257, 0, 45, 4)
#define PQ2_LPSPI4_SIN_O                NXP_SIUL2_PINMUX(3, 3, 258, 9, 0, 0)
#define PQ2_LPSPI4_SIN_I                NXP_SIUL2_PINMUX(3, 3, 258, 0, 50, 3)
#define PQ3_LPSPI4_PCS1_O               NXP_SIUL2_PINMUX(3, 3, 259, 8, 0, 0)
#define PQ3_LPSPI4_PCS1_I               NXP_SIUL2_PINMUX(3, 3, 259, 0, 46, 3)
#define PQ4_LPSPI4_SOUT_O               NXP_SIUL2_PINMUX(3, 3, 260, 8, 0, 0)
#define PQ4_LPSPI4_SOUT_I               NXP_SIUL2_PINMUX(3, 3, 260, 0, 51, 3)
#define PQ5_LPSPI4_SCK_O                NXP_SIUL2_PINMUX(3, 3, 261, 7, 0, 0)
#define PQ5_LPSPI4_SCK_I                NXP_SIUL2_PINMUX(3, 3, 261, 0, 49, 4)
#define PQ6_LPSPI4_SIN_O                NXP_SIUL2_PINMUX(3, 3, 262, 9, 0, 0)
#define PQ6_LPSPI4_SIN_I                NXP_SIUL2_PINMUX(3, 3, 262, 0, 50, 4)
#define PQ7_LPSPI4_SOUT_O               NXP_SIUL2_PINMUX(3, 3, 263, 6, 0, 0)
#define PQ7_LPSPI4_SOUT_I               NXP_SIUL2_PINMUX(3, 3, 263, 0, 51, 4)

/* TRGMUX */
#define PN0_TRGMUX_OUT0                 NXP_SIUL2_PINMUX(3, 3, 208, 2, 0, 0)
#define PN1_TRGMUX_OUT1                 NXP_SIUL2_PINMUX(3, 3, 209, 3, 0, 0)
#define PN4_TRGMUX_IN2                  NXP_SIUL2_PINMUX(3, 3, 212, 0, 170, 1)
#define PN5_TRGMUX_IN3                  NXP_SIUL2_PINMUX(3, 3, 213, 0, 171, 1)
#define PN6_TRGMUX_IN4                  NXP_SIUL2_PINMUX(3, 3, 214, 0, 172, 1)
#define PN7_TRGMUX_OUT1                 NXP_SIUL2_PINMUX(3, 3, 215, 3, 0, 0)
#define PN8_TRGMUX_OUT3                 NXP_SIUL2_PINMUX(3, 3, 216, 8, 0, 0)
#define PN9_TRGMUX_OUT5                 NXP_SIUL2_PINMUX(3, 3, 217, 4, 0, 0)
#define PN10_TRGMUX_IN2                 NXP_SIUL2_PINMUX(3, 3, 218, 0, 170, 2)
#define PN11_TRGMUX_OUT0                NXP_SIUL2_PINMUX(3, 3, 219, 4, 0, 0)
#define PN14_TRGMUX_OUT3                NXP_SIUL2_PINMUX(3, 3, 222, 1, 0, 0)
#define PN15_TRGMUX_IN5                 NXP_SIUL2_PINMUX(3, 3, 223, 0, 167, 1)
#define PO0_TRGMUX_OUT2                 NXP_SIUL2_PINMUX(3, 3, 224, 10, 0, 0)
#define PO1_TRGMUX_OUT4                 NXP_SIUL2_PINMUX(3, 3, 225, 8, 0, 0)
#define PO2_TRGMUX_IN7                  NXP_SIUL2_PINMUX(3, 3, 226, 0, 175, 2)
#define PO3_TRGMUX_IN3                  NXP_SIUL2_PINMUX(3, 3, 227, 0, 171, 2)
#define PO4_TRGMUX_OUT7                 NXP_SIUL2_PINMUX(3, 3, 228, 6, 0, 0)
#define PO7_TRGMUX_IN7                  NXP_SIUL2_PINMUX(3, 3, 231, 0, 175, 1)
#define PO8_TRGMUX_IN6                  NXP_SIUL2_PINMUX(3, 3, 232, 0, 176, 1)
#define PO9_TRGMUX_IN6                  NXP_SIUL2_PINMUX(3, 3, 233, 0, 176, 2)
#define PO10_TRGMUX_IN5                 NXP_SIUL2_PINMUX(3, 3, 234, 0, 167, 2)
#define PO11_TRGMUX_OUT6                NXP_SIUL2_PINMUX(3, 3, 235, 7, 0, 0)
#define PO12_TRGMUX_IN1                 NXP_SIUL2_PINMUX(3, 3, 236, 0, 174, 1)
#define PO13_TRGMUX_OUT6                NXP_SIUL2_PINMUX(3, 3, 237, 2, 0, 0)
#define PO14_TRGMUX_OUT7                NXP_SIUL2_PINMUX(3, 3, 238, 1, 0, 0)
#define PO15_TRGMUX_IN1                 NXP_SIUL2_PINMUX(3, 3, 239, 0, 174, 2)
#define PP2_TRGMUX_IN0                  NXP_SIUL2_PINMUX(3, 3, 242, 0, 173, 1)
#define PP3_TRGMUX_OUT5                 NXP_SIUL2_PINMUX(3, 3, 243, 5, 0, 0)
#define PP4_TRGMUX_OUT4                 NXP_SIUL2_PINMUX(3, 3, 244, 2, 0, 0)
#define PP5_TRGMUX_OUT2                 NXP_SIUL2_PINMUX(3, 3, 245, 8, 0, 0)
#define PP6_TRGMUX_IN4                  NXP_SIUL2_PINMUX(3, 3, 246, 0, 172, 2)
#define PP7_TRGMUX_IN0                  NXP_SIUL2_PINMUX(3, 3, 247, 0, 173, 2)
#define PP9_TRGMUX_IN4                  NXP_SIUL2_PINMUX(3, 3, 249, 0, 172, 3)
#define PP11_TRGMUX_IN5                 NXP_SIUL2_PINMUX(3, 3, 251, 0, 167, 3)
#define PP13_TRGMUX_IN3                 NXP_SIUL2_PINMUX(3, 3, 253, 0, 171, 3)
#define PP14_TRGMUX_IN2                 NXP_SIUL2_PINMUX(3, 3, 254, 0, 170, 3)
#define PQ0_TRGMUX_OUT0                 NXP_SIUL2_PINMUX(3, 3, 256, 8, 0, 0)
#define PQ0_TRGMUX_IN0                  NXP_SIUL2_PINMUX(3, 3, 256, 0, 173, 3)
#define PQ1_TRGMUX_OUT1                 NXP_SIUL2_PINMUX(3, 3, 257, 3, 0, 0)
#define PQ1_TRGMUX_IN1                  NXP_SIUL2_PINMUX(3, 3, 257, 0, 174, 3)
#define PQ2_TRGMUX_OUT2                 NXP_SIUL2_PINMUX(3, 3, 258, 2, 0, 0)
#define PQ3_TRGMUX_OUT3                 NXP_SIUL2_PINMUX(3, 3, 259, 2, 0, 0)
#define PQ4_TRGMUX_OUT6                 NXP_SIUL2_PINMUX(3, 3, 260, 3, 0, 0)
#define PQ5_TRGMUX_OUT4                 NXP_SIUL2_PINMUX(3, 3, 261, 4, 0, 0)
#define PQ6_TRGMUX_OUT7                 NXP_SIUL2_PINMUX(3, 3, 262, 3, 0, 0)
#define PQ7_TRGMUX_OUT5                 NXP_SIUL2_PINMUX(3, 3, 263, 1, 0, 0)

/* LPUART14 */
#define PN0_LPUART14_TX_O               NXP_SIUL2_PINMUX(3, 3, 208, 3, 0, 0)
#define PN0_LPUART14_TX_I               NXP_SIUL2_PINMUX(3, 3, 208, 0, 69, 1)
#define PN1_LPUART14_RX                 NXP_SIUL2_PINMUX(3, 3, 209, 0, 70, 1)
#define PN8_LPUART14_TX_O               NXP_SIUL2_PINMUX(3, 3, 216, 3, 0, 0)
#define PN8_LPUART14_TX_I               NXP_SIUL2_PINMUX(3, 3, 216, 0, 69, 2)
#define PN9_LPUART14_TX_O               NXP_SIUL2_PINMUX(3, 3, 217, 7, 0, 0)
#define PN9_LPUART14_TX_I               NXP_SIUL2_PINMUX(3, 3, 217, 0, 69, 3)
#define PO1_LPUART14_RX                 NXP_SIUL2_PINMUX(3, 3, 225, 0, 70, 2)
#define PO2_LPUART14_RX                 NXP_SIUL2_PINMUX(3, 3, 226, 0, 70, 3)
#define PP3_LPUART14_TX_O               NXP_SIUL2_PINMUX(3, 3, 243, 1, 0, 0)
#define PP3_LPUART14_TX_I               NXP_SIUL2_PINMUX(3, 3, 243, 0, 69, 4)
#define PP4_LPUART14_RX                 NXP_SIUL2_PINMUX(3, 3, 244, 0, 70, 4)
#define PQ2_LPUART14_RX                 NXP_SIUL2_PINMUX(3, 3, 258, 0, 70, 5)
#define PQ4_LPUART14_TX_O               NXP_SIUL2_PINMUX(3, 3, 260, 1, 0, 0)
#define PQ4_LPUART14_TX_I               NXP_SIUL2_PINMUX(3, 3, 260, 0, 69, 5)

/* EMIOS_0 */
#define PN0_EMIOS0_CH6_G_O              NXP_SIUL2_PINMUX(3, 3, 208, 5, 0, 0)
#define PN0_EMIOS0_CH6_G_I              NXP_SIUL2_PINMUX(3, 3, 208, 0, 131, 2)
#define PN1_EMIOS0_CH14_H_O             NXP_SIUL2_PINMUX(3, 3, 209, 5, 0, 0)
#define PN1_EMIOS0_CH14_H_I             NXP_SIUL2_PINMUX(3, 3, 209, 0, 139, 2)
#define PN4_EMIOS0_CH5_G_O              NXP_SIUL2_PINMUX(3, 3, 212, 4, 0, 0)
#define PN4_EMIOS0_CH5_G_I              NXP_SIUL2_PINMUX(3, 3, 212, 0, 130, 2)
#define PN5_EMIOS0_CH0_X_O              NXP_SIUL2_PINMUX(3, 3, 213, 6, 0, 0)
#define PN5_EMIOS0_CH10_H_O             NXP_SIUL2_PINMUX(3, 3, 213, 7, 0, 0)
#define PN5_EMIOS0_CH0_X_I              NXP_SIUL2_PINMUX(3, 3, 213, 0, 125, 2)
#define PN5_EMIOS0_CH10_H_I             NXP_SIUL2_PINMUX(3, 3, 213, 0, 135, 2)
#define PN6_EMIOS0_CH14_H_O             NXP_SIUL2_PINMUX(3, 3, 214, 2, 0, 0)
#define PN6_EMIOS0_CH14_H_I             NXP_SIUL2_PINMUX(3, 3, 214, 0, 139, 3)
#define PN7_EMIOS0_CH12_H_O             NXP_SIUL2_PINMUX(3, 3, 215, 6, 0, 0)
#define PN7_EMIOS0_CH5_G_O              NXP_SIUL2_PINMUX(3, 3, 215, 8, 0, 0)
#define PN7_EMIOS0_CH5_G_I              NXP_SIUL2_PINMUX(3, 3, 215, 0, 130, 3)
#define PN7_EMIOS0_CH12_H_I             NXP_SIUL2_PINMUX(3, 3, 215, 0, 137, 2)
#define PN8_EMIOS0_CH7_G_O              NXP_SIUL2_PINMUX(3, 3, 216, 4, 0, 0)
#define PN8_EMIOS0_CH7_G_I              NXP_SIUL2_PINMUX(3, 3, 216, 0, 132, 2)
#define PN9_EMIOS0_CH18_Y_O             NXP_SIUL2_PINMUX(3, 3, 217, 5, 0, 0)
#define PN9_EMIOS0_CH21_Y_O             NXP_SIUL2_PINMUX(3, 3, 217, 8, 0, 0)
#define PN9_EMIOS0_CH18_Y_I             NXP_SIUL2_PINMUX(3, 3, 217, 0, 143, 1)
#define PN9_EMIOS0_CH21_Y_I             NXP_SIUL2_PINMUX(3, 3, 217, 0, 146, 2)
#define PN10_EMIOS0_CH15_H_O            NXP_SIUL2_PINMUX(3, 3, 218, 4, 0, 0)
#define PN10_EMIOS0_CH16_X_O            NXP_SIUL2_PINMUX(3, 3, 218, 6, 0, 0)
#define PN10_EMIOS0_CH15_H_I            NXP_SIUL2_PINMUX(3, 3, 218, 0, 140, 2)
#define PN10_EMIOS0_CH16_X_I            NXP_SIUL2_PINMUX(3, 3, 218, 0, 141, 1)
#define PN11_EMIOS0_CH2_G_O             NXP_SIUL2_PINMUX(3, 3, 219, 7, 0, 0)
#define PN11_EMIOS0_CH2_G_I             NXP_SIUL2_PINMUX(3, 3, 219, 0, 127, 2)
#define PN14_EMIOS0_CH9_H_O             NXP_SIUL2_PINMUX(3, 3, 222, 3, 0, 0)
#define PN14_EMIOS0_CH9_H_I             NXP_SIUL2_PINMUX(3, 3, 222, 0, 134, 2)
#define PN15_EMIOS0_CH13_H_O            NXP_SIUL2_PINMUX(3, 3, 223, 1, 0, 0)
#define PN15_EMIOS0_CH8_X_O             NXP_SIUL2_PINMUX(3, 3, 223, 8, 0, 0)
#define PN15_EMIOS0_CH8_X_I             NXP_SIUL2_PINMUX(3, 3, 223, 0, 133, 2)
#define PN15_EMIOS0_CH13_H_I            NXP_SIUL2_PINMUX(3, 3, 223, 0, 138, 2)
#define PO0_EMIOS0_CH7_G_O              NXP_SIUL2_PINMUX(3, 3, 224, 6, 0, 0)
#define PO0_EMIOS0_CH20_Y_O             NXP_SIUL2_PINMUX(3, 3, 224, 9, 0, 0)
#define PO0_EMIOS0_CH7_G_I              NXP_SIUL2_PINMUX(3, 3, 224, 0, 132, 3)
#define PO0_EMIOS0_CH20_Y_I             NXP_SIUL2_PINMUX(3, 3, 224, 0, 145, 2)
#define PO1_EMIOS0_CH18_Y_O             NXP_SIUL2_PINMUX(3, 3, 225, 3, 0, 0)
#define PO1_EMIOS0_CH18_Y_I             NXP_SIUL2_PINMUX(3, 3, 225, 0, 143, 2)
#define PO2_EMIOS0_CH3_G_O              NXP_SIUL2_PINMUX(3, 3, 226, 3, 0, 0)
#define PO2_EMIOS0_CH3_G_I              NXP_SIUL2_PINMUX(3, 3, 226, 0, 128, 2)
#define PO3_EMIOS0_CH1_G_O              NXP_SIUL2_PINMUX(3, 3, 227, 2, 0, 0)
#define PO3_EMIOS0_CH9_H_O              NXP_SIUL2_PINMUX(3, 3, 227, 7, 0, 0)
#define PO3_EMIOS0_CH1_G_I              NXP_SIUL2_PINMUX(3, 3, 227, 0, 126, 2)
#define PO3_EMIOS0_CH9_H_I              NXP_SIUL2_PINMUX(3, 3, 227, 0, 134, 3)
#define PO4_EMIOS0_CH23_X_O             NXP_SIUL2_PINMUX(3, 3, 228, 7, 0, 0)
#define PO4_EMIOS0_CH22_X_O             NXP_SIUL2_PINMUX(3, 3, 228, 10, 0, 0)
#define PO4_EMIOS0_CH22_X_I             NXP_SIUL2_PINMUX(3, 3, 228, 0, 147, 2)
#define PO4_EMIOS0_CH23_X_I             NXP_SIUL2_PINMUX(3, 3, 228, 0, 148, 2)
#define PO7_EMIOS0_CH16_X_O             NXP_SIUL2_PINMUX(3, 3, 231, 2, 0, 0)
#define PO7_EMIOS0_CH15_H_O             NXP_SIUL2_PINMUX(3, 3, 231, 4, 0, 0)
#define PO7_EMIOS0_CH15_H_I             NXP_SIUL2_PINMUX(3, 3, 231, 0, 140, 3)
#define PO7_EMIOS0_CH16_X_I             NXP_SIUL2_PINMUX(3, 3, 231, 0, 141, 3)
#define PO8_EMIOS0_CH10_H_O             NXP_SIUL2_PINMUX(3, 3, 232, 2, 0, 0)
#define PO8_EMIOS0_CH10_H_I             NXP_SIUL2_PINMUX(3, 3, 232, 0, 135, 3)
#define PO9_EMIOS0_CH0_X_O              NXP_SIUL2_PINMUX(3, 3, 233, 3, 0, 0)
#define PO9_EMIOS0_CH0_X_I              NXP_SIUL2_PINMUX(3, 3, 233, 0, 125, 3)
#define PO10_EMIOS0_CH11_H              NXP_SIUL2_PINMUX(3, 3, 234, 0, 136, 2)
#define PO11_EMIOS0_CH22_X_O            NXP_SIUL2_PINMUX(3, 3, 235, 4, 0, 0)
#define PO11_EMIOS0_CH23_X_O            NXP_SIUL2_PINMUX(3, 3, 235, 6, 0, 0)
#define PO11_EMIOS0_CH22_X_I            NXP_SIUL2_PINMUX(3, 3, 235, 0, 147, 3)
#define PO11_EMIOS0_CH23_X_I            NXP_SIUL2_PINMUX(3, 3, 235, 0, 148, 3)
#define PO12_EMIOS0_CH2_G_O             NXP_SIUL2_PINMUX(3, 3, 236, 3, 0, 0)
#define PO12_EMIOS0_CH17_Y_O            NXP_SIUL2_PINMUX(3, 3, 236, 6, 0, 0)
#define PO12_EMIOS0_CH2_G_I             NXP_SIUL2_PINMUX(3, 3, 236, 0, 127, 3)
#define PO12_EMIOS0_CH17_Y_I            NXP_SIUL2_PINMUX(3, 3, 236, 0, 142, 2)
#define PO13_EMIOS0_CH6_G_O             NXP_SIUL2_PINMUX(3, 3, 237, 5, 0, 0)
#define PO13_EMIOS0_CH12_H_O            NXP_SIUL2_PINMUX(3, 3, 237, 8, 0, 0)
#define PO13_EMIOS0_CH6_G_I             NXP_SIUL2_PINMUX(3, 3, 237, 0, 131, 3)
#define PO13_EMIOS0_CH12_H_I            NXP_SIUL2_PINMUX(3, 3, 237, 0, 137, 3)
#define PO14_EMIOS0_CH13_H_O            NXP_SIUL2_PINMUX(3, 3, 238, 3, 0, 0)
#define PO14_EMIOS0_CH13_H_I            NXP_SIUL2_PINMUX(3, 3, 238, 0, 138, 3)
#define PO15_EMIOS0_CH19_Y_O            NXP_SIUL2_PINMUX(3, 3, 239, 1, 0, 0)
#define PO15_EMIOS0_CH19_Y_I            NXP_SIUL2_PINMUX(3, 3, 239, 0, 144, 1)
#define PP0_EMIOS0_CH21_Y_O             NXP_SIUL2_PINMUX(3, 3, 240, 4, 0, 0)
#define PP0_EMIOS0_CH21_Y_I             NXP_SIUL2_PINMUX(3, 3, 240, 0, 146, 1)
#define PP1_EMIOS0_CH4_G_O              NXP_SIUL2_PINMUX(3, 3, 241, 3, 0, 0)
#define PP1_EMIOS0_CH4_G_I              NXP_SIUL2_PINMUX(3, 3, 241, 0, 129, 2)
#define PP2_EMIOS0_CH8_X_O              NXP_SIUL2_PINMUX(3, 3, 242, 5, 0, 0)
#define PP2_EMIOS0_CH8_X_I              NXP_SIUL2_PINMUX(3, 3, 242, 0, 133, 3)
#define PP3_EMIOS0_CH1_G_O              NXP_SIUL2_PINMUX(3, 3, 243, 7, 0, 0)
#define PP3_EMIOS0_CH1_G_I              NXP_SIUL2_PINMUX(3, 3, 243, 0, 126, 3)
#define PP4_EMIOS0_CH20_Y_O             NXP_SIUL2_PINMUX(3, 3, 244, 3, 0, 0)
#define PP4_EMIOS0_CH20_Y_I             NXP_SIUL2_PINMUX(3, 3, 244, 0, 145, 1)
#define PP5_EMIOS0_CH17_Y_O             NXP_SIUL2_PINMUX(3, 3, 245, 5, 0, 0)
#define PP5_EMIOS0_CH17_Y_I             NXP_SIUL2_PINMUX(3, 3, 245, 0, 142, 1)
#define PP6_EMIOS0_CH4_G_O              NXP_SIUL2_PINMUX(3, 3, 246, 1, 0, 0)
#define PP6_EMIOS0_CH19_Y_O             NXP_SIUL2_PINMUX(3, 3, 246, 3, 0, 0)
#define PP6_EMIOS0_CH4_G_I              NXP_SIUL2_PINMUX(3, 3, 246, 0, 129, 3)
#define PP6_EMIOS0_CH19_Y_I             NXP_SIUL2_PINMUX(3, 3, 246, 0, 144, 2)
#define PP7_EMIOS0_CH11_H_O             NXP_SIUL2_PINMUX(3, 3, 247, 2, 0, 0)
#define PP7_EMIOS0_CH3_G_O              NXP_SIUL2_PINMUX(3, 3, 247, 5, 0, 0)
#define PP7_EMIOS0_CH3_G_I              NXP_SIUL2_PINMUX(3, 3, 247, 0, 128, 3)
#define PP7_EMIOS0_CH11_H_I             NXP_SIUL2_PINMUX(3, 3, 247, 0, 136, 3)
#define PP9_EMIOS0_CH18_Y_O             NXP_SIUL2_PINMUX(3, 3, 249, 4, 0, 0)
#define PP9_EMIOS0_CH18_Y_I             NXP_SIUL2_PINMUX(3, 3, 249, 0, 143, 3)
#define PP11_EMIOS0_CH22_X_O            NXP_SIUL2_PINMUX(3, 3, 251, 1, 0, 0)
#define PP11_EMIOS0_CH22_X_I            NXP_SIUL2_PINMUX(3, 3, 251, 0, 147, 4)
#define PP13_EMIOS0_CH8_X_O             NXP_SIUL2_PINMUX(3, 3, 253, 2, 0, 0)
#define PP13_EMIOS0_CH8_X_I             NXP_SIUL2_PINMUX(3, 3, 253, 0, 133, 4)
#define PP14_EMIOS0_CH16_X_O            NXP_SIUL2_PINMUX(3, 3, 254, 2, 0, 0)
#define PP14_EMIOS0_CH16_X_I            NXP_SIUL2_PINMUX(3, 3, 254, 0, 141, 2)
#define PQ0_EMIOS0_CH7_G_O              NXP_SIUL2_PINMUX(3, 3, 256, 3, 0, 0)
#define PQ0_EMIOS0_CH7_G_I              NXP_SIUL2_PINMUX(3, 3, 256, 0, 132, 4)
#define PQ1_EMIOS0_CH5_G_O              NXP_SIUL2_PINMUX(3, 3, 257, 2, 0, 0)
#define PQ1_EMIOS0_CH5_G_I              NXP_SIUL2_PINMUX(3, 3, 257, 0, 130, 4)
#define PQ2_EMIOS0_CH4_G_O              NXP_SIUL2_PINMUX(3, 3, 258, 1, 0, 0)
#define PQ2_EMIOS0_CH4_G_I              NXP_SIUL2_PINMUX(3, 3, 258, 0, 129, 4)
#define PQ3_EMIOS0_CH3_G_O              NXP_SIUL2_PINMUX(3, 3, 259, 1, 0, 0)
#define PQ3_EMIOS0_CH3_G_I              NXP_SIUL2_PINMUX(3, 3, 259, 0, 128, 4)
#define PQ4_EMIOS0_CH2_G_O              NXP_SIUL2_PINMUX(3, 3, 260, 2, 0, 0)
#define PQ4_EMIOS0_CH2_G_I              NXP_SIUL2_PINMUX(3, 3, 260, 0, 127, 4)
#define PQ5_EMIOS0_CH1_G_O              NXP_SIUL2_PINMUX(3, 3, 261, 3, 0, 0)
#define PQ5_EMIOS0_CH1_G_I              NXP_SIUL2_PINMUX(3, 3, 261, 0, 126, 4)
#define PQ6_EMIOS0_CH0_X_O              NXP_SIUL2_PINMUX(3, 3, 262, 2, 0, 0)
#define PQ6_EMIOS0_CH0_X_I              NXP_SIUL2_PINMUX(3, 3, 262, 0, 125, 4)

