zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* FXIO1 */
#define PN0_FXIO1_D24_O                 NXP_SIUL2_PINMUX(3, 3, 208, 6, 0, 0)
#define PN0_FXIO1_D8_O                  NXP_SIUL2_PINMUX(3, 3, 208, 8, 0, 0)
#define PN0_FXIO1_D24_I                 NXP_SIUL2_PINMUX(3, 3, 208, 0, 114, 1)
#define PN0_FXIO1_D8_I                  NXP_SIUL2_PINMUX(3, 3, 208, 0, 98, 1)
#define PN1_FXIO1_D22_O                 NXP_SIUL2_PINMUX(3, 3, 209, 2, 0, 0)
#define PN1_FXIO1_D6_O                  NXP_SIUL2_PINMUX(3, 3, 209, 6, 0, 0)
#define PN1_FXIO1_D22_I                 NXP_SIUL2_PINMUX(3, 3, 209, 0, 112, 1)
#define PN1_FXIO1_D6_I                  NXP_SIUL2_PINMUX(3, 3, 209, 0, 96, 1)
#define PN4_FXIO1_D31_O                 NXP_SIUL2_PINMUX(3, 3, 212, 1, 0, 0)
#define PN4_FXIO1_D15_O                 NXP_SIUL2_PINMUX(3, 3, 212, 5, 0, 0)
#define PN4_FXIO1_D15_I                 NXP_SIUL2_PINMUX(3, 3, 212, 0, 105, 1)
#define PN4_FXIO1_D31_I                 NXP_SIUL2_PINMUX(3, 3, 212, 0, 121, 1)
#define PN5_FXIO1_D0_O                  NXP_SIUL2_PINMUX(3, 3, 213, 4, 0, 0)
#define PN5_FXIO1_D16_O                 NXP_SIUL2_PINMUX(3, 3, 213, 10, 0, 0)
#define PN5_FXIO1_D16_I                 NXP_SIUL2_PINMUX(3, 3, 213, 0, 106, 1)
#define PN5_FXIO1_D0_I                  NXP_SIUL2_PINMUX(3, 3, 213, 0, 90, 1)
#define PN6_FXIO1_D30_O                 NXP_SIUL2_PINMUX(3, 3, 214, 3, 0, 0)
#define PN6_FXIO1_D14_O                 NXP_SIUL2_PINMUX(3, 3, 214, 5, 0, 0)
#define PN6_FXIO1_D14_I                 NXP_SIUL2_PINMUX(3, 3, 214, 0, 104, 1)
#define PN6_FXIO1_D30_I                 NXP_SIUL2_PINMUX(3, 3, 214, 0, 120, 1)
#define PN7_FXIO1_D27_O                 NXP_SIUL2_PINMUX(3, 3, 215, 4, 0, 0)
#define PN7_FXIO1_D11_O                 NXP_SIUL2_PINMUX(3, 3, 215, 7, 0, 0)
#define PN7_FXIO1_D11_I                 NXP_SIUL2_PINMUX(3, 3, 215, 0, 101, 1)
#define PN7_FXIO1_D27_I                 NXP_SIUL2_PINMUX(3, 3, 215, 0, 117, 1)
#define PN8_FXIO1_D26_O                 NXP_SIUL2_PINMUX(3, 3, 216, 2, 0, 0)
#define PN8_FXIO1_D10_O                 NXP_SIUL2_PINMUX(3, 3, 216, 6, 0, 0)
#define PN8_FXIO1_D10_I                 NXP_SIUL2_PINMUX(3, 3, 216, 0, 100, 1)
#define PN8_FXIO1_D26_I                 NXP_SIUL2_PINMUX(3, 3, 216, 0, 116, 1)
#define PN9_FXIO1_D9_O                  NXP_SIUL2_PINMUX(3, 3, 217, 6, 0, 0)
#define PN9_FXIO1_D25_O                 NXP_SIUL2_PINMUX(3, 3, 217, 9, 0, 0)
#define PN9_FXIO1_D25_I                 NXP_SIUL2_PINMUX(3, 3, 217, 0, 115, 1)
#define PN9_FXIO1_D9_I                  NXP_SIUL2_PINMUX(3, 3, 217, 0, 99, 1)
#define PN10_FXIO1_D16_O                NXP_SIUL2_PINMUX(3, 3, 218, 2, 0, 0)
#define PN10_FXIO1_D0_O                 NXP_SIUL2_PINMUX(3, 3, 218, 9, 0, 0)
#define PN10_FXIO1_D16_I                NXP_SIUL2_PINMUX(3, 3, 218, 0, 106, 2)
#define PN10_FXIO1_D0_I                 NXP_SIUL2_PINMUX(3, 3, 218, 0, 90, 2)
#define PN11_FXIO1_D7_O                 NXP_SIUL2_PINMUX(3, 3, 219, 9, 0, 0)
#define PN11_FXIO1_D23_O                NXP_SIUL2_PINMUX(3, 3, 219, 11, 0, 0)
#define PN11_FXIO1_D23_I                NXP_SIUL2_PINMUX(3, 3, 219, 0, 113, 1)
#define PN11_FXIO1_D7_I                 NXP_SIUL2_PINMUX(3, 3, 219, 0, 97, 1)
#define PN14_FXIO1_D26_O                NXP_SIUL2_PINMUX(3, 3, 222, 5, 0, 0)
#define PN14_FXIO1_D10_O                NXP_SIUL2_PINMUX(3, 3, 222, 6, 0, 0)
#define PN14_FXIO1_D10_I                NXP_SIUL2_PINMUX(3, 3, 222, 0, 100, 2)
#define PN14_FXIO1_D26_I                NXP_SIUL2_PINMUX(3, 3, 222, 0, 116, 2)
#define PN15_FXIO1_D28_O                NXP_SIUL2_PINMUX(3, 3, 223, 2, 0, 0)
#define PN15_FXIO1_D12_O                NXP_SIUL2_PINMUX(3, 3, 223, 6, 0, 0)
#define PN15_FXIO1_D12_I                NXP_SIUL2_PINMUX(3, 3, 223, 0, 102, 1)
#define PN15_FXIO1_D28_I                NXP_SIUL2_PINMUX(3, 3, 223, 0, 118, 1)
#define PO0_FXIO1_D29_O                 NXP_SIUL2_PINMUX(3, 3, 224, 1, 0, 0)
#define PO0_FXIO1_D13_O                 NXP_SIUL2_PINMUX(3, 3, 224, 3, 0, 0)
#define PO0_FXIO1_D13_I                 NXP_SIUL2_PINMUX(3, 3, 224, 0, 103, 1)
#define PO0_FXIO1_D29_I                 NXP_SIUL2_PINMUX(3, 3, 224, 0, 119, 1)
#define PO1_FXIO1_D28_O                 NXP_SIUL2_PINMUX(3, 3, 225, 1, 0, 0)
#define PO1_FXIO1_D12_O                 NXP_SIUL2_PINMUX(3, 3, 225, 7, 0, 0)
#define PO1_FXIO1_D12_I                 NXP_SIUL2_PINMUX(3, 3, 225, 0, 102, 2)
#define PO1_FXIO1_D28_I                 NXP_SIUL2_PINMUX(3, 3, 225, 0, 118, 2)
#define PO2_FXIO1_D17_O                 NXP_SIUL2_PINMUX(3, 3, 226, 4, 0, 0)
#define PO2_FXIO1_D1_O                  NXP_SIUL2_PINMUX(3, 3, 226, 8, 0, 0)
#define PO2_FXIO1_D17_I                 NXP_SIUL2_PINMUX(3, 3, 226, 0, 107, 1)
#define PO2_FXIO1_D1_I                  NXP_SIUL2_PINMUX(3, 3, 226, 0, 91, 1)
#define PO3_FXIO1_D27_O                 NXP_SIUL2_PINMUX(3, 3, 227, 5, 0, 0)
#define PO3_FXIO1_D11_O                 NXP_SIUL2_PINMUX(3, 3, 227, 6, 0, 0)
#define PO3_FXIO1_D11_I                 NXP_SIUL2_PINMUX(3, 3, 227, 0, 101, 2)
#define PO3_FXIO1_D27_I                 NXP_SIUL2_PINMUX(3, 3, 227, 0, 117, 2)
#define PO4_FXIO1_D3_O                  NXP_SIUL2_PINMUX(3, 3, 228, 8, 0, 0)
#define PO4_FXIO1_D19_O                 NXP_SIUL2_PINMUX(3, 3, 228, 11, 0, 0)
#define PO4_FXIO1_D19_I                 NXP_SIUL2_PINMUX(3, 3, 228, 0, 109, 1)
#define PO4_FXIO1_D3_I                  NXP_SIUL2_PINMUX(3, 3, 228, 0, 93, 1)
#define PO7_FXIO1_D25_O                 NXP_SIUL2_PINMUX(3, 3, 231, 5, 0, 0)
#define PO7_FXIO1_D9_O                  NXP_SIUL2_PINMUX(3, 3, 231, 7, 0, 0)
#define PO7_FXIO1_D25_I                 NXP_SIUL2_PINMUX(3, 3, 231, 0, 115, 2)
#define PO7_FXIO1_D9_I                  NXP_SIUL2_PINMUX(3, 3, 231, 0, 99, 2)
#define PO8_FXIO1_D13_O                 NXP_SIUL2_PINMUX(3, 3, 232, 4, 0, 0)
#define PO8_FXIO1_D29_O                 NXP_SIUL2_PINMUX(3, 3, 232, 6, 0, 0)
#define PO8_FXIO1_D13_I                 NXP_SIUL2_PINMUX(3, 3, 232, 0, 103, 2)
#define PO8_FXIO1_D29_I                 NXP_SIUL2_PINMUX(3, 3, 232, 0, 119, 2)
#define PO9_FXIO1_D31_O                 NXP_SIUL2_PINMUX(3, 3, 233, 2, 0, 0)
#define PO9_FXIO1_D15_O                 NXP_SIUL2_PINMUX(3, 3, 233, 7, 0, 0)
#define PO9_FXIO1_D15_I                 NXP_SIUL2_PINMUX(3, 3, 233, 0, 105, 2)
#define PO9_FXIO1_D31_I                 NXP_SIUL2_PINMUX(3, 3, 233, 0, 121, 2)
#define PO10_FXIO1_D14_O                NXP_SIUL2_PINMUX(3, 3, 234, 3, 0, 0)
#define PO10_FXIO1_D30_O                NXP_SIUL2_PINMUX(3, 3, 234, 9, 0, 0)
#define PO10_FXIO1_D14_I                NXP_SIUL2_PINMUX(3, 3, 234, 0, 104, 2)
#define PO10_FXIO1_D30_I                NXP_SIUL2_PINMUX(3, 3, 234, 0, 120, 2)
#define PO11_FXIO1_D0_O                 NXP_SIUL2_PINMUX(3, 3, 235, 9, 0, 0)
#define PO11_FXIO1_D16_O                NXP_SIUL2_PINMUX(3, 3, 235, 10, 0, 0)
#define PO11_FXIO1_D16_I                NXP_SIUL2_PINMUX(3, 3, 235, 0, 106, 3)
#define PO11_FXIO1_D0_I                 NXP_SIUL2_PINMUX(3, 3, 235, 0, 90, 3)
#define PO12_FXIO1_D18_O                NXP_SIUL2_PINMUX(3, 3, 236, 4, 0, 0)
#define PO12_FXIO1_D2_O                 NXP_SIUL2_PINMUX(3, 3, 236, 9, 0, 0)
#define PO12_FXIO1_D18_I                NXP_SIUL2_PINMUX(3, 3, 236, 0, 108, 1)
#define PO12_FXIO1_D2_I                 NXP_SIUL2_PINMUX(3, 3, 236, 0, 92, 1)
#define PO13_FXIO1_D8_O                 NXP_SIUL2_PINMUX(3, 3, 237, 6, 0, 0)
#define PO13_FXIO1_D24_O                NXP_SIUL2_PINMUX(3, 3, 237, 9, 0, 0)
#define PO13_FXIO1_D24_I                NXP_SIUL2_PINMUX(3, 3, 237, 0, 114, 2)
#define PO13_FXIO1_D8_I                 NXP_SIUL2_PINMUX(3, 3, 237, 0, 98, 2)
#define PO14_FXIO1_D7_O                 NXP_SIUL2_PINMUX(3, 3, 238, 2, 0, 0)
#define PO14_FXIO1_D23_O                NXP_SIUL2_PINMUX(3, 3, 238, 4, 0, 0)
#define PO14_FXIO1_D23_I                NXP_SIUL2_PINMUX(3, 3, 238, 0, 113, 2)
#define PO14_FXIO1_D7_I                 NXP_SIUL2_PINMUX(3, 3, 238, 0, 97, 2)
#define PO15_FXIO1_D6_O                 NXP_SIUL2_PINMUX(3, 3, 239, 2, 0, 0)
#define PO15_FXIO1_D22_O                NXP_SIUL2_PINMUX(3, 3, 239, 5, 0, 0)
#define PO15_FXIO1_D22_I                NXP_SIUL2_PINMUX(3, 3, 239, 0, 112, 2)
#define PO15_FXIO1_D6_I                 NXP_SIUL2_PINMUX(3, 3, 239, 0, 96, 2)
#define PP0_FXIO1_D5_O                  NXP_SIUL2_PINMUX(3, 3, 240, 3, 0, 0)
#define PP0_FXIO1_D21_O                 NXP_SIUL2_PINMUX(3, 3, 240, 5, 0, 0)
#define PP0_FXIO1_D21_I                 NXP_SIUL2_PINMUX(3, 3, 240, 0, 111, 1)
#define PP0_FXIO1_D5_I                  NXP_SIUL2_PINMUX(3, 3, 240, 0, 95, 1)
#define PP1_FXIO1_D3_O                  NXP_SIUL2_PINMUX(3, 3, 241, 1, 0, 0)
#define PP1_FXIO1_D19_O                 NXP_SIUL2_PINMUX(3, 3, 241, 4, 0, 0)
#define PP1_FXIO1_D19_I                 NXP_SIUL2_PINMUX(3, 3, 241, 0, 109, 2)
#define PP1_FXIO1_D3_I                  NXP_SIUL2_PINMUX(3, 3, 241, 0, 93, 2)
#define PP2_FXIO1_D18_O                 NXP_SIUL2_PINMUX(3, 3, 242, 6, 0, 0)
#define PP2_FXIO1_D2_O                  NXP_SIUL2_PINMUX(3, 3, 242, 8, 0, 0)
#define PP2_FXIO1_D18_I                 NXP_SIUL2_PINMUX(3, 3, 242, 0, 108, 2)
#define PP2_FXIO1_D2_I                  NXP_SIUL2_PINMUX(3, 3, 242, 0, 92, 2)
#define PP3_FXIO1_D21_O                 NXP_SIUL2_PINMUX(3, 3, 243, 2, 0, 0)
#define PP3_FXIO1_D5_O                  NXP_SIUL2_PINMUX(3, 3, 243, 8, 0, 0)
#define PP3_FXIO1_D21_I                 NXP_SIUL2_PINMUX(3, 3, 243, 0, 111, 2)
#define PP3_FXIO1_D5_I                  NXP_SIUL2_PINMUX(3, 3, 243, 0, 95, 2)
#define PP4_FXIO1_D4_O                  NXP_SIUL2_PINMUX(3, 3, 244, 4, 0, 0)
#define PP4_FXIO1_D20_O                 NXP_SIUL2_PINMUX(3, 3, 244, 7, 0, 0)
#define PP4_FXIO1_D20_I                 NXP_SIUL2_PINMUX(3, 3, 244, 0, 110, 1)
#define PP4_FXIO1_D4_I                  NXP_SIUL2_PINMUX(3, 3, 244, 0, 94, 1)
#define PP5_FXIO1_D17_O                 NXP_SIUL2_PINMUX(3, 3, 245, 3, 0, 0)
#define PP5_FXIO1_D1_O                  NXP_SIUL2_PINMUX(3, 3, 245, 9, 0, 0)
#define PP5_FXIO1_D17_I                 NXP_SIUL2_PINMUX(3, 3, 245, 0, 107, 2)
#define PP5_FXIO1_D1_I                  NXP_SIUL2_PINMUX(3, 3, 245, 0, 91, 2)
#define PP7_FXIO1_D20_O                 NXP_SIUL2_PINMUX(3, 3, 247, 4, 0, 0)
#define PP7_FXIO1_D4_O                  NXP_SIUL2_PINMUX(3, 3, 247, 7, 0, 0)
#define PP7_FXIO1_D20_I                 NXP_SIUL2_PINMUX(3, 3, 247, 0, 110, 2)
#define PP7_FXIO1_D4_I                  NXP_SIUL2_PINMUX(3, 3, 247, 0, 94, 2)
#define PP9_FXIO1_D9_O                  NXP_SIUL2_PINMUX(3, 3, 249, 5, 0, 0)
#define PP9_FXIO1_D25_O                 NXP_SIUL2_PINMUX(3, 3, 249, 6, 0, 0)
#define PP9_FXIO1_D25_I                 NXP_SIUL2_PINMUX(3, 3, 249, 0, 115, 3)
#define PP9_FXIO1_D9_I                  NXP_SIUL2_PINMUX(3, 3, 249, 0, 99, 3)
#define PP11_FXIO1_D10_O                NXP_SIUL2_PINMUX(3, 3, 251, 4, 0, 0)
#define PP11_FXIO1_D26_O                NXP_SIUL2_PINMUX(3, 3, 251, 5, 0, 0)
#define PP11_FXIO1_D10_I                NXP_SIUL2_PINMUX(3, 3, 251, 0, 100, 3)
#define PP11_FXIO1_D26_I                NXP_SIUL2_PINMUX(3, 3, 251, 0, 116, 3)
#define PP13_FXIO1_D12_O                NXP_SIUL2_PINMUX(3, 3, 253, 5, 0, 0)
#define PP13_FXIO1_D28_O                NXP_SIUL2_PINMUX(3, 3, 253, 6, 0, 0)
#define PP13_FXIO1_D12_I                NXP_SIUL2_PINMUX(3, 3, 253, 0, 102, 3)
#define PP13_FXIO1_D28_I                NXP_SIUL2_PINMUX(3, 3, 253, 0, 118, 3)
#define PP14_FXIO1_D11_O                NXP_SIUL2_PINMUX(3, 3, 254, 6, 0, 0)
#define PP14_FXIO1_D27_O                NXP_SIUL2_PINMUX(3, 3, 254, 7, 0, 0)
#define PP14_FXIO1_D11_I                NXP_SIUL2_PINMUX(3, 3, 254, 0, 101, 3)
#define PP14_FXIO1_D27_I                NXP_SIUL2_PINMUX(3, 3, 254, 0, 117, 3)
#define PQ0_FXIO1_D8_O                  NXP_SIUL2_PINMUX(3, 3, 256, 6, 0, 0)
#define PQ0_FXIO1_D24_O                 NXP_SIUL2_PINMUX(3, 3, 256, 7, 0, 0)
#define PQ0_FXIO1_D24_I                 NXP_SIUL2_PINMUX(3, 3, 256, 0, 114, 3)
#define PQ0_FXIO1_D8_I                  NXP_SIUL2_PINMUX(3, 3, 256, 0, 98, 3)
#define PQ1_FXIO1_D7_O                  NXP_SIUL2_PINMUX(3, 3, 257, 5, 0, 0)
#define PQ1_FXIO1_D23_O                 NXP_SIUL2_PINMUX(3, 3, 257, 6, 0, 0)
#define PQ1_FXIO1_D23_I                 NXP_SIUL2_PINMUX(3, 3, 257, 0, 113, 3)
#define PQ1_FXIO1_D7_I                  NXP_SIUL2_PINMUX(3, 3, 257, 0, 97, 3)
#define PQ2_FXIO1_D2_O                  NXP_SIUL2_PINMUX(3, 3, 258, 7, 0, 0)
#define PQ2_FXIO1_D18_O                 NXP_SIUL2_PINMUX(3, 3, 258, 8, 0, 0)
#define PQ2_FXIO1_D18_I                 NXP_SIUL2_PINMUX(3, 3, 258, 0, 108, 3)
#define PQ2_FXIO1_D2_I                  NXP_SIUL2_PINMUX(3, 3, 258, 0, 92, 3)
#define PQ3_FXIO1_D6_O                  NXP_SIUL2_PINMUX(3, 3, 259, 4, 0, 0)
#define PQ3_FXIO1_D22_O                 NXP_SIUL2_PINMUX(3, 3, 259, 6, 0, 0)
#define PQ3_FXIO1_D22_I                 NXP_SIUL2_PINMUX(3, 3, 259, 0, 112, 3)
#define PQ3_FXIO1_D6_I                  NXP_SIUL2_PINMUX(3, 3, 259, 0, 96, 3)
#define PQ4_FXIO1_D1_O                  NXP_SIUL2_PINMUX(3, 3, 260, 6, 0, 0)
#define PQ4_FXIO1_D17_O                 NXP_SIUL2_PINMUX(3, 3, 260, 7, 0, 0)
#define PQ4_FXIO1_D17_I                 NXP_SIUL2_PINMUX(3, 3, 260, 0, 107, 3)
#define PQ4_FXIO1_D1_I                  NXP_SIUL2_PINMUX(3, 3, 260, 0, 91, 3)
#define PQ5_FXIO1_D5_O                  NXP_SIUL2_PINMUX(3, 3, 261, 5, 0, 0)
#define PQ5_FXIO1_D21_O                 NXP_SIUL2_PINMUX(3, 3, 261, 6, 0, 0)
#define PQ5_FXIO1_D21_I                 NXP_SIUL2_PINMUX(3, 3, 261, 0, 111, 3)
#define PQ5_FXIO1_D5_I                  NXP_SIUL2_PINMUX(3, 3, 261, 0, 95, 3)
#define PQ6_FXIO1_D4_O                  NXP_SIUL2_PINMUX(3, 3, 262, 7, 0, 0)
#define PQ6_FXIO1_D20_O                 NXP_SIUL2_PINMUX(3, 3, 262, 8, 0, 0)
#define PQ6_FXIO1_D20_I                 NXP_SIUL2_PINMUX(3, 3, 262, 0, 110, 3)
#define PQ6_FXIO1_D4_I                  NXP_SIUL2_PINMUX(3, 3, 262, 0, 94, 3)
#define PQ7_FXIO1_D3_O                  NXP_SIUL2_PINMUX(3, 3, 263, 4, 0, 0)
#define PQ7_FXIO1_D19_O                 NXP_SIUL2_PINMUX(3, 3, 263, 5, 0, 0)
#define PQ7_FXIO1_D19_I                 NXP_SIUL2_PINMUX(3, 3, 263, 0, 109, 3)
#define PQ7_FXIO1_D3_I                  NXP_SIUL2_PINMUX(3, 3, 263, 0, 93, 3)

