zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LCU0 */
#define PN0_LCU0_OUT2                   NXP_SIUL2_PINMUX(3, 3, 208, 7, 0, 0)
#define PN0_LCU0_IN2                    NXP_SIUL2_PINMUX(3, 3, 208, 0, 155, 2)
#define PN1_LCU0_OUT3                   NXP_SIUL2_PINMUX(3, 3, 209, 7, 0, 0)
#define PN1_LCU0_IN3                    NXP_SIUL2_PINMUX(3, 3, 209, 0, 162, 2)
#define PN4_LCU0_OUT1                   NXP_SIUL2_PINMUX(3, 3, 212, 2, 0, 0)
#define PN4_LCU0_IN1                    NXP_SIUL2_PINMUX(3, 3, 212, 0, 152, 2)
#define PN5_LCU0_OUT10                  NXP_SIUL2_PINMUX(3, 3, 213, 2, 0, 0)
#define PN5_LCU0_IN10                   NXP_SIUL2_PINMUX(3, 3, 213, 0, 159, 2)
#define PN6_LCU0_OUT11                  NXP_SIUL2_PINMUX(3, 3, 214, 4, 0, 0)
#define PN6_LCU0_IN11                   NXP_SIUL2_PINMUX(3, 3, 214, 0, 154, 2)
#define PN7_LCU0_OUT10                  NXP_SIUL2_PINMUX(3, 3, 215, 1, 0, 0)
#define PN7_LCU0_IN10                   NXP_SIUL2_PINMUX(3, 3, 215, 0, 159, 3)
#define PN8_LCU0_OUT0                   NXP_SIUL2_PINMUX(3, 3, 216, 5, 0, 0)
#define PN8_LCU0_IN0                    NXP_SIUL2_PINMUX(3, 3, 216, 0, 153, 2)
#define PN9_LCU0_OUT5                   NXP_SIUL2_PINMUX(3, 3, 217, 10, 0, 0)
#define PN9_LCU0_IN5                    NXP_SIUL2_PINMUX(3, 3, 217, 0, 156, 2)
#define PN10_LCU0_OUT0                  NXP_SIUL2_PINMUX(3, 3, 218, 7, 0, 0)
#define PN10_LCU0_IN0                   NXP_SIUL2_PINMUX(3, 3, 218, 0, 153, 3)
#define PN11_LCU0_OUT10                 NXP_SIUL2_PINMUX(3, 3, 219, 8, 0, 0)
#define PN11_LCU0_IN10                  NXP_SIUL2_PINMUX(3, 3, 219, 0, 159, 4)
#define PN14_LCU0_OUT11                 NXP_SIUL2_PINMUX(3, 3, 222, 4, 0, 0)
#define PN14_LCU0_IN11                  NXP_SIUL2_PINMUX(3, 3, 222, 0, 154, 3)
#define PN15_LCU0_OUT8                  NXP_SIUL2_PINMUX(3, 3, 223, 5, 0, 0)
#define PN15_LCU0_IN8                   NXP_SIUL2_PINMUX(3, 3, 223, 0, 160, 2)
#define PO0_LCU0_OUT9                   NXP_SIUL2_PINMUX(3, 3, 224, 4, 0, 0)
#define PO0_LCU0_IN9                    NXP_SIUL2_PINMUX(3, 3, 224, 0, 158, 2)
#define PO1_LCU0_OUT1                   NXP_SIUL2_PINMUX(3, 3, 225, 4, 0, 0)
#define PO1_LCU0_IN1                    NXP_SIUL2_PINMUX(3, 3, 225, 0, 152, 3)
#define PO2_LCU0_OUT4                   NXP_SIUL2_PINMUX(3, 3, 226, 9, 0, 0)
#define PO2_LCU0_IN4                    NXP_SIUL2_PINMUX(3, 3, 226, 0, 163, 2)
#define PO3_LCU0_OUT11                  NXP_SIUL2_PINMUX(3, 3, 227, 8, 0, 0)
#define PO3_LCU0_IN11                   NXP_SIUL2_PINMUX(3, 3, 227, 0, 154, 4)
#define PO4_LCU0_OUT1                   NXP_SIUL2_PINMUX(3, 3, 228, 4, 0, 0)
#define PO4_LCU0_IN1                    NXP_SIUL2_PINMUX(3, 3, 228, 0, 152, 4)
#define PO7_LCU0_OUT3                   NXP_SIUL2_PINMUX(3, 3, 231, 1, 0, 0)
#define PO7_LCU0_IN3                    NXP_SIUL2_PINMUX(3, 3, 231, 0, 162, 3)
#define PO8_LCU0_OUT9                   NXP_SIUL2_PINMUX(3, 3, 232, 3, 0, 0)
#define PO8_LCU0_IN9                    NXP_SIUL2_PINMUX(3, 3, 232, 0, 158, 3)
#define PO9_LCU0_OUT2                   NXP_SIUL2_PINMUX(3, 3, 233, 9, 0, 0)
#define PO9_LCU0_IN2                    NXP_SIUL2_PINMUX(3, 3, 233, 0, 155, 3)
#define PO10_LCU0_OUT8                  NXP_SIUL2_PINMUX(3, 3, 234, 6, 0, 0)
#define PO10_LCU0_IN8                   NXP_SIUL2_PINMUX(3, 3, 234, 0, 160, 3)
#define PO11_LCU0_OUT5                  NXP_SIUL2_PINMUX(3, 3, 235, 8, 0, 0)
#define PO11_LCU0_IN5                   NXP_SIUL2_PINMUX(3, 3, 235, 0, 156, 3)
#define PO12_LCU0_OUT6                  NXP_SIUL2_PINMUX(3, 3, 236, 8, 0, 0)
#define PO12_LCU0_IN6                   NXP_SIUL2_PINMUX(3, 3, 236, 0, 161, 2)
#define PO13_LCU0_OUT7                  NXP_SIUL2_PINMUX(3, 3, 237, 10, 0, 0)
#define PO13_LCU0_IN7                   NXP_SIUL2_PINMUX(3, 3, 237, 0, 157, 2)
#define PO14_LCU0_OUT6                  NXP_SIUL2_PINMUX(3, 3, 238, 7, 0, 0)
#define PO14_LCU0_IN6                   NXP_SIUL2_PINMUX(3, 3, 238, 0, 161, 3)
#define PO15_LCU0_OUT2                  NXP_SIUL2_PINMUX(3, 3, 239, 4, 0, 0)
#define PO15_LCU0_IN2                   NXP_SIUL2_PINMUX(3, 3, 239, 0, 155, 4)
#define PP0_LCU0_OUT8                   NXP_SIUL2_PINMUX(3, 3, 240, 8, 0, 0)
#define PP0_LCU0_IN8                    NXP_SIUL2_PINMUX(3, 3, 240, 0, 160, 4)
#define PP1_LCU0_OUT7                   NXP_SIUL2_PINMUX(3, 3, 241, 2, 0, 0)
#define PP1_LCU0_IN7                    NXP_SIUL2_PINMUX(3, 3, 241, 0, 157, 3)
#define PP2_LCU0_OUT3                   NXP_SIUL2_PINMUX(3, 3, 242, 2, 0, 0)
#define PP2_LCU0_IN3                    NXP_SIUL2_PINMUX(3, 3, 242, 0, 162, 4)
#define PP3_LCU0_OUT9                   NXP_SIUL2_PINMUX(3, 3, 243, 9, 0, 0)
#define PP3_LCU0_IN9                    NXP_SIUL2_PINMUX(3, 3, 243, 0, 158, 4)
#define PP4_LCU0_OUT4                   NXP_SIUL2_PINMUX(3, 3, 244, 9, 0, 0)
#define PP4_LCU0_IN4                    NXP_SIUL2_PINMUX(3, 3, 244, 0, 163, 3)
#define PP5_LCU0_OUT7                   NXP_SIUL2_PINMUX(3, 3, 245, 6, 0, 0)
#define PP5_LCU0_IN7                    NXP_SIUL2_PINMUX(3, 3, 245, 0, 157, 4)
#define PP6_LCU0_OUT6                   NXP_SIUL2_PINMUX(3, 3, 246, 8, 0, 0)
#define PP6_LCU0_IN6                    NXP_SIUL2_PINMUX(3, 3, 246, 0, 161, 4)
#define PP7_LCU0_OUT0                   NXP_SIUL2_PINMUX(3, 3, 247, 9, 0, 0)
#define PP7_LCU0_IN0                    NXP_SIUL2_PINMUX(3, 3, 247, 0, 153, 4)
#define PP9_LCU0_OUT6                   NXP_SIUL2_PINMUX(3, 3, 249, 7, 0, 0)
#define PP9_LCU0_IN6                    NXP_SIUL2_PINMUX(3, 3, 249, 0, 161, 5)
#define PP11_LCU0_OUT7                  NXP_SIUL2_PINMUX(3, 3, 251, 7, 0, 0)
#define PP11_LCU0_IN7                   NXP_SIUL2_PINMUX(3, 3, 251, 0, 157, 5)
#define PP13_LCU0_OUT9                  NXP_SIUL2_PINMUX(3, 3, 253, 7, 0, 0)
#define PP13_LCU0_IN9                   NXP_SIUL2_PINMUX(3, 3, 253, 0, 158, 5)
#define PP14_LCU0_OUT8                  NXP_SIUL2_PINMUX(3, 3, 254, 8, 0, 0)
#define PP14_LCU0_IN8                   NXP_SIUL2_PINMUX(3, 3, 254, 0, 160, 5)
#define PQ0_LCU0_OUT5                   NXP_SIUL2_PINMUX(3, 3, 256, 5, 0, 0)
#define PQ0_LCU0_IN5                    NXP_SIUL2_PINMUX(3, 3, 256, 0, 156, 5)
#define PQ1_LCU0_OUT4                   NXP_SIUL2_PINMUX(3, 3, 257, 9, 0, 0)
#define PQ1_LCU0_IN4                    NXP_SIUL2_PINMUX(3, 3, 257, 0, 163, 5)
#define PQ2_LCU0_OUT5                   NXP_SIUL2_PINMUX(3, 3, 258, 10, 0, 0)
#define PQ2_LCU0_IN5                    NXP_SIUL2_PINMUX(3, 3, 258, 0, 156, 4)
#define PQ3_LCU0_OUT3                   NXP_SIUL2_PINMUX(3, 3, 259, 9, 0, 0)
#define PQ3_LCU0_IN3                    NXP_SIUL2_PINMUX(3, 3, 259, 0, 162, 5)
#define PQ4_LCU0_OUT4                   NXP_SIUL2_PINMUX(3, 3, 260, 9, 0, 0)
#define PQ4_LCU0_IN4                    NXP_SIUL2_PINMUX(3, 3, 260, 0, 163, 4)
#define PQ5_LCU0_OUT2                   NXP_SIUL2_PINMUX(3, 3, 261, 8, 0, 0)
#define PQ5_LCU0_IN2                    NXP_SIUL2_PINMUX(3, 3, 261, 0, 155, 5)
#define PQ6_LCU0_OUT1                   NXP_SIUL2_PINMUX(3, 3, 262, 10, 0, 0)
#define PQ6_LCU0_IN1                    NXP_SIUL2_PINMUX(3, 3, 262, 0, 152, 5)
#define PQ7_LCU0_OUT0                   NXP_SIUL2_PINMUX(3, 3, 263, 7, 0, 0)
#define PQ7_LCU0_IN0                    NXP_SIUL2_PINMUX(3, 3, 263, 0, 153, 5)

