zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* SINC */
#define PN0_SINC_MCLK3                  NXP_SIUL2_PINMUX(3, 3, 208, 0, 193, 1)
#define PN1_SINC_MBIT2                  NXP_SIUL2_PINMUX(3, 3, 209, 0, 188, 1)
#define PN7_SINC_MBIT3                  NXP_SIUL2_PINMUX(3, 3, 215, 0, 189, 1)
#define PN8_SINC_MBIT3                  NXP_SIUL2_PINMUX(3, 3, 216, 0, 189, 2)
#define PN9_SINC_MCLK3                  NXP_SIUL2_PINMUX(3, 3, 217, 0, 193, 2)
#define PN10_SINC_MBIT0                 NXP_SIUL2_PINMUX(3, 3, 218, 0, 186, 1)
#define PN11_SINC_MBIT0                 NXP_SIUL2_PINMUX(3, 3, 219, 0, 186, 2)
#define PO0_SINC_MCLK1_OUT              NXP_SIUL2_PINMUX(3, 3, 224, 11, 0, 0)
#define PO1_SINC_MCLK2_OUT              NXP_SIUL2_PINMUX(3, 3, 225, 5, 0, 0)
#define PO2_SINC_MBIT2                  NXP_SIUL2_PINMUX(3, 3, 226, 0, 188, 2)
#define PO3_SINC_MCLK1_OUT              NXP_SIUL2_PINMUX(3, 3, 227, 9, 0, 0)
#define PO4_SINC_MCLK0_OUT              NXP_SIUL2_PINMUX(3, 3, 228, 9, 0, 0)
#define PO9_SINC_MCLK0_OUT              NXP_SIUL2_PINMUX(3, 3, 233, 8, 0, 0)
#define PO10_SINC_MCLK2_OUT             NXP_SIUL2_PINMUX(3, 3, 234, 10, 0, 0)
#define PO11_SINC_MCLK1                 NXP_SIUL2_PINMUX(3, 3, 235, 0, 191, 1)
#define PO12_SINC_MBIT1                 NXP_SIUL2_PINMUX(3, 3, 236, 0, 187, 1)
#define PP0_SINC_MCLK2                  NXP_SIUL2_PINMUX(3, 3, 240, 0, 192, 1)
#define PP1_SINC_MBIT1                  NXP_SIUL2_PINMUX(3, 3, 241, 0, 187, 2)
#define PP2_SINC_MCLK1                  NXP_SIUL2_PINMUX(3, 3, 242, 0, 191, 2)
#define PP4_SINC_MCLK2                  NXP_SIUL2_PINMUX(3, 3, 244, 0, 192, 2)
#define PP5_SINC_MCLK0                  NXP_SIUL2_PINMUX(3, 3, 245, 0, 190, 1)
#define PP6_SINC_MCLK0                  NXP_SIUL2_PINMUX(3, 3, 246, 0, 190, 2)
#define PP9_SINC_MCLK0_OUT              NXP_SIUL2_PINMUX(3, 3, 249, 1, 0, 0)
#define PP11_SINC_MBIT0                 NXP_SIUL2_PINMUX(3, 3, 251, 0, 186, 3)
#define PP13_SINC_MCLK1                 NXP_SIUL2_PINMUX(3, 3, 253, 0, 191, 3)
#define PP14_SINC_MBIT1                 NXP_SIUL2_PINMUX(3, 3, 254, 0, 187, 3)
#define PQ0_SINC_MCLK1_OUT              NXP_SIUL2_PINMUX(3, 3, 256, 1, 0, 0)
#define PQ1_SINC_MCLK0                  NXP_SIUL2_PINMUX(3, 3, 257, 0, 190, 3)
#define PQ2_SINC_MBIT2                  NXP_SIUL2_PINMUX(3, 3, 258, 0, 188, 3)
#define PQ3_SINC_MCLK2                  NXP_SIUL2_PINMUX(3, 3, 259, 0, 192, 3)
#define PQ4_SINC_MBIT3                  NXP_SIUL2_PINMUX(3, 3, 260, 0, 189, 3)
#define PQ5_SINC_MCLK2_OUT              NXP_SIUL2_PINMUX(3, 3, 261, 2, 0, 0)
#define PQ6_SINC_MCLK3                  NXP_SIUL2_PINMUX(3, 3, 262, 0, 193, 3)

/* LPI2C2 */
#define PN1_LPI2C2_HREQ                 NXP_SIUL2_PINMUX(3, 3, 209, 0, 61, 1)
#define PN7_LPI2C2_SCL_O                NXP_SIUL2_PINMUX(3, 3, 215, 11, 0, 0)
#define PN7_LPI2C2_SCL_I                NXP_SIUL2_PINMUX(3, 3, 215, 0, 62, 1)
#define PN8_LPI2C2_SDA_O                NXP_SIUL2_PINMUX(3, 3, 216, 7, 0, 0)
#define PN8_LPI2C2_SDA_I                NXP_SIUL2_PINMUX(3, 3, 216, 0, 64, 1)
#define PN9_LPI2C2_HREQ                 NXP_SIUL2_PINMUX(3, 3, 217, 0, 61, 2)
#define PN10_LPI2C2_SDA_O               NXP_SIUL2_PINMUX(3, 3, 218, 8, 0, 0)
#define PN10_LPI2C2_SDA_I               NXP_SIUL2_PINMUX(3, 3, 218, 0, 64, 2)
#define PN11_LPI2C2_SCL_O               NXP_SIUL2_PINMUX(3, 3, 219, 1, 0, 0)
#define PN11_LPI2C2_SCL_I               NXP_SIUL2_PINMUX(3, 3, 219, 0, 62, 2)
#define PO3_LPI2C2_SDA_O                NXP_SIUL2_PINMUX(3, 3, 227, 1, 0, 0)
#define PO3_LPI2C2_SDA_I                NXP_SIUL2_PINMUX(3, 3, 227, 0, 64, 3)
#define PO4_LPI2C2_SCL_O                NXP_SIUL2_PINMUX(3, 3, 228, 12, 0, 0)
#define PO4_LPI2C2_SCL_I                NXP_SIUL2_PINMUX(3, 3, 228, 0, 62, 3)
#define PO10_LPI2C2_SCLS_O              NXP_SIUL2_PINMUX(3, 3, 234, 8, 0, 0)
#define PO10_LPI2C2_SCLS_I              NXP_SIUL2_PINMUX(3, 3, 234, 0, 63, 1)
#define PO11_LPI2C2_SDAS_O              NXP_SIUL2_PINMUX(3, 3, 235, 5, 0, 0)
#define PO11_LPI2C2_SDAS_I              NXP_SIUL2_PINMUX(3, 3, 235, 0, 65, 1)
#define PQ0_LPI2C2_HREQ                 NXP_SIUL2_PINMUX(3, 3, 256, 0, 61, 3)
#define PQ1_LPI2C2_SCL_O                NXP_SIUL2_PINMUX(3, 3, 257, 1, 0, 0)
#define PQ1_LPI2C2_SCL_I                NXP_SIUL2_PINMUX(3, 3, 257, 0, 62, 4)
#define PQ3_LPI2C2_SDA_O                NXP_SIUL2_PINMUX(3, 3, 259, 3, 0, 0)
#define PQ3_LPI2C2_SDA_I                NXP_SIUL2_PINMUX(3, 3, 259, 0, 64, 4)
#define PQ5_LPI2C2_HREQ                 NXP_SIUL2_PINMUX(3, 3, 261, 0, 61, 4)
#define PQ6_LPI2C2_SCL_O                NXP_SIUL2_PINMUX(3, 3, 262, 5, 0, 0)
#define PQ6_LPI2C2_SCL_I                NXP_SIUL2_PINMUX(3, 3, 262, 0, 62, 5)
#define PQ7_LPI2C2_SDA_O                NXP_SIUL2_PINMUX(3, 3, 263, 3, 0, 0)
#define PQ7_LPI2C2_SDA_I                NXP_SIUL2_PINMUX(3, 3, 263, 0, 64, 5)

/* MSC1 */
#define PN4_DSPI_MSC1_SCK               NXP_SIUL2_PINMUX(3, 3, 212, 3, 0, 0)
#define PN6_DSPI_MSC1_PCS0              NXP_SIUL2_PINMUX(3, 3, 214, 6, 0, 0)
#define PN7_DSPI_MSC1_PCS0              NXP_SIUL2_PINMUX(3, 3, 215, 10, 0, 0)
#define PN8_DSPI_MSC1_HT                NXP_SIUL2_PINMUX(3, 3, 216, 0, 224, 2)
#define PN9_DSPI_MSC1_SCK               NXP_SIUL2_PINMUX(3, 3, 217, 2, 0, 0)
#define PN10_DSPI_MSC1_PCS1             NXP_SIUL2_PINMUX(3, 3, 218, 5, 0, 0)
#define PN11_DSPI_MSC1_PCS0             NXP_SIUL2_PINMUX(3, 3, 219, 5, 0, 0)
#define PN15_DSPI_MSC1_HT               NXP_SIUL2_PINMUX(3, 3, 223, 0, 224, 3)
#define PO0_DSPI_MSC1_PCS1              NXP_SIUL2_PINMUX(3, 3, 224, 8, 0, 0)
#define PO1_DSPI_MSC1_SIN               NXP_SIUL2_PINMUX(3, 3, 225, 0, 223, 1)
#define PO2_DSPI_MSC1_SOUT              NXP_SIUL2_PINMUX(3, 3, 226, 6, 0, 0)
#define PO15_DSPI_MSC1_SIN              NXP_SIUL2_PINMUX(3, 3, 239, 0, 223, 2)
#define PP7_DSPI_MSC1_SOUT              NXP_SIUL2_PINMUX(3, 3, 247, 3, 0, 0)
#define PQ1_DSPI_MSC1_PCS0              NXP_SIUL2_PINMUX(3, 3, 257, 4, 0, 0)
#define PQ4_DSPI_MSC1_PCS1              NXP_SIUL2_PINMUX(3, 3, 260, 5, 0, 0)
#define PQ5_DSPI_MSC1_SIN               NXP_SIUL2_PINMUX(3, 3, 261, 0, 223, 3)
#define PQ6_DSPI_MSC1_SOUT              NXP_SIUL2_PINMUX(3, 3, 262, 4, 0, 0)
#define PQ7_DSPI_MSC1_SCK               NXP_SIUL2_PINMUX(3, 3, 263, 2, 0, 0)

/* LPSPI3 */
#define PN4_LPSPI3_PCS3_O               NXP_SIUL2_PINMUX(3, 3, 212, 6, 0, 0)
#define PN4_LPSPI3_PCS3_I               NXP_SIUL2_PINMUX(3, 3, 212, 0, 38, 1)
#define PN6_LPSPI3_PCS2_O               NXP_SIUL2_PINMUX(3, 3, 214, 1, 0, 0)
#define PN6_LPSPI3_PCS2_I               NXP_SIUL2_PINMUX(3, 3, 214, 0, 37, 2)
#define PN7_LPSPI3_SIN_O                NXP_SIUL2_PINMUX(3, 3, 215, 5, 0, 0)
#define PN7_LPSPI3_SIN_I                NXP_SIUL2_PINMUX(3, 3, 215, 0, 40, 1)
#define PN8_LPSPI3_PCS1_O               NXP_SIUL2_PINMUX(3, 3, 216, 1, 0, 0)
#define PN8_LPSPI3_PCS1_I               NXP_SIUL2_PINMUX(3, 3, 216, 0, 36, 1)
#define PN9_LPSPI3_PCS3_O               NXP_SIUL2_PINMUX(3, 3, 217, 3, 0, 0)
#define PN9_LPSPI3_PCS3_I               NXP_SIUL2_PINMUX(3, 3, 217, 0, 38, 2)
#define PO0_LPSPI3_SOUT_O               NXP_SIUL2_PINMUX(3, 3, 224, 2, 0, 0)
#define PO0_LPSPI3_SOUT_I               NXP_SIUL2_PINMUX(3, 3, 224, 0, 41, 1)
#define PO1_LPSPI3_SCK_O                NXP_SIUL2_PINMUX(3, 3, 225, 2, 0, 0)
#define PO1_LPSPI3_SCK_I                NXP_SIUL2_PINMUX(3, 3, 225, 0, 39, 1)
#define PO7_LPSPI3_SOUT_O               NXP_SIUL2_PINMUX(3, 3, 231, 3, 0, 0)
#define PO7_LPSPI3_SOUT_I               NXP_SIUL2_PINMUX(3, 3, 231, 0, 41, 2)
#define PO8_LPSPI3_PCS0_O               NXP_SIUL2_PINMUX(3, 3, 232, 7, 0, 0)
#define PO8_LPSPI3_PCS0_I               NXP_SIUL2_PINMUX(3, 3, 232, 0, 35, 1)
#define PO11_LPSPI3_SIN_O               NXP_SIUL2_PINMUX(3, 3, 235, 2, 0, 0)
#define PO11_LPSPI3_SIN_I               NXP_SIUL2_PINMUX(3, 3, 235, 0, 40, 3)
#define PO12_LPSPI3_SOUT_O              NXP_SIUL2_PINMUX(3, 3, 236, 2, 0, 0)
#define PO12_LPSPI3_SOUT_I              NXP_SIUL2_PINMUX(3, 3, 236, 0, 41, 3)
#define PO13_LPSPI3_SIN_O               NXP_SIUL2_PINMUX(3, 3, 237, 7, 0, 0)
#define PO13_LPSPI3_SIN_I               NXP_SIUL2_PINMUX(3, 3, 237, 0, 40, 2)
#define PO14_LPSPI3_SCK_O               NXP_SIUL2_PINMUX(3, 3, 238, 6, 0, 0)
#define PO14_LPSPI3_SCK_I               NXP_SIUL2_PINMUX(3, 3, 238, 0, 39, 2)
#define PO15_LPSPI3_PCS1_O              NXP_SIUL2_PINMUX(3, 3, 239, 3, 0, 0)
#define PO15_LPSPI3_PCS1_I              NXP_SIUL2_PINMUX(3, 3, 239, 0, 36, 2)
#define PP0_LPSPI3_PCS0_O               NXP_SIUL2_PINMUX(3, 3, 240, 9, 0, 0)
#define PP0_LPSPI3_PCS0_I               NXP_SIUL2_PINMUX(3, 3, 240, 0, 35, 2)
#define PP1_LPSPI3_PCS0_O               NXP_SIUL2_PINMUX(3, 3, 241, 5, 0, 0)
#define PP1_LPSPI3_PCS0_I               NXP_SIUL2_PINMUX(3, 3, 241, 0, 35, 3)
#define PP2_LPSPI3_PCS2_O               NXP_SIUL2_PINMUX(3, 3, 242, 9, 0, 0)
#define PP2_LPSPI3_PCS2_I               NXP_SIUL2_PINMUX(3, 3, 242, 0, 37, 3)
#define PP3_LPSPI3_PCS3_O               NXP_SIUL2_PINMUX(3, 3, 243, 6, 0, 0)
#define PP3_LPSPI3_PCS3_I               NXP_SIUL2_PINMUX(3, 3, 243, 0, 38, 3)
#define PP4_LPSPI3_PCS1_O               NXP_SIUL2_PINMUX(3, 3, 244, 8, 0, 0)
#define PP4_LPSPI3_PCS1_I               NXP_SIUL2_PINMUX(3, 3, 244, 0, 36, 3)
#define PP5_LPSPI3_SCK_O                NXP_SIUL2_PINMUX(3, 3, 245, 4, 0, 0)
#define PP5_LPSPI3_SCK_I                NXP_SIUL2_PINMUX(3, 3, 245, 0, 39, 3)
#define PP7_LPSPI3_PCS2_O               NXP_SIUL2_PINMUX(3, 3, 247, 8, 0, 0)
#define PP7_LPSPI3_PCS2_I               NXP_SIUL2_PINMUX(3, 3, 247, 0, 37, 1)
#define PP9_LPSPI3_SIN_O                NXP_SIUL2_PINMUX(3, 3, 249, 3, 0, 0)
#define PP9_LPSPI3_SIN_I                NXP_SIUL2_PINMUX(3, 3, 249, 0, 40, 4)
#define PP11_LPSPI3_SOUT_O              NXP_SIUL2_PINMUX(3, 3, 251, 6, 0, 0)
#define PP11_LPSPI3_SOUT_I              NXP_SIUL2_PINMUX(3, 3, 251, 0, 41, 4)
#define PP13_LPSPI3_PCS2_O              NXP_SIUL2_PINMUX(3, 3, 253, 1, 0, 0)
#define PP13_LPSPI3_PCS2_I              NXP_SIUL2_PINMUX(3, 3, 253, 0, 37, 4)
#define PP14_LPSPI3_PCS3_O              NXP_SIUL2_PINMUX(3, 3, 254, 1, 0, 0)
#define PP14_LPSPI3_PCS3_I              NXP_SIUL2_PINMUX(3, 3, 254, 0, 38, 4)
#define PQ0_LPSPI3_SCK_O                NXP_SIUL2_PINMUX(3, 3, 256, 2, 0, 0)
#define PQ0_LPSPI3_SCK_I                NXP_SIUL2_PINMUX(3, 3, 256, 0, 39, 4)
#define PQ1_LPSPI3_PCS0_O               NXP_SIUL2_PINMUX(3, 3, 257, 7, 0, 0)
#define PQ1_LPSPI3_PCS0_I               NXP_SIUL2_PINMUX(3, 3, 257, 0, 35, 4)
#define PQ3_LPSPI3_PCS1_O               NXP_SIUL2_PINMUX(3, 3, 259, 7, 0, 0)
#define PQ3_LPSPI3_PCS1_I               NXP_SIUL2_PINMUX(3, 3, 259, 0, 36, 4)

