zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPI2C1 */
#define PN4_LPI2C1_HREQ                 NXP_SIUL2_PINMUX(3, 3, 212, 0, 53, 1)
#define PN5_LPI2C1_SDA_O                NXP_SIUL2_PINMUX(3, 3, 213, 8, 0, 0)
#define PN5_LPI2C1_SDA_I                NXP_SIUL2_PINMUX(3, 3, 213, 0, 56, 1)
#define PN14_LPI2C1_SCLS_O              NXP_SIUL2_PINMUX(3, 3, 222, 2, 0, 0)
#define PN14_LPI2C1_SCLS_I              NXP_SIUL2_PINMUX(3, 3, 222, 0, 55, 1)
#define PN15_LPI2C1_SDAS_O              NXP_SIUL2_PINMUX(3, 3, 223, 10, 0, 0)
#define PN15_LPI2C1_SDAS_I              NXP_SIUL2_PINMUX(3, 3, 223, 0, 57, 1)
#define PO0_LPI2C1_HREQ                 NXP_SIUL2_PINMUX(3, 3, 224, 0, 53, 2)
#define PO1_LPI2C1_SDA_O                NXP_SIUL2_PINMUX(3, 3, 225, 6, 0, 0)
#define PO1_LPI2C1_SDA_I                NXP_SIUL2_PINMUX(3, 3, 225, 0, 56, 2)
#define PO2_LPI2C1_SCL_O                NXP_SIUL2_PINMUX(3, 3, 226, 5, 0, 0)
#define PO2_LPI2C1_SCL_I                NXP_SIUL2_PINMUX(3, 3, 226, 0, 54, 1)
#define PO9_LPI2C1_SCL_O                NXP_SIUL2_PINMUX(3, 3, 233, 4, 0, 0)
#define PO9_LPI2C1_SCL_I                NXP_SIUL2_PINMUX(3, 3, 233, 0, 54, 2)
#define PO15_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(3, 3, 239, 7, 0, 0)
#define PO15_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(3, 3, 239, 0, 54, 3)
#define PP0_LPI2C1_SDAS_O               NXP_SIUL2_PINMUX(3, 3, 240, 7, 0, 0)
#define PP0_LPI2C1_SDAS_I               NXP_SIUL2_PINMUX(3, 3, 240, 0, 57, 2)
#define PP1_LPI2C1_HREQ                 NXP_SIUL2_PINMUX(3, 3, 241, 0, 53, 3)
#define PP2_LPI2C1_SDA_O                NXP_SIUL2_PINMUX(3, 3, 242, 4, 0, 0)
#define PP2_LPI2C1_SDA_I                NXP_SIUL2_PINMUX(3, 3, 242, 0, 56, 3)
#define PP6_LPI2C1_SCLS_O               NXP_SIUL2_PINMUX(3, 3, 246, 2, 0, 0)
#define PP6_LPI2C1_SCLS_I               NXP_SIUL2_PINMUX(3, 3, 246, 0, 55, 2)
#define PP7_LPI2C1_SDA_O                NXP_SIUL2_PINMUX(3, 3, 247, 6, 0, 0)
#define PP7_LPI2C1_SDA_I                NXP_SIUL2_PINMUX(3, 3, 247, 0, 56, 4)
#define PP9_LPI2C1_HREQ                 NXP_SIUL2_PINMUX(3, 3, 249, 0, 53, 5)
#define PP13_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(3, 3, 253, 8, 0, 0)
#define PP13_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(3, 3, 253, 0, 54, 5)
#define PP14_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(3, 3, 254, 3, 0, 0)
#define PP14_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(3, 3, 254, 0, 56, 5)
#define PQ2_LPI2C1_SCL_O                NXP_SIUL2_PINMUX(3, 3, 258, 6, 0, 0)
#define PQ2_LPI2C1_SCL_I                NXP_SIUL2_PINMUX(3, 3, 258, 0, 54, 4)
#define PQ4_LPI2C1_HREQ                 NXP_SIUL2_PINMUX(3, 3, 260, 0, 53, 4)

/* LPUART15 */
#define PN5_LPUART15_TX_O               NXP_SIUL2_PINMUX(3, 3, 213, 3, 0, 0)
#define PN5_LPUART15_TX_I               NXP_SIUL2_PINMUX(3, 3, 213, 0, 74, 1)
#define PN6_LPUART15_RX                 NXP_SIUL2_PINMUX(3, 3, 214, 0, 75, 1)
#define PN11_LPUART15_TX_O              NXP_SIUL2_PINMUX(3, 3, 219, 6, 0, 0)
#define PN11_LPUART15_TX_I              NXP_SIUL2_PINMUX(3, 3, 219, 0, 74, 2)
#define PN14_LPUART15_RX                NXP_SIUL2_PINMUX(3, 3, 222, 0, 75, 2)
#define PN15_LPUART15_TX_O              NXP_SIUL2_PINMUX(3, 3, 223, 7, 0, 0)
#define PN15_LPUART15_TX_I              NXP_SIUL2_PINMUX(3, 3, 223, 0, 74, 3)
#define PO3_LPUART15_RX                 NXP_SIUL2_PINMUX(3, 3, 227, 0, 75, 3)
#define PO4_LPUART15_TX_O               NXP_SIUL2_PINMUX(3, 3, 228, 2, 0, 0)
#define PO4_LPUART15_TX_I               NXP_SIUL2_PINMUX(3, 3, 228, 0, 74, 4)
#define PO11_LPUART15_RX                NXP_SIUL2_PINMUX(3, 3, 235, 0, 75, 4)
#define PO12_LPUART15_RX                NXP_SIUL2_PINMUX(3, 3, 236, 0, 75, 5)
#define PP4_LPUART15_TX_O               NXP_SIUL2_PINMUX(3, 3, 244, 1, 0, 0)
#define PP4_LPUART15_TX_I               NXP_SIUL2_PINMUX(3, 3, 244, 0, 74, 5)
#define PP5_LPUART15_TX_O               NXP_SIUL2_PINMUX(3, 3, 245, 1, 0, 0)
#define PP5_LPUART15_TX_I               NXP_SIUL2_PINMUX(3, 3, 245, 0, 74, 6)
#define PP9_LPUART15_RX                 NXP_SIUL2_PINMUX(3, 3, 249, 0, 75, 6)
#define PP11_LPUART15_TX_O              NXP_SIUL2_PINMUX(3, 3, 251, 3, 0, 0)
#define PP11_LPUART15_TX_I              NXP_SIUL2_PINMUX(3, 3, 251, 0, 74, 7)
#define PQ3_LPUART15_TX_O               NXP_SIUL2_PINMUX(3, 3, 259, 5, 0, 0)
#define PQ3_LPUART15_TX_I               NXP_SIUL2_PINMUX(3, 3, 259, 0, 74, 8)
#define PQ5_LPUART15_RX                 NXP_SIUL2_PINMUX(3, 3, 261, 0, 75, 7)

/* MSC0 */
#define PN5_DSPI_MSC0_PCS0              NXP_SIUL2_PINMUX(3, 3, 213, 9, 0, 0)
#define PN6_DSPI_MSC0_HT                NXP_SIUL2_PINMUX(3, 3, 214, 0, 220, 2)
#define PN14_LPUART21_RX                NXP_SIUL2_PINMUX(3, 3, 222, 0, 227, 2)
#define PN15_DSPI_MSC0_PCS1             NXP_SIUL2_PINMUX(3, 3, 223, 9, 0, 0)
#define PO7_DSPI_MSC0_SIN               NXP_SIUL2_PINMUX(3, 3, 231, 0, 219, 1)
#define PO9_DSPI_MSC0_SCK               NXP_SIUL2_PINMUX(3, 3, 233, 6, 0, 0)
#define PO10_DSPI_MSC0_PCS0             NXP_SIUL2_PINMUX(3, 3, 234, 5, 0, 0)
#define PO13_DSPI_MSC0_SCK              NXP_SIUL2_PINMUX(3, 3, 237, 4, 0, 0)
#define PO14_DSPI_MSC0_SOUT             NXP_SIUL2_PINMUX(3, 3, 238, 5, 0, 0)
#define PP1_DSPI_MSC0_SOUT              NXP_SIUL2_PINMUX(3, 3, 241, 6, 0, 0)
#define PP2_DSPI_MSC0_SIN               NXP_SIUL2_PINMUX(3, 3, 242, 0, 219, 2)
#define PP3_DSPI_MSC0_PCS1              NXP_SIUL2_PINMUX(3, 3, 243, 4, 0, 0)
#define PP6_LPUART21_RX                 NXP_SIUL2_PINMUX(3, 3, 246, 0, 227, 1)
#define PP9_LPUART21_RX                 NXP_SIUL2_PINMUX(3, 3, 249, 0, 227, 3)
#define PP11_DSPI_MSC0_SIN              NXP_SIUL2_PINMUX(3, 3, 251, 0, 219, 3)
#define PP13_DSPI_MSC0_SCK              NXP_SIUL2_PINMUX(3, 3, 253, 3, 0, 0)
#define PP14_DSPI_MSC0_SOUT             NXP_SIUL2_PINMUX(3, 3, 254, 4, 0, 0)
#define PQ0_DSPI_MSC0_PCS0              NXP_SIUL2_PINMUX(3, 3, 256, 4, 0, 0)
#define PQ1_DSPI_MSC0_HT                NXP_SIUL2_PINMUX(3, 3, 257, 0, 220, 3)
#define PQ2_DSPI_MSC0_PCS1              NXP_SIUL2_PINMUX(3, 3, 258, 4, 0, 0)

/* ADC0 */
#define PN7_ADC0_MA2                    NXP_SIUL2_PINMUX(3, 3, 215, 9, 0, 0)
#define PO0_ADC0_MA1                    NXP_SIUL2_PINMUX(3, 3, 224, 7, 0, 0)
#define PO7_ADC0_MA2                    NXP_SIUL2_PINMUX(3, 3, 231, 6, 0, 0)
#define PO15_ADC0_MA2                   NXP_SIUL2_PINMUX(3, 3, 239, 6, 0, 0)
#define PP0_ADC0_MA0                    NXP_SIUL2_PINMUX(3, 3, 240, 2, 0, 0)
#define PP14_ADC0_MA2                   NXP_SIUL2_PINMUX(3, 3, 254, 5, 0, 0)
#define PQ2_ADC0_MA1                    NXP_SIUL2_PINMUX(3, 3, 258, 3, 0, 0)
#define PQ4_ADC0_MA0                    NXP_SIUL2_PINMUX(3, 3, 260, 4, 0, 0)
#define PQ5_ADC0_MA1                    NXP_SIUL2_PINMUX(3, 3, 261, 1, 0, 0)
#define PQ6_ADC0_MA2                    NXP_SIUL2_PINMUX(3, 3, 262, 1, 0, 0)

/* LPUART16 */
#define PN15_LPUART16_TX_O              NXP_SIUL2_PINMUX(3, 3, 223, 3, 0, 0)
#define PN15_LPUART16_TX_I              NXP_SIUL2_PINMUX(3, 3, 223, 0, 80, 1)
#define PO0_LPUART16_RX                 NXP_SIUL2_PINMUX(3, 3, 224, 0, 79, 1)
#define PO8_LPUART16_RX                 NXP_SIUL2_PINMUX(3, 3, 232, 0, 79, 2)
#define PO9_LPUART16_RX                 NXP_SIUL2_PINMUX(3, 3, 233, 0, 79, 3)
#define PO13_LPUART16_TX_O              NXP_SIUL2_PINMUX(3, 3, 237, 3, 0, 0)
#define PO13_LPUART16_TX_I              NXP_SIUL2_PINMUX(3, 3, 237, 0, 80, 2)
#define PO14_LPUART16_RX                NXP_SIUL2_PINMUX(3, 3, 238, 0, 79, 4)
#define PP0_LPUART16_TX_O               NXP_SIUL2_PINMUX(3, 3, 240, 6, 0, 0)
#define PP0_LPUART16_TX_I               NXP_SIUL2_PINMUX(3, 3, 240, 0, 80, 3)
#define PP2_LPUART16_TX_O               NXP_SIUL2_PINMUX(3, 3, 242, 7, 0, 0)
#define PP2_LPUART16_TX_I               NXP_SIUL2_PINMUX(3, 3, 242, 0, 80, 4)
#define PP13_LPUART16_TX_O              NXP_SIUL2_PINMUX(3, 3, 253, 4, 0, 0)
#define PP13_LPUART16_TX_I              NXP_SIUL2_PINMUX(3, 3, 253, 0, 80, 5)
#define PP14_LPUART16_RX                NXP_SIUL2_PINMUX(3, 3, 254, 0, 79, 5)
#define PQ6_LPUART16_TX_O               NXP_SIUL2_PINMUX(3, 3, 262, 6, 0, 0)
#define PQ6_LPUART16_TX_I               NXP_SIUL2_PINMUX(3, 3, 262, 0, 80, 6)
#define PQ7_LPUART16_RX                 NXP_SIUL2_PINMUX(3, 3, 263, 0, 79, 6)

/* SIUL4 */
#define PT0_SIUL4_EIRQ5                 NXP_SIUL2_PINMUX(4, 4, 304, 0, 5, 1)
#define PT1_SIUL4_EIRQ4                 NXP_SIUL2_PINMUX(4, 4, 305, 0, 4, 1)
#define PT2_SIUL4_EIRQ0                 NXP_SIUL2_PINMUX(4, 4, 306, 0, 0, 1)
#define PT3_SIUL4_EIRQ14                NXP_SIUL2_PINMUX(4, 4, 307, 0, 14, 1)
#define PT4_SIUL4_EIRQ10                NXP_SIUL2_PINMUX(4, 4, 308, 0, 10, 1)
#define PT6_SIUL4_EIRQ11                NXP_SIUL2_PINMUX(4, 4, 310, 0, 11, 1)
#define PT7_SIUL4_EIRQ6                 NXP_SIUL2_PINMUX(4, 4, 311, 0, 6, 1)
#define PT8_SIUL4_EIRQ7                 NXP_SIUL2_PINMUX(4, 4, 312, 0, 7, 1)
#define PT9_SIUL4_EIRQ8                 NXP_SIUL2_PINMUX(4, 4, 313, 0, 8, 1)
#define PT10_SIUL4_EIRQ1                NXP_SIUL2_PINMUX(4, 4, 314, 0, 1, 1)
#define PT11_SIUL4_EIRQ9                NXP_SIUL2_PINMUX(4, 4, 315, 0, 9, 1)
#define PT12_SIUL4_EIRQ12               NXP_SIUL2_PINMUX(4, 4, 316, 0, 12, 1)
#define PT14_SIUL4_EIRQ5                NXP_SIUL2_PINMUX(4, 4, 318, 0, 5, 2)
#define PU2_SIUL4_EIRQ13                NXP_SIUL2_PINMUX(4, 4, 322, 0, 13, 1)
#define PU6_SIUL4_EIRQ0                 NXP_SIUL2_PINMUX(4, 4, 326, 0, 0, 2)
#define PU7_SIUL4_EIRQ15                NXP_SIUL2_PINMUX(4, 4, 327, 0, 15, 1)
#define PU8_SIUL4_EIRQ2                 NXP_SIUL2_PINMUX(4, 4, 328, 0, 2, 1)
#define PU9_SIUL4_EIRQ1                 NXP_SIUL2_PINMUX(4, 4, 329, 0, 1, 2)
#define PU10_SIUL4_EIRQ2                NXP_SIUL2_PINMUX(4, 4, 330, 0, 2, 2)
#define PU11_SIUL4_EIRQ3                NXP_SIUL2_PINMUX(4, 4, 331, 0, 3, 1)
#define PU12_SIUL4_EIRQ3                NXP_SIUL2_PINMUX(4, 4, 332, 0, 3, 2)
#define PU13_SIUL4_EIRQ4                NXP_SIUL2_PINMUX(4, 4, 333, 0, 4, 2)
#define PV0_SIUL4_EIRQ6                 NXP_SIUL2_PINMUX(4, 4, 336, 0, 6, 2)
#define PV1_SIUL4_EIRQ7                 NXP_SIUL2_PINMUX(4, 4, 337, 0, 7, 2)
#define PV2_SIUL4_EIRQ8                 NXP_SIUL2_PINMUX(4, 4, 338, 0, 8, 2)
#define PV3_SIUL4_EIRQ0                 NXP_SIUL2_PINMUX(4, 4, 339, 0, 0, 3)
#define PV4_SIUL4_EIRQ1                 NXP_SIUL2_PINMUX(4, 4, 340, 0, 1, 3)
#define PV5_SIUL4_EIRQ2                 NXP_SIUL2_PINMUX(4, 4, 341, 0, 2, 3)
#define PV6_SIUL4_EIRQ3                 NXP_SIUL2_PINMUX(4, 4, 342, 0, 3, 3)
#define PV7_SIUL4_EIRQ4                 NXP_SIUL2_PINMUX(4, 4, 343, 0, 4, 3)
#define PV8_SIUL4_EIRQ5                 NXP_SIUL2_PINMUX(4, 4, 344, 0, 5, 3)
#define PV9_SIUL4_EIRQ6                 NXP_SIUL2_PINMUX(4, 4, 345, 0, 6, 3)
#define PV10_SIUL4_EIRQ9                NXP_SIUL2_PINMUX(4, 4, 346, 0, 9, 2)
#define PV11_SIUL4_EIRQ8                NXP_SIUL2_PINMUX(4, 4, 347, 0, 8, 3)
#define PV12_SIUL4_EIRQ10               NXP_SIUL2_PINMUX(4, 4, 348, 0, 10, 2)
#define PV13_SIUL4_EIRQ11               NXP_SIUL2_PINMUX(4, 4, 349, 0, 11, 2)
#define PV14_SIUL4_EIRQ7                NXP_SIUL2_PINMUX(4, 4, 350, 0, 7, 3)
#define PV15_SIUL4_EIRQ12               NXP_SIUL2_PINMUX(4, 4, 351, 0, 12, 2)
#define PW0_SIUL4_EIRQ10                NXP_SIUL2_PINMUX(4, 4, 352, 0, 10, 3)
#define PW1_SIUL4_EIRQ13                NXP_SIUL2_PINMUX(4, 4, 353, 0, 13, 2)
#define PW2_SIUL4_EIRQ9                 NXP_SIUL2_PINMUX(4, 4, 354, 0, 9, 3)
#define PW3_SIUL4_EIRQ14                NXP_SIUL2_PINMUX(4, 4, 355, 0, 14, 2)
#define PW4_SIUL4_EIRQ11                NXP_SIUL2_PINMUX(4, 4, 356, 0, 11, 3)
#define PW5_SIUL4_EIRQ15                NXP_SIUL2_PINMUX(4, 4, 357, 0, 15, 2)
#define PW6_SIUL4_EIRQ13                NXP_SIUL2_PINMUX(4, 4, 358, 0, 13, 3)
#define PW9_SIUL4_EIRQ14                NXP_SIUL2_PINMUX(4, 4, 361, 0, 14, 3)
#define PW10_SIUL4_EIRQ15               NXP_SIUL2_PINMUX(4, 4, 362, 0, 15, 3)
#define PW11_SIUL4_EIRQ12               NXP_SIUL2_PINMUX(4, 4, 363, 0, 12, 3)

