zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPUART17 */
#define PT0_LPUART17_TX_O               NXP_SIUL2_PINMUX(4, 4, 304, 1, 0, 0)
#define PT0_LPUART17_TX_I               NXP_SIUL2_PINMUX(4, 4, 304, 0, 74, 1)
#define PT1_LPUART17_TX_O               NXP_SIUL2_PINMUX(4, 4, 305, 6, 0, 0)
#define PT1_LPUART17_TX_I               NXP_SIUL2_PINMUX(4, 4, 305, 0, 74, 2)
#define PT2_LPUART17_RX                 NXP_SIUL2_PINMUX(4, 4, 306, 0, 73, 1)
#define PT14_LPUART17_RX                NXP_SIUL2_PINMUX(4, 4, 318, 0, 73, 2)
#define PU10_LPUART17_RX                NXP_SIUL2_PINMUX(4, 4, 330, 0, 73, 3)
#define PU14_LPUART17_TX_O              NXP_SIUL2_PINMUX(4, 4, 334, 1, 0, 0)
#define PU14_LPUART17_TX_I              NXP_SIUL2_PINMUX(4, 4, 334, 0, 74, 3)
#define PV7_LPUART17_RX                 NXP_SIUL2_PINMUX(4, 4, 343, 0, 73, 7)
#define PV8_LPUART17_TX_O               NXP_SIUL2_PINMUX(4, 4, 344, 1, 0, 0)
#define PV8_LPUART17_TX_I               NXP_SIUL2_PINMUX(4, 4, 344, 0, 74, 6)
#define PV9_LPUART17_TX_O               NXP_SIUL2_PINMUX(4, 4, 345, 3, 0, 0)
#define PV9_LPUART17_TX_I               NXP_SIUL2_PINMUX(4, 4, 345, 0, 74, 7)
#define PV10_LPUART17_TX_O              NXP_SIUL2_PINMUX(4, 4, 346, 5, 0, 0)
#define PV10_LPUART17_TX_I              NXP_SIUL2_PINMUX(4, 4, 346, 0, 74, 4)
#define PV12_LPUART17_TX_O              NXP_SIUL2_PINMUX(4, 4, 348, 8, 0, 0)
#define PV12_LPUART17_TX_I              NXP_SIUL2_PINMUX(4, 4, 348, 0, 74, 5)
#define PV13_LPUART17_RX                NXP_SIUL2_PINMUX(4, 4, 349, 0, 73, 4)
#define PV14_LPUART17_RX                NXP_SIUL2_PINMUX(4, 4, 350, 0, 73, 5)
#define PW6_LPUART17_TX_O               NXP_SIUL2_PINMUX(4, 4, 358, 5, 0, 0)
#define PW6_LPUART17_TX_I               NXP_SIUL2_PINMUX(4, 4, 358, 0, 74, 8)
#define PW11_LPUART17_RX                NXP_SIUL2_PINMUX(4, 4, 363, 0, 73, 6)

/* LCU1 */
#define PT0_LCU1_OUT11                  NXP_SIUL2_PINMUX(4, 4, 304, 2, 0, 0)
#define PT0_LCU1_IN11                   NXP_SIUL2_PINMUX(4, 4, 304, 0, 159, 2)
#define PT1_LCU1_OUT5                   NXP_SIUL2_PINMUX(4, 4, 305, 1, 0, 0)
#define PT1_LCU1_IN5                    NXP_SIUL2_PINMUX(4, 4, 305, 0, 160, 2)
#define PT2_LCU1_OUT4                   NXP_SIUL2_PINMUX(4, 4, 306, 3, 0, 0)
#define PT2_LCU1_IN4                    NXP_SIUL2_PINMUX(4, 4, 306, 0, 161, 2)
#define PT3_LCU1_OUT7                   NXP_SIUL2_PINMUX(4, 4, 307, 4, 0, 0)
#define PT3_LCU1_IN7                    NXP_SIUL2_PINMUX(4, 4, 307, 0, 164, 2)
#define PT4_LCU1_OUT1                   NXP_SIUL2_PINMUX(4, 4, 308, 4, 0, 0)
#define PT4_LCU1_IN1                    NXP_SIUL2_PINMUX(4, 4, 308, 0, 156, 2)
#define PT5_LCU1_OUT0                   NXP_SIUL2_PINMUX(4, 4, 309, 9, 0, 0)
#define PT5_LCU1_IN0                    NXP_SIUL2_PINMUX(4, 4, 309, 0, 157, 2)
#define PT6_LCU1_OUT5                   NXP_SIUL2_PINMUX(4, 4, 310, 6, 0, 0)
#define PT6_LCU1_IN5                    NXP_SIUL2_PINMUX(4, 4, 310, 0, 160, 3)
#define PT7_LCU1_OUT0                   NXP_SIUL2_PINMUX(4, 4, 311, 3, 0, 0)
#define PT7_LCU1_IN0                    NXP_SIUL2_PINMUX(4, 4, 311, 0, 157, 3)
#define PT8_LCU1_OUT3                   NXP_SIUL2_PINMUX(4, 4, 312, 3, 0, 0)
#define PT8_LCU1_IN3                    NXP_SIUL2_PINMUX(4, 4, 312, 0, 162, 2)
#define PT9_LCU1_OUT2                   NXP_SIUL2_PINMUX(4, 4, 313, 2, 0, 0)
#define PT9_LCU1_IN2                    NXP_SIUL2_PINMUX(4, 4, 313, 0, 158, 2)
#define PT10_LCU1_OUT6                  NXP_SIUL2_PINMUX(4, 4, 314, 4, 0, 0)
#define PT10_LCU1_IN6                   NXP_SIUL2_PINMUX(4, 4, 314, 0, 167, 2)
#define PT11_LCU1_OUT2                  NXP_SIUL2_PINMUX(4, 4, 315, 8, 0, 0)
#define PT11_LCU1_IN2                   NXP_SIUL2_PINMUX(4, 4, 315, 0, 158, 3)
#define PT12_LCU1_OUT4                  NXP_SIUL2_PINMUX(4, 4, 316, 8, 0, 0)
#define PT12_LCU1_IN4                   NXP_SIUL2_PINMUX(4, 4, 316, 0, 161, 3)
#define PT13_LCU1_OUT1                  NXP_SIUL2_PINMUX(4, 4, 317, 1, 0, 0)
#define PT13_LCU1_IN1                   NXP_SIUL2_PINMUX(4, 4, 317, 0, 156, 3)
#define PT14_LCU1_OUT9                  NXP_SIUL2_PINMUX(4, 4, 318, 4, 0, 0)
#define PT14_LCU1_IN9                   NXP_SIUL2_PINMUX(4, 4, 318, 0, 165, 2)
#define PT15_LCU1_OUT11                 NXP_SIUL2_PINMUX(4, 4, 319, 3, 0, 0)
#define PT15_LCU1_IN11                  NXP_SIUL2_PINMUX(4, 4, 319, 0, 159, 3)
#define PU0_LCU1_OUT3                   NXP_SIUL2_PINMUX(4, 4, 320, 2, 0, 0)
#define PU0_LCU1_IN3                    NXP_SIUL2_PINMUX(4, 4, 320, 0, 162, 3)
#define PU1_LCU1_OUT8                   NXP_SIUL2_PINMUX(4, 4, 321, 3, 0, 0)
#define PU1_LCU1_IN8                    NXP_SIUL2_PINMUX(4, 4, 321, 0, 166, 2)
#define PU2_LCU1_OUT10                  NXP_SIUL2_PINMUX(4, 4, 322, 3, 0, 0)
#define PU2_LCU1_IN10                   NXP_SIUL2_PINMUX(4, 4, 322, 0, 163, 2)
#define PU3_LCU1_OUT10                  NXP_SIUL2_PINMUX(4, 4, 323, 4, 0, 0)
#define PU3_LCU1_IN10                   NXP_SIUL2_PINMUX(4, 4, 323, 0, 163, 3)
#define PU4_LCU1_OUT9                   NXP_SIUL2_PINMUX(4, 4, 324, 2, 0, 0)
#define PU4_LCU1_IN9                    NXP_SIUL2_PINMUX(4, 4, 324, 0, 165, 3)
#define PU5_LCU1_OUT8                   NXP_SIUL2_PINMUX(4, 4, 325, 2, 0, 0)
#define PU5_LCU1_IN8                    NXP_SIUL2_PINMUX(4, 4, 325, 0, 166, 3)
#define PU6_LCU1_OUT9                   NXP_SIUL2_PINMUX(4, 4, 326, 5, 0, 0)
#define PU6_LCU1_IN9                    NXP_SIUL2_PINMUX(4, 4, 326, 0, 165, 4)
#define PU7_LCU1_OUT11                  NXP_SIUL2_PINMUX(4, 4, 327, 7, 0, 0)
#define PU7_LCU1_IN11                   NXP_SIUL2_PINMUX(4, 4, 327, 0, 159, 4)
#define PU8_LCU1_OUT3                   NXP_SIUL2_PINMUX(4, 4, 328, 5, 0, 0)
#define PU8_LCU1_IN3                    NXP_SIUL2_PINMUX(4, 4, 328, 0, 162, 4)
#define PU9_LCU1_OUT6                   NXP_SIUL2_PINMUX(4, 4, 329, 1, 0, 0)
#define PU9_LCU1_IN6                    NXP_SIUL2_PINMUX(4, 4, 329, 0, 167, 3)
#define PU10_LCU1_OUT10                 NXP_SIUL2_PINMUX(4, 4, 330, 1, 0, 0)
#define PU10_LCU1_IN10                  NXP_SIUL2_PINMUX(4, 4, 330, 0, 163, 4)
#define PU11_LCU1_OUT6                  NXP_SIUL2_PINMUX(4, 4, 331, 1, 0, 0)
#define PU11_LCU1_IN6                   NXP_SIUL2_PINMUX(4, 4, 331, 0, 167, 4)
#define PU12_LCU1_OUT7                  NXP_SIUL2_PINMUX(4, 4, 332, 4, 0, 0)
#define PU12_LCU1_IN7                   NXP_SIUL2_PINMUX(4, 4, 332, 0, 164, 3)
#define PU13_LCU1_OUT2                  NXP_SIUL2_PINMUX(4, 4, 333, 5, 0, 0)
#define PU13_LCU1_IN2                   NXP_SIUL2_PINMUX(4, 4, 333, 0, 158, 4)
#define PU14_LCU1_OUT8                  NXP_SIUL2_PINMUX(4, 4, 334, 6, 0, 0)
#define PU14_LCU1_IN8                   NXP_SIUL2_PINMUX(4, 4, 334, 0, 166, 4)
#define PU15_LCU1_OUT7                  NXP_SIUL2_PINMUX(4, 4, 335, 6, 0, 0)
#define PU15_LCU1_IN7                   NXP_SIUL2_PINMUX(4, 4, 335, 0, 164, 4)
#define PV0_LCU1_OUT6                   NXP_SIUL2_PINMUX(4, 4, 336, 3, 0, 0)
#define PV0_LCU1_IN6                    NXP_SIUL2_PINMUX(4, 4, 336, 0, 167, 5)
#define PV1_LCU1_OUT5                   NXP_SIUL2_PINMUX(4, 4, 337, 3, 0, 0)
#define PV1_LCU1_IN5                    NXP_SIUL2_PINMUX(4, 4, 337, 0, 160, 4)
#define PV2_LCU1_OUT7                   NXP_SIUL2_PINMUX(4, 4, 338, 3, 0, 0)
#define PV2_LCU1_IN7                    NXP_SIUL2_PINMUX(4, 4, 338, 0, 164, 5)
#define PV7_LCU1_OUT0                   NXP_SIUL2_PINMUX(4, 4, 343, 4, 0, 0)
#define PV7_LCU1_IN0                    NXP_SIUL2_PINMUX(4, 4, 343, 0, 157, 5)
#define PV8_LCU1_OUT1                   NXP_SIUL2_PINMUX(4, 4, 344, 4, 0, 0)
#define PV8_LCU1_IN1                    NXP_SIUL2_PINMUX(4, 4, 344, 0, 156, 5)
#define PV9_LCU1_OUT2                   NXP_SIUL2_PINMUX(4, 4, 345, 5, 0, 0)
#define PV9_LCU1_IN2                    NXP_SIUL2_PINMUX(4, 4, 345, 0, 158, 6)
#define PV10_LCU1_OUT2                  NXP_SIUL2_PINMUX(4, 4, 346, 4, 0, 0)
#define PV10_LCU1_IN2                   NXP_SIUL2_PINMUX(4, 4, 346, 0, 158, 5)
#define PV11_LCU1_OUT4                  NXP_SIUL2_PINMUX(4, 4, 347, 5, 0, 0)
#define PV11_LCU1_IN4                   NXP_SIUL2_PINMUX(4, 4, 347, 0, 161, 5)
#define PV12_LCU1_OUT4                  NXP_SIUL2_PINMUX(4, 4, 348, 4, 0, 0)
#define PV12_LCU1_IN4                   NXP_SIUL2_PINMUX(4, 4, 348, 0, 161, 4)
#define PV13_LCU1_OUT3                  NXP_SIUL2_PINMUX(4, 4, 349, 8, 0, 0)
#define PV13_LCU1_IN3                   NXP_SIUL2_PINMUX(4, 4, 349, 0, 162, 5)
#define PV14_LCU1_OUT3                  NXP_SIUL2_PINMUX(4, 4, 350, 7, 0, 0)
#define PV14_LCU1_IN3                   NXP_SIUL2_PINMUX(4, 4, 350, 0, 162, 6)
#define PV15_LCU1_OUT0                  NXP_SIUL2_PINMUX(4, 4, 351, 3, 0, 0)
#define PV15_LCU1_IN0                   NXP_SIUL2_PINMUX(4, 4, 351, 0, 157, 4)
#define PW0_LCU1_OUT6                   NXP_SIUL2_PINMUX(4, 4, 352, 5, 0, 0)
#define PW0_LCU1_IN6                    NXP_SIUL2_PINMUX(4, 4, 352, 0, 167, 6)
#define PW1_LCU1_OUT1                   NXP_SIUL2_PINMUX(4, 4, 353, 3, 0, 0)
#define PW1_LCU1_IN1                    NXP_SIUL2_PINMUX(4, 4, 353, 0, 156, 4)
#define PW2_LCU1_OUT5                   NXP_SIUL2_PINMUX(4, 4, 354, 6, 0, 0)
#define PW2_LCU1_IN5                    NXP_SIUL2_PINMUX(4, 4, 354, 0, 160, 5)
#define PW3_LCU1_OUT10                  NXP_SIUL2_PINMUX(4, 4, 355, 8, 0, 0)
#define PW3_LCU1_IN10                   NXP_SIUL2_PINMUX(4, 4, 355, 0, 163, 5)
#define PW4_LCU1_OUT7                   NXP_SIUL2_PINMUX(4, 4, 356, 8, 0, 0)
#define PW4_LCU1_IN7                    NXP_SIUL2_PINMUX(4, 4, 356, 0, 164, 6)
#define PW5_LCU1_OUT8                   NXP_SIUL2_PINMUX(4, 4, 357, 7, 0, 0)
#define PW5_LCU1_IN8                    NXP_SIUL2_PINMUX(4, 4, 357, 0, 166, 5)
#define PW6_LCU1_OUT8                   NXP_SIUL2_PINMUX(4, 4, 358, 8, 0, 0)
#define PW6_LCU1_IN8                    NXP_SIUL2_PINMUX(4, 4, 358, 0, 166, 6)
#define PW7_LCU1_OUT9                   NXP_SIUL2_PINMUX(4, 4, 359, 6, 0, 0)
#define PW7_LCU1_IN9                    NXP_SIUL2_PINMUX(4, 4, 359, 0, 165, 5)
#define PW8_LCU1_OUT11                  NXP_SIUL2_PINMUX(4, 4, 360, 4, 0, 0)
#define PW8_LCU1_IN11                   NXP_SIUL2_PINMUX(4, 4, 360, 0, 159, 5)
#define PW9_LCU1_OUT10                  NXP_SIUL2_PINMUX(4, 4, 361, 5, 0, 0)
#define PW9_LCU1_IN10                   NXP_SIUL2_PINMUX(4, 4, 361, 0, 163, 6)
#define PW10_LCU1_OUT11                 NXP_SIUL2_PINMUX(4, 4, 362, 3, 0, 0)
#define PW10_LCU1_IN11                  NXP_SIUL2_PINMUX(4, 4, 362, 0, 159, 6)
#define PW11_LCU1_OUT9                  NXP_SIUL2_PINMUX(4, 4, 363, 7, 0, 0)
#define PW11_LCU1_IN9                   NXP_SIUL2_PINMUX(4, 4, 363, 0, 165, 6)

/* LPSPI5 */
#define PT0_LPSPI5_PCS0_O               NXP_SIUL2_PINMUX(4, 4, 304, 5, 0, 0)
#define PT0_LPSPI5_PCS0_I               NXP_SIUL2_PINMUX(4, 4, 304, 0, 35, 1)
#define PT1_LPSPI5_PCS4_O               NXP_SIUL2_PINMUX(4, 4, 305, 5, 0, 0)
#define PT1_LPSPI5_PCS4_I               NXP_SIUL2_PINMUX(4, 4, 305, 0, 39, 1)
#define PT2_LPSPI5_PCS5_O               NXP_SIUL2_PINMUX(4, 4, 306, 1, 0, 0)
#define PT2_LPSPI5_PCS5_I               NXP_SIUL2_PINMUX(4, 4, 306, 0, 40, 1)
#define PT3_LPSPI5_PCS1_O               NXP_SIUL2_PINMUX(4, 4, 307, 1, 0, 0)
#define PT3_LPSPI5_PCS1_I               NXP_SIUL2_PINMUX(4, 4, 307, 0, 36, 1)
#define PT4_LPSPI5_SOUT_O               NXP_SIUL2_PINMUX(4, 4, 308, 3, 0, 0)
#define PT4_LPSPI5_SOUT_I               NXP_SIUL2_PINMUX(4, 4, 308, 0, 45, 1)
#define PT5_LPSPI5_SCK_O                NXP_SIUL2_PINMUX(4, 4, 309, 8, 0, 0)
#define PT5_LPSPI5_SCK_I                NXP_SIUL2_PINMUX(4, 4, 309, 0, 43, 1)
#define PT6_LPSPI5_SIN_O                NXP_SIUL2_PINMUX(4, 4, 310, 1, 0, 0)
#define PT6_LPSPI5_SIN_I                NXP_SIUL2_PINMUX(4, 4, 310, 0, 44, 1)
#define PT7_LPSPI5_PCS7_O               NXP_SIUL2_PINMUX(4, 4, 311, 1, 0, 0)
#define PT7_LPSPI5_PCS7_I               NXP_SIUL2_PINMUX(4, 4, 311, 0, 42, 1)
#define PT8_LPSPI5_PCS1_O               NXP_SIUL2_PINMUX(4, 4, 312, 1, 0, 0)
#define PT8_LPSPI5_PCS1_I               NXP_SIUL2_PINMUX(4, 4, 312, 0, 36, 2)
#define PT11_LPSPI5_PCS0_O              NXP_SIUL2_PINMUX(4, 4, 315, 6, 0, 0)
#define PT11_LPSPI5_PCS0_I              NXP_SIUL2_PINMUX(4, 4, 315, 0, 35, 2)
#define PT12_LPSPI5_PCS0_O              NXP_SIUL2_PINMUX(4, 4, 316, 4, 0, 0)
#define PT12_LPSPI5_PCS0_I              NXP_SIUL2_PINMUX(4, 4, 316, 0, 35, 3)
#define PT13_LPSPI5_SOUT_O              NXP_SIUL2_PINMUX(4, 4, 317, 3, 0, 0)
#define PT13_LPSPI5_SOUT_I              NXP_SIUL2_PINMUX(4, 4, 317, 0, 45, 2)
#define PT15_LPSPI5_PCS6_O              NXP_SIUL2_PINMUX(4, 4, 319, 1, 0, 0)
#define PT15_LPSPI5_PCS6_I              NXP_SIUL2_PINMUX(4, 4, 319, 0, 41, 1)
#define PU2_LPSPI5_SOUT_O               NXP_SIUL2_PINMUX(4, 4, 322, 8, 0, 0)
#define PU2_LPSPI5_SOUT_I               NXP_SIUL2_PINMUX(4, 4, 322, 0, 45, 3)
#define PU3_LPSPI5_SCK_O                NXP_SIUL2_PINMUX(4, 4, 323, 5, 0, 0)
#define PU3_LPSPI5_SCK_I                NXP_SIUL2_PINMUX(4, 4, 323, 0, 43, 2)
#define PU4_LPSPI5_SIN_O                NXP_SIUL2_PINMUX(4, 4, 324, 5, 0, 0)
#define PU4_LPSPI5_SIN_I                NXP_SIUL2_PINMUX(4, 4, 324, 0, 44, 2)
#define PU5_LPSPI5_PCS3_O               NXP_SIUL2_PINMUX(4, 4, 325, 3, 0, 0)
#define PU5_LPSPI5_PCS3_I               NXP_SIUL2_PINMUX(4, 4, 325, 0, 38, 1)
#define PU7_LPSPI5_PCS2_O               NXP_SIUL2_PINMUX(4, 4, 327, 4, 0, 0)
#define PU7_LPSPI5_PCS2_I               NXP_SIUL2_PINMUX(4, 4, 327, 0, 37, 1)
#define PU8_LPSPI5_SIN_O                NXP_SIUL2_PINMUX(4, 4, 328, 6, 0, 0)
#define PU8_LPSPI5_SIN_I                NXP_SIUL2_PINMUX(4, 4, 328, 0, 44, 3)
#define PU12_LPSPI5_PCS3_O              NXP_SIUL2_PINMUX(4, 4, 332, 11, 0, 0)
#define PU12_LPSPI5_PCS3_I              NXP_SIUL2_PINMUX(4, 4, 332, 0, 38, 2)
#define PU13_LPSPI5_SCK_O               NXP_SIUL2_PINMUX(4, 4, 333, 8, 0, 0)
#define PU13_LPSPI5_SCK_I               NXP_SIUL2_PINMUX(4, 4, 333, 0, 43, 3)
#define PU15_LPSPI5_PCS2_O              NXP_SIUL2_PINMUX(4, 4, 335, 2, 0, 0)
#define PU15_LPSPI5_PCS2_I              NXP_SIUL2_PINMUX(4, 4, 335, 0, 37, 2)
#define PV3_LPSPI5_SOUT_O               NXP_SIUL2_PINMUX(4, 4, 339, 3, 0, 0)
#define PV3_LPSPI5_SOUT_I               NXP_SIUL2_PINMUX(4, 4, 339, 0, 45, 5)
#define PV4_LPSPI5_SIN_O                NXP_SIUL2_PINMUX(4, 4, 340, 3, 0, 0)
#define PV4_LPSPI5_SIN_I                NXP_SIUL2_PINMUX(4, 4, 340, 0, 44, 4)
#define PV5_LPSPI5_SCK_O                NXP_SIUL2_PINMUX(4, 4, 341, 4, 0, 0)
#define PV5_LPSPI5_SCK_I                NXP_SIUL2_PINMUX(4, 4, 341, 0, 43, 4)
#define PV6_LPSPI5_PCS0_O               NXP_SIUL2_PINMUX(4, 4, 342, 3, 0, 0)
#define PV6_LPSPI5_PCS0_I               NXP_SIUL2_PINMUX(4, 4, 342, 0, 35, 5)
#define PV7_LPSPI5_PCS2_O               NXP_SIUL2_PINMUX(4, 4, 343, 3, 0, 0)
#define PV7_LPSPI5_PCS2_I               NXP_SIUL2_PINMUX(4, 4, 343, 0, 37, 4)
#define PV8_LPSPI5_PCS3_O               NXP_SIUL2_PINMUX(4, 4, 344, 3, 0, 0)
#define PV8_LPSPI5_PCS3_I               NXP_SIUL2_PINMUX(4, 4, 344, 0, 38, 4)
#define PV9_LPSPI5_PCS3_O               NXP_SIUL2_PINMUX(4, 4, 345, 4, 0, 0)
#define PV9_LPSPI5_PCS3_I               NXP_SIUL2_PINMUX(4, 4, 345, 0, 38, 5)
#define PV11_LPSPI5_PCS1_O              NXP_SIUL2_PINMUX(4, 4, 347, 2, 0, 0)
#define PV11_LPSPI5_PCS1_I              NXP_SIUL2_PINMUX(4, 4, 347, 0, 36, 3)
#define PV12_LPSPI5_PCS2_O              NXP_SIUL2_PINMUX(4, 4, 348, 3, 0, 0)
#define PV12_LPSPI5_PCS2_I              NXP_SIUL2_PINMUX(4, 4, 348, 0, 37, 3)
#define PV13_LPSPI5_PCS3_O              NXP_SIUL2_PINMUX(4, 4, 349, 7, 0, 0)
#define PV13_LPSPI5_PCS3_I              NXP_SIUL2_PINMUX(4, 4, 349, 0, 38, 3)
#define PV14_LPSPI5_PCS2_O              NXP_SIUL2_PINMUX(4, 4, 350, 6, 0, 0)
#define PV14_LPSPI5_PCS2_I              NXP_SIUL2_PINMUX(4, 4, 350, 0, 37, 5)
#define PW0_LPSPI5_SOUT_O               NXP_SIUL2_PINMUX(4, 4, 352, 2, 0, 0)
#define PW0_LPSPI5_SOUT_I               NXP_SIUL2_PINMUX(4, 4, 352, 0, 45, 4)
#define PW2_LPSPI5_PCS4_O               NXP_SIUL2_PINMUX(4, 4, 354, 5, 0, 0)
#define PW2_LPSPI5_PCS4_I               NXP_SIUL2_PINMUX(4, 4, 354, 0, 39, 2)
#define PW3_LPSPI5_PCS0_O               NXP_SIUL2_PINMUX(4, 4, 355, 7, 0, 0)
#define PW3_LPSPI5_PCS0_I               NXP_SIUL2_PINMUX(4, 4, 355, 0, 35, 4)
#define PW4_LPSPI5_SIN_O                NXP_SIUL2_PINMUX(4, 4, 356, 7, 0, 0)
#define PW4_LPSPI5_SIN_I                NXP_SIUL2_PINMUX(4, 4, 356, 0, 44, 5)
#define PW6_LPSPI5_PCS5_O               NXP_SIUL2_PINMUX(4, 4, 358, 7, 0, 0)
#define PW6_LPSPI5_PCS5_I               NXP_SIUL2_PINMUX(4, 4, 358, 0, 40, 2)
#define PW9_LPSPI5_PCS6_O               NXP_SIUL2_PINMUX(4, 4, 361, 1, 0, 0)
#define PW9_LPSPI5_PCS6_I               NXP_SIUL2_PINMUX(4, 4, 361, 0, 41, 2)
#define PW10_LPSPI5_PCS7_O              NXP_SIUL2_PINMUX(4, 4, 362, 2, 0, 0)
#define PW10_LPSPI5_PCS7_I              NXP_SIUL2_PINMUX(4, 4, 362, 0, 42, 2)
#define PW11_LPSPI5_SCK_O               NXP_SIUL2_PINMUX(4, 4, 363, 6, 0, 0)
#define PW11_LPSPI5_SCK_I               NXP_SIUL2_PINMUX(4, 4, 363, 0, 43, 5)

