zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* EMIOS_1 */
#define PT0_EMIOS1_CH10_H_O             NXP_SIUL2_PINMUX(4, 4, 304, 7, 0, 0)
#define PT0_EMIOS1_CH10_H_I             NXP_SIUL2_PINMUX(4, 4, 304, 0, 112, 2)
#define PT1_EMIOS1_CH11_H_O             NXP_SIUL2_PINMUX(4, 4, 305, 7, 0, 0)
#define PT1_EMIOS1_CH11_H_I             NXP_SIUL2_PINMUX(4, 4, 305, 0, 113, 2)
#define PT2_EMIOS1_CH0_X_O              NXP_SIUL2_PINMUX(4, 4, 306, 4, 0, 0)
#define PT2_EMIOS1_CH1_H_O              NXP_SIUL2_PINMUX(4, 4, 306, 7, 0, 0)
#define PT2_EMIOS1_CH0_X_I              NXP_SIUL2_PINMUX(4, 4, 306, 0, 102, 2)
#define PT2_EMIOS1_CH1_H_I              NXP_SIUL2_PINMUX(4, 4, 306, 0, 103, 2)
#define PT4_EMIOS1_CH9_H_O              NXP_SIUL2_PINMUX(4, 4, 308, 5, 0, 0)
#define PT4_EMIOS1_CH9_H_I              NXP_SIUL2_PINMUX(4, 4, 308, 0, 111, 2)
#define PT5_EMIOS1_CH5_H_O              NXP_SIUL2_PINMUX(4, 4, 309, 3, 0, 0)
#define PT5_EMIOS1_CH23_X_O             NXP_SIUL2_PINMUX(4, 4, 309, 4, 0, 0)
#define PT5_EMIOS1_CH5_H_I              NXP_SIUL2_PINMUX(4, 4, 309, 0, 107, 2)
#define PT5_EMIOS1_CH23_X_I             NXP_SIUL2_PINMUX(4, 4, 309, 0, 125, 2)
#define PT6_EMIOS1_CH15_H_O             NXP_SIUL2_PINMUX(4, 4, 310, 2, 0, 0)
#define PT6_EMIOS1_CH15_H_I             NXP_SIUL2_PINMUX(4, 4, 310, 0, 117, 2)
#define PT7_EMIOS1_CH14_H_O             NXP_SIUL2_PINMUX(4, 4, 311, 5, 0, 0)
#define PT7_EMIOS1_CH14_H_I             NXP_SIUL2_PINMUX(4, 4, 311, 0, 116, 2)
#define PT8_EMIOS1_CH7_H_O              NXP_SIUL2_PINMUX(4, 4, 312, 4, 0, 0)
#define PT8_EMIOS1_CH7_H_I              NXP_SIUL2_PINMUX(4, 4, 312, 0, 109, 2)
#define PT9_EMIOS1_CH6_H_O              NXP_SIUL2_PINMUX(4, 4, 313, 3, 0, 0)
#define PT9_EMIOS1_CH6_H_I              NXP_SIUL2_PINMUX(4, 4, 313, 0, 108, 2)
#define PT10_EMIOS1_CH4_H_O             NXP_SIUL2_PINMUX(4, 4, 314, 7, 0, 0)
#define PT10_EMIOS1_CH4_H_I             NXP_SIUL2_PINMUX(4, 4, 314, 0, 106, 2)
#define PT11_EMIOS1_CH16_X_O            NXP_SIUL2_PINMUX(4, 4, 315, 3, 0, 0)
#define PT11_EMIOS1_CH3_H_O             NXP_SIUL2_PINMUX(4, 4, 315, 5, 0, 0)
#define PT11_EMIOS1_CH3_H_I             NXP_SIUL2_PINMUX(4, 4, 315, 0, 105, 2)
#define PT11_EMIOS1_CH16_X_I            NXP_SIUL2_PINMUX(4, 4, 315, 0, 118, 2)
#define PT13_EMIOS1_CH22_X_O            NXP_SIUL2_PINMUX(4, 4, 317, 2, 0, 0)
#define PT13_EMIOS1_CH4_H_O             NXP_SIUL2_PINMUX(4, 4, 317, 4, 0, 0)
#define PT13_EMIOS1_CH4_H_I             NXP_SIUL2_PINMUX(4, 4, 317, 0, 106, 3)
#define PT13_EMIOS1_CH22_X_I            NXP_SIUL2_PINMUX(4, 4, 317, 0, 124, 2)
#define PT14_EMIOS1_CH6_H_O             NXP_SIUL2_PINMUX(4, 4, 318, 5, 0, 0)
#define PT14_EMIOS1_CH6_H_I             NXP_SIUL2_PINMUX(4, 4, 318, 0, 108, 3)
#define PU1_EMIOS1_CH8_X_O              NXP_SIUL2_PINMUX(4, 4, 321, 4, 0, 0)
#define PU1_EMIOS1_CH2_H_O              NXP_SIUL2_PINMUX(4, 4, 321, 5, 0, 0)
#define PU1_EMIOS1_CH2_H_I              NXP_SIUL2_PINMUX(4, 4, 321, 0, 104, 2)
#define PU1_EMIOS1_CH8_X_I              NXP_SIUL2_PINMUX(4, 4, 321, 0, 110, 2)
#define PU2_EMIOS1_CH18_Y_O             NXP_SIUL2_PINMUX(4, 4, 322, 6, 0, 0)
#define PU2_EMIOS1_CH18_Y_I             NXP_SIUL2_PINMUX(4, 4, 322, 0, 120, 1)
#define PU3_EMIOS1_CH17_Y_O             NXP_SIUL2_PINMUX(4, 4, 323, 3, 0, 0)
#define PU3_EMIOS1_CH17_Y_I             NXP_SIUL2_PINMUX(4, 4, 323, 0, 119, 1)
#define PU6_EMIOS1_CH8_X_O              NXP_SIUL2_PINMUX(4, 4, 326, 3, 0, 0)
#define PU6_EMIOS1_CH2_H_O              NXP_SIUL2_PINMUX(4, 4, 326, 7, 0, 0)
#define PU6_EMIOS1_CH2_H_I              NXP_SIUL2_PINMUX(4, 4, 326, 0, 104, 3)
#define PU6_EMIOS1_CH8_X_I              NXP_SIUL2_PINMUX(4, 4, 326, 0, 110, 3)
#define PU7_EMIOS1_CH21_Y_O             NXP_SIUL2_PINMUX(4, 4, 327, 3, 0, 0)
#define PU7_EMIOS1_CH21_Y_I             NXP_SIUL2_PINMUX(4, 4, 327, 0, 123, 1)
#define PU8_EMIOS1_CH19_Y_O             NXP_SIUL2_PINMUX(4, 4, 328, 4, 0, 0)
#define PU8_EMIOS1_CH19_Y_I             NXP_SIUL2_PINMUX(4, 4, 328, 0, 121, 1)
#define PU9_EMIOS1_CH5_H_O              NXP_SIUL2_PINMUX(4, 4, 329, 9, 0, 0)
#define PU9_EMIOS1_CH5_H_I              NXP_SIUL2_PINMUX(4, 4, 329, 0, 107, 3)
#define PU10_EMIOS1_CH13_H_O            NXP_SIUL2_PINMUX(4, 4, 330, 7, 0, 0)
#define PU10_EMIOS1_CH13_H_I            NXP_SIUL2_PINMUX(4, 4, 330, 0, 115, 2)
#define PU11_EMIOS1_CH12_H_O            NXP_SIUL2_PINMUX(4, 4, 331, 5, 0, 0)
#define PU11_EMIOS1_CH12_H_I            NXP_SIUL2_PINMUX(4, 4, 331, 0, 114, 2)
#define PU12_EMIOS1_CH0_X_O             NXP_SIUL2_PINMUX(4, 4, 332, 2, 0, 0)
#define PU12_EMIOS1_CH1_H_O             NXP_SIUL2_PINMUX(4, 4, 332, 8, 0, 0)
#define PU12_EMIOS1_CH0_X_I             NXP_SIUL2_PINMUX(4, 4, 332, 0, 102, 3)
#define PU12_EMIOS1_CH1_H_I             NXP_SIUL2_PINMUX(4, 4, 332, 0, 103, 3)
#define PU13_EMIOS1_CH20_Y_O            NXP_SIUL2_PINMUX(4, 4, 333, 2, 0, 0)
#define PU13_EMIOS1_CH20_Y_I            NXP_SIUL2_PINMUX(4, 4, 333, 0, 122, 1)
#define PU15_EMIOS1_CH3_H_O             NXP_SIUL2_PINMUX(4, 4, 335, 1, 0, 0)
#define PU15_EMIOS1_CH16_X_O            NXP_SIUL2_PINMUX(4, 4, 335, 4, 0, 0)
#define PU15_EMIOS1_CH3_H_I             NXP_SIUL2_PINMUX(4, 4, 335, 0, 105, 3)
#define PU15_EMIOS1_CH16_X_I            NXP_SIUL2_PINMUX(4, 4, 335, 0, 118, 1)
#define PV5_EMIOS1_CH0_X_O              NXP_SIUL2_PINMUX(4, 4, 341, 1, 0, 0)
#define PV5_EMIOS1_CH0_X_I              NXP_SIUL2_PINMUX(4, 4, 341, 0, 102, 4)
#define PV6_EMIOS1_CH8_X_O              NXP_SIUL2_PINMUX(4, 4, 342, 1, 0, 0)
#define PV6_EMIOS1_CH8_X_I              NXP_SIUL2_PINMUX(4, 4, 342, 0, 110, 4)
#define PV7_EMIOS1_CH22_X_O             NXP_SIUL2_PINMUX(4, 4, 343, 1, 0, 0)
#define PV7_EMIOS1_CH22_X_I             NXP_SIUL2_PINMUX(4, 4, 343, 0, 124, 4)
#define PV9_EMIOS1_CH20_Y_O             NXP_SIUL2_PINMUX(4, 4, 345, 2, 0, 0)
#define PV9_EMIOS1_CH20_Y_I             NXP_SIUL2_PINMUX(4, 4, 345, 0, 122, 2)
#define PV10_EMIOS1_CH18_Y_O            NXP_SIUL2_PINMUX(4, 4, 346, 3, 0, 0)
#define PV10_EMIOS1_CH18_Y_I            NXP_SIUL2_PINMUX(4, 4, 346, 0, 120, 2)
#define PV11_EMIOS1_CH15_H_O            NXP_SIUL2_PINMUX(4, 4, 347, 4, 0, 0)
#define PV11_EMIOS1_CH15_H_I            NXP_SIUL2_PINMUX(4, 4, 347, 0, 117, 3)
#define PV12_EMIOS1_CH16_X_O            NXP_SIUL2_PINMUX(4, 4, 348, 2, 0, 0)
#define PV12_EMIOS1_CH16_X_I            NXP_SIUL2_PINMUX(4, 4, 348, 0, 118, 3)
#define PV13_EMIOS1_CH23_X_O            NXP_SIUL2_PINMUX(4, 4, 349, 2, 0, 0)
#define PV13_EMIOS1_CH23_X_I            NXP_SIUL2_PINMUX(4, 4, 349, 0, 125, 3)
#define PV14_EMIOS1_CH21_Y_O            NXP_SIUL2_PINMUX(4, 4, 350, 5, 0, 0)
#define PV14_EMIOS1_CH21_Y_I            NXP_SIUL2_PINMUX(4, 4, 350, 0, 123, 2)
#define PV15_EMIOS1_CH19_Y_O            NXP_SIUL2_PINMUX(4, 4, 351, 1, 0, 0)
#define PV15_EMIOS1_CH19_Y_I            NXP_SIUL2_PINMUX(4, 4, 351, 0, 121, 2)
#define PW0_EMIOS1_CH17_Y_O             NXP_SIUL2_PINMUX(4, 4, 352, 4, 0, 0)
#define PW0_EMIOS1_CH17_Y_I             NXP_SIUL2_PINMUX(4, 4, 352, 0, 119, 2)
#define PW1_EMIOS1_CH14_H_O             NXP_SIUL2_PINMUX(4, 4, 353, 4, 0, 0)
#define PW1_EMIOS1_CH14_H_I             NXP_SIUL2_PINMUX(4, 4, 353, 0, 116, 3)
#define PW2_EMIOS1_CH13_H_O             NXP_SIUL2_PINMUX(4, 4, 354, 4, 0, 0)
#define PW2_EMIOS1_CH13_H_I             NXP_SIUL2_PINMUX(4, 4, 354, 0, 115, 3)
#define PW3_EMIOS1_CH12_H_O             NXP_SIUL2_PINMUX(4, 4, 355, 5, 0, 0)
#define PW3_EMIOS1_CH12_H_I             NXP_SIUL2_PINMUX(4, 4, 355, 0, 114, 3)
#define PW4_EMIOS1_CH10_H_O             NXP_SIUL2_PINMUX(4, 4, 356, 2, 0, 0)
#define PW4_EMIOS1_CH10_H_I             NXP_SIUL2_PINMUX(4, 4, 356, 0, 112, 3)
#define PW5_EMIOS1_CH9_H_O              NXP_SIUL2_PINMUX(4, 4, 357, 5, 0, 0)
#define PW5_EMIOS1_CH9_H_I              NXP_SIUL2_PINMUX(4, 4, 357, 0, 111, 3)
#define PW6_EMIOS1_CH7_H_O              NXP_SIUL2_PINMUX(4, 4, 358, 2, 0, 0)
#define PW6_EMIOS1_CH7_H_I              NXP_SIUL2_PINMUX(4, 4, 358, 0, 109, 3)
#define PW7_EMIOS1_CH23_X_O             NXP_SIUL2_PINMUX(4, 4, 359, 4, 0, 0)
#define PW7_EMIOS1_CH23_X_I             NXP_SIUL2_PINMUX(4, 4, 359, 0, 125, 4)
#define PW8_EMIOS1_CH22_X_O             NXP_SIUL2_PINMUX(4, 4, 360, 3, 0, 0)
#define PW8_EMIOS1_CH22_X_I             NXP_SIUL2_PINMUX(4, 4, 360, 0, 124, 3)
#define PW11_EMIOS1_CH11_H_O            NXP_SIUL2_PINMUX(4, 4, 363, 1, 0, 0)
#define PW11_EMIOS1_CH11_H_I            NXP_SIUL2_PINMUX(4, 4, 363, 0, 113, 3)

/* EMIOS_2 */
#define PT0_EMIOS2_CH10_H_O             NXP_SIUL2_PINMUX(4, 4, 304, 8, 0, 0)
#define PT0_EMIOS2_CH10_H_I             NXP_SIUL2_PINMUX(4, 4, 304, 0, 139, 1)
#define PT1_EMIOS2_CH11_H_O             NXP_SIUL2_PINMUX(4, 4, 305, 8, 0, 0)
#define PT1_EMIOS2_CH11_H_I             NXP_SIUL2_PINMUX(4, 4, 305, 0, 140, 1)
#define PT3_EMIOS2_CH2_H_O              NXP_SIUL2_PINMUX(4, 4, 307, 6, 0, 0)
#define PT3_EMIOS2_CH8_X_O              NXP_SIUL2_PINMUX(4, 4, 307, 8, 0, 0)
#define PT3_EMIOS2_CH2_H_I              NXP_SIUL2_PINMUX(4, 4, 307, 0, 131, 1)
#define PT3_EMIOS2_CH8_X_I              NXP_SIUL2_PINMUX(4, 4, 307, 0, 137, 2)
#define PT4_EMIOS2_CH9_H_O              NXP_SIUL2_PINMUX(4, 4, 308, 2, 0, 0)
#define PT4_EMIOS2_CH9_H_I              NXP_SIUL2_PINMUX(4, 4, 308, 0, 138, 1)
#define PT6_EMIOS2_CH15_H_O             NXP_SIUL2_PINMUX(4, 4, 310, 3, 0, 0)
#define PT6_EMIOS2_CH15_H_I             NXP_SIUL2_PINMUX(4, 4, 310, 0, 144, 2)
#define PT7_EMIOS2_CH14_H_O             NXP_SIUL2_PINMUX(4, 4, 311, 4, 0, 0)
#define PT7_EMIOS2_CH14_H_I             NXP_SIUL2_PINMUX(4, 4, 311, 0, 143, 1)
#define PT8_EMIOS2_CH7_H_O              NXP_SIUL2_PINMUX(4, 4, 312, 6, 0, 0)
#define PT8_EMIOS2_CH7_H_I              NXP_SIUL2_PINMUX(4, 4, 312, 0, 136, 1)
#define PT9_EMIOS2_CH0_X_O              NXP_SIUL2_PINMUX(4, 4, 313, 5, 0, 0)
#define PT9_EMIOS2_CH0_X_I              NXP_SIUL2_PINMUX(4, 4, 313, 0, 129, 1)
#define PT10_EMIOS2_CH4_H_O             NXP_SIUL2_PINMUX(4, 4, 314, 8, 0, 0)
#define PT10_EMIOS2_CH4_H_I             NXP_SIUL2_PINMUX(4, 4, 314, 0, 133, 1)
#define PT12_EMIOS2_CH3_H_O             NXP_SIUL2_PINMUX(4, 4, 316, 5, 0, 0)
#define PT12_EMIOS2_CH16_X_O            NXP_SIUL2_PINMUX(4, 4, 316, 7, 0, 0)
#define PT12_EMIOS2_CH3_H_I             NXP_SIUL2_PINMUX(4, 4, 316, 0, 132, 1)
#define PT12_EMIOS2_CH16_X_I            NXP_SIUL2_PINMUX(4, 4, 316, 0, 145, 2)
#define PT14_EMIOS2_CH6_H_O             NXP_SIUL2_PINMUX(4, 4, 318, 7, 0, 0)
#define PT14_EMIOS2_CH6_H_I             NXP_SIUL2_PINMUX(4, 4, 318, 0, 135, 1)
#define PT15_EMIOS2_CH22_X_O            NXP_SIUL2_PINMUX(4, 4, 319, 4, 0, 0)
#define PT15_EMIOS2_CH4_H_O             NXP_SIUL2_PINMUX(4, 4, 319, 5, 0, 0)
#define PT15_EMIOS2_CH4_H_I             NXP_SIUL2_PINMUX(4, 4, 319, 0, 133, 2)
#define PT15_EMIOS2_CH22_X_I            NXP_SIUL2_PINMUX(4, 4, 319, 0, 151, 1)
#define PU0_EMIOS2_CH8_X_O              NXP_SIUL2_PINMUX(4, 4, 320, 4, 0, 0)
#define PU0_EMIOS2_CH2_H_O              NXP_SIUL2_PINMUX(4, 4, 320, 5, 0, 0)
#define PU0_EMIOS2_CH2_H_I              NXP_SIUL2_PINMUX(4, 4, 320, 0, 131, 2)
#define PU0_EMIOS2_CH8_X_I              NXP_SIUL2_PINMUX(4, 4, 320, 0, 137, 1)
#define PU2_EMIOS2_CH18_Y_O             NXP_SIUL2_PINMUX(4, 4, 322, 5, 0, 0)
#define PU2_EMIOS2_CH18_Y_I             NXP_SIUL2_PINMUX(4, 4, 322, 0, 147, 1)
#define PU3_EMIOS2_CH17_Y_O             NXP_SIUL2_PINMUX(4, 4, 323, 2, 0, 0)
#define PU3_EMIOS2_CH17_Y_I             NXP_SIUL2_PINMUX(4, 4, 323, 0, 146, 1)
#define PU4_EMIOS2_CH23_X_O             NXP_SIUL2_PINMUX(4, 4, 324, 3, 0, 0)
#define PU4_EMIOS2_CH6_H_O              NXP_SIUL2_PINMUX(4, 4, 324, 6, 0, 0)
#define PU4_EMIOS2_CH6_H_I              NXP_SIUL2_PINMUX(4, 4, 324, 0, 135, 3)
#define PU4_EMIOS2_CH23_X_I             NXP_SIUL2_PINMUX(4, 4, 324, 0, 152, 1)
#define PU5_EMIOS2_CH16_X_O             NXP_SIUL2_PINMUX(4, 4, 325, 4, 0, 0)
#define PU5_EMIOS2_CH3_H_O              NXP_SIUL2_PINMUX(4, 4, 325, 6, 0, 0)
#define PU5_EMIOS2_CH3_H_I              NXP_SIUL2_PINMUX(4, 4, 325, 0, 132, 2)
#define PU5_EMIOS2_CH16_X_I             NXP_SIUL2_PINMUX(4, 4, 325, 0, 145, 1)
#define PU7_EMIOS2_CH21_Y_O             NXP_SIUL2_PINMUX(4, 4, 327, 8, 0, 0)
#define PU7_EMIOS2_CH21_Y_I             NXP_SIUL2_PINMUX(4, 4, 327, 0, 150, 1)
#define PU8_EMIOS2_CH19_Y_O             NXP_SIUL2_PINMUX(4, 4, 328, 8, 0, 0)
#define PU8_EMIOS2_CH19_Y_I             NXP_SIUL2_PINMUX(4, 4, 328, 0, 148, 1)
#define PU9_EMIOS2_CH5_H_O              NXP_SIUL2_PINMUX(4, 4, 329, 10, 0, 0)
#define PU9_EMIOS2_CH5_H_I              NXP_SIUL2_PINMUX(4, 4, 329, 0, 134, 1)
#define PU10_EMIOS2_CH13_H_O            NXP_SIUL2_PINMUX(4, 4, 330, 3, 0, 0)
#define PU10_EMIOS2_CH13_H_I            NXP_SIUL2_PINMUX(4, 4, 330, 0, 142, 2)
#define PU11_EMIOS2_CH12_H_O            NXP_SIUL2_PINMUX(4, 4, 331, 2, 0, 0)
#define PU11_EMIOS2_CH12_H_I            NXP_SIUL2_PINMUX(4, 4, 331, 0, 141, 1)
#define PU13_EMIOS2_CH20_Y_O            NXP_SIUL2_PINMUX(4, 4, 333, 6, 0, 0)
#define PU13_EMIOS2_CH20_Y_I            NXP_SIUL2_PINMUX(4, 4, 333, 0, 149, 1)
#define PU14_EMIOS2_CH0_X_O             NXP_SIUL2_PINMUX(4, 4, 334, 4, 0, 0)
#define PU14_EMIOS2_CH1_H_O             NXP_SIUL2_PINMUX(4, 4, 334, 9, 0, 0)
#define PU14_EMIOS2_CH0_X_I             NXP_SIUL2_PINMUX(4, 4, 334, 0, 129, 2)
#define PU14_EMIOS2_CH1_H_I             NXP_SIUL2_PINMUX(4, 4, 334, 0, 130, 1)
#define PV0_EMIOS2_CH0_X_O              NXP_SIUL2_PINMUX(4, 4, 336, 1, 0, 0)
#define PV0_EMIOS2_CH0_X_I              NXP_SIUL2_PINMUX(4, 4, 336, 0, 129, 3)
#define PV1_EMIOS2_CH8_X_O              NXP_SIUL2_PINMUX(4, 4, 337, 1, 0, 0)
#define PV1_EMIOS2_CH8_X_I              NXP_SIUL2_PINMUX(4, 4, 337, 0, 137, 3)
#define PV2_EMIOS2_CH16_X_O             NXP_SIUL2_PINMUX(4, 4, 338, 1, 0, 0)
#define PV2_EMIOS2_CH16_X_I             NXP_SIUL2_PINMUX(4, 4, 338, 0, 145, 3)
#define PV3_EMIOS2_CH22_X_O             NXP_SIUL2_PINMUX(4, 4, 339, 1, 0, 0)
#define PV3_EMIOS2_CH22_X_I             NXP_SIUL2_PINMUX(4, 4, 339, 0, 151, 2)
#define PV4_EMIOS2_CH23_X_O             NXP_SIUL2_PINMUX(4, 4, 340, 1, 0, 0)
#define PV4_EMIOS2_CH23_X_I             NXP_SIUL2_PINMUX(4, 4, 340, 0, 152, 2)
#define PV8_EMIOS2_CH3_H_O              NXP_SIUL2_PINMUX(4, 4, 344, 2, 0, 0)
#define PV8_EMIOS2_CH3_H_I              NXP_SIUL2_PINMUX(4, 4, 344, 0, 132, 3)
#define PV9_EMIOS2_CH20_Y_O             NXP_SIUL2_PINMUX(4, 4, 345, 1, 0, 0)
#define PV9_EMIOS2_CH20_Y_I             NXP_SIUL2_PINMUX(4, 4, 345, 0, 149, 2)
#define PV10_EMIOS2_CH18_Y_O            NXP_SIUL2_PINMUX(4, 4, 346, 1, 0, 0)
#define PV10_EMIOS2_CH18_Y_I            NXP_SIUL2_PINMUX(4, 4, 346, 0, 147, 2)
#define PV11_EMIOS2_CH15_H_O            NXP_SIUL2_PINMUX(4, 4, 347, 1, 0, 0)
#define PV11_EMIOS2_CH15_H_I            NXP_SIUL2_PINMUX(4, 4, 347, 0, 144, 1)
#define PV13_EMIOS2_CH2_H_O             NXP_SIUL2_PINMUX(4, 4, 349, 3, 0, 0)
#define PV13_EMIOS2_CH2_H_I             NXP_SIUL2_PINMUX(4, 4, 349, 0, 131, 3)
#define PV14_EMIOS2_CH21_Y_O            NXP_SIUL2_PINMUX(4, 4, 350, 4, 0, 0)
#define PV14_EMIOS2_CH21_Y_I            NXP_SIUL2_PINMUX(4, 4, 350, 0, 150, 2)
#define PV15_EMIOS2_CH19_Y_O            NXP_SIUL2_PINMUX(4, 4, 351, 2, 0, 0)
#define PV15_EMIOS2_CH19_Y_I            NXP_SIUL2_PINMUX(4, 4, 351, 0, 148, 2)
#define PW0_EMIOS2_CH17_Y_O             NXP_SIUL2_PINMUX(4, 4, 352, 1, 0, 0)
#define PW0_EMIOS2_CH17_Y_I             NXP_SIUL2_PINMUX(4, 4, 352, 0, 146, 2)
#define PW1_EMIOS2_CH14_H_O             NXP_SIUL2_PINMUX(4, 4, 353, 1, 0, 0)
#define PW1_EMIOS2_CH14_H_I             NXP_SIUL2_PINMUX(4, 4, 353, 0, 143, 2)
#define PW2_EMIOS2_CH13_H_O             NXP_SIUL2_PINMUX(4, 4, 354, 1, 0, 0)
#define PW2_EMIOS2_CH13_H_I             NXP_SIUL2_PINMUX(4, 4, 354, 0, 142, 1)
#define PW3_EMIOS2_CH12_H_O             NXP_SIUL2_PINMUX(4, 4, 355, 1, 0, 0)
#define PW3_EMIOS2_CH12_H_I             NXP_SIUL2_PINMUX(4, 4, 355, 0, 141, 2)
#define PW4_EMIOS2_CH10_H_O             NXP_SIUL2_PINMUX(4, 4, 356, 1, 0, 0)
#define PW4_EMIOS2_CH10_H_I             NXP_SIUL2_PINMUX(4, 4, 356, 0, 139, 2)
#define PW5_EMIOS2_CH9_H_O              NXP_SIUL2_PINMUX(4, 4, 357, 1, 0, 0)
#define PW5_EMIOS2_CH9_H_I              NXP_SIUL2_PINMUX(4, 4, 357, 0, 138, 2)
#define PW6_EMIOS2_CH7_H_O              NXP_SIUL2_PINMUX(4, 4, 358, 1, 0, 0)
#define PW6_EMIOS2_CH7_H_I              NXP_SIUL2_PINMUX(4, 4, 358, 0, 136, 2)
#define PW7_EMIOS2_CH6_H_O              NXP_SIUL2_PINMUX(4, 4, 359, 1, 0, 0)
#define PW7_EMIOS2_CH6_H_I              NXP_SIUL2_PINMUX(4, 4, 359, 0, 135, 2)
#define PW8_EMIOS2_CH5_H_O              NXP_SIUL2_PINMUX(4, 4, 360, 1, 0, 0)
#define PW8_EMIOS2_CH5_H_I              NXP_SIUL2_PINMUX(4, 4, 360, 0, 134, 2)
#define PW9_EMIOS2_CH4_H_O              NXP_SIUL2_PINMUX(4, 4, 361, 2, 0, 0)
#define PW9_EMIOS2_CH4_H_I              NXP_SIUL2_PINMUX(4, 4, 361, 0, 133, 3)
#define PW10_EMIOS2_CH1_H_O             NXP_SIUL2_PINMUX(4, 4, 362, 1, 0, 0)
#define PW10_EMIOS2_CH1_H_I             NXP_SIUL2_PINMUX(4, 4, 362, 0, 130, 2)
#define PW11_EMIOS2_CH11_H_O            NXP_SIUL2_PINMUX(4, 4, 363, 2, 0, 0)
#define PW11_EMIOS2_CH11_H_I            NXP_SIUL2_PINMUX(4, 4, 363, 0, 140, 2)

/* ADC1 */
#define PT0_ADC1_MA2                    NXP_SIUL2_PINMUX(4, 4, 304, 9, 0, 0)
#define PT1_ADC1_MA0                    NXP_SIUL2_PINMUX(4, 4, 305, 9, 0, 0)
#define PT2_ADC1_MA1                    NXP_SIUL2_PINMUX(4, 4, 306, 6, 0, 0)
#define PT10_ADC1_MA1                   NXP_SIUL2_PINMUX(4, 4, 314, 6, 0, 0)
#define PT11_ADC1_MA0                   NXP_SIUL2_PINMUX(4, 4, 315, 4, 0, 0)
#define PU4_ADC1_MA0                    NXP_SIUL2_PINMUX(4, 4, 324, 7, 0, 0)
#define PU5_ADC1_MA1                    NXP_SIUL2_PINMUX(4, 4, 325, 7, 0, 0)
#define PU10_ADC1_MA1                   NXP_SIUL2_PINMUX(4, 4, 330, 6, 0, 0)
#define PU11_ADC1_MA0                   NXP_SIUL2_PINMUX(4, 4, 331, 4, 0, 0)
#define PU13_ADC1_MA2                   NXP_SIUL2_PINMUX(4, 4, 333, 3, 0, 0)
#define PV0_ADC1_MA0                    NXP_SIUL2_PINMUX(4, 4, 336, 2, 0, 0)
#define PV1_ADC1_MA1                    NXP_SIUL2_PINMUX(4, 4, 337, 2, 0, 0)
#define PV2_ADC1_MA2                    NXP_SIUL2_PINMUX(4, 4, 338, 2, 0, 0)
#define PV12_ADC1_MA0                   NXP_SIUL2_PINMUX(4, 4, 348, 7, 0, 0)
#define PV13_ADC1_MA1                   NXP_SIUL2_PINMUX(4, 4, 349, 5, 0, 0)
#define PV14_ADC1_MA2                   NXP_SIUL2_PINMUX(4, 4, 350, 3, 0, 0)

/* LPUART19 */
#define PT3_LPUART19_RX                 NXP_SIUL2_PINMUX(4, 4, 307, 0, 84, 1)
#define PT4_LPUART19_RX                 NXP_SIUL2_PINMUX(4, 4, 308, 0, 84, 2)
#define PT7_LPUART19_TX_O               NXP_SIUL2_PINMUX(4, 4, 311, 6, 0, 0)
#define PT7_LPUART19_TX_I               NXP_SIUL2_PINMUX(4, 4, 311, 0, 83, 1)
#define PT10_LPUART19_TX_O              NXP_SIUL2_PINMUX(4, 4, 314, 1, 0, 0)
#define PT10_LPUART19_TX_I              NXP_SIUL2_PINMUX(4, 4, 314, 0, 83, 2)
#define PT14_LPUART19_RX                NXP_SIUL2_PINMUX(4, 4, 318, 0, 84, 3)
#define PU14_LPUART19_TX_O              NXP_SIUL2_PINMUX(4, 4, 334, 2, 0, 0)
#define PU14_LPUART19_TX_I              NXP_SIUL2_PINMUX(4, 4, 334, 0, 83, 3)
#define PV1_LPUART19_TX_O               NXP_SIUL2_PINMUX(4, 4, 337, 5, 0, 0)
#define PV1_LPUART19_TX_I               NXP_SIUL2_PINMUX(4, 4, 337, 0, 83, 4)
#define PV5_LPUART19_RX                 NXP_SIUL2_PINMUX(4, 4, 341, 0, 84, 5)
#define PV6_LPUART19_RX                 NXP_SIUL2_PINMUX(4, 4, 342, 0, 84, 6)
#define PV7_LPUART19_TX_O               NXP_SIUL2_PINMUX(4, 4, 343, 2, 0, 0)
#define PV7_LPUART19_TX_I               NXP_SIUL2_PINMUX(4, 4, 343, 0, 83, 5)
#define PV12_LPUART19_RX                NXP_SIUL2_PINMUX(4, 4, 348, 0, 84, 4)
#define PW0_LPUART19_RX                 NXP_SIUL2_PINMUX(4, 4, 352, 0, 84, 7)
#define PW4_LPUART19_TX_O               NXP_SIUL2_PINMUX(4, 4, 356, 5, 0, 0)
#define PW4_LPUART19_TX_I               NXP_SIUL2_PINMUX(4, 4, 356, 0, 83, 6)

/* LPUART18 */
#define PT4_LPUART18_RX                 NXP_SIUL2_PINMUX(4, 4, 308, 0, 79, 1)
#define PT7_LPUART18_TX_O               NXP_SIUL2_PINMUX(4, 4, 311, 2, 0, 0)
#define PT7_LPUART18_TX_I               NXP_SIUL2_PINMUX(4, 4, 311, 0, 78, 1)
#define PU4_LPUART18_TX_O               NXP_SIUL2_PINMUX(4, 4, 324, 1, 0, 0)
#define PU4_LPUART18_TX_I               NXP_SIUL2_PINMUX(4, 4, 324, 0, 78, 2)
#define PU5_LPUART18_RX                 NXP_SIUL2_PINMUX(4, 4, 325, 0, 79, 2)
#define PU8_LPUART18_TX_O               NXP_SIUL2_PINMUX(4, 4, 328, 3, 0, 0)
#define PU8_LPUART18_TX_I               NXP_SIUL2_PINMUX(4, 4, 328, 0, 78, 3)
#define PU10_LPUART18_RX                NXP_SIUL2_PINMUX(4, 4, 330, 0, 79, 3)
#define PU11_LPUART18_TX_O              NXP_SIUL2_PINMUX(4, 4, 331, 8, 0, 0)
#define PU11_LPUART18_TX_I              NXP_SIUL2_PINMUX(4, 4, 331, 0, 78, 4)
#define PU13_LPUART18_RX                NXP_SIUL2_PINMUX(4, 4, 333, 0, 79, 4)
#define PW3_LPUART18_RX                 NXP_SIUL2_PINMUX(4, 4, 355, 0, 79, 5)
#define PW7_LPUART18_RX                 NXP_SIUL2_PINMUX(4, 4, 359, 0, 79, 6)
#define PW8_LPUART18_TX_O               NXP_SIUL2_PINMUX(4, 4, 360, 2, 0, 0)
#define PW8_LPUART18_TX_I               NXP_SIUL2_PINMUX(4, 4, 360, 0, 78, 5)

/* LPI2C3 */
#define PT5_LPI2C3_SCL_O                NXP_SIUL2_PINMUX(4, 4, 309, 2, 0, 0)
#define PT5_LPI2C3_SCL_I                NXP_SIUL2_PINMUX(4, 4, 309, 0, 66, 1)
#define PT6_LPI2C3_HREQ                 NXP_SIUL2_PINMUX(4, 4, 310, 0, 65, 1)
#define PT8_LPI2C3_SCL_O                NXP_SIUL2_PINMUX(4, 4, 312, 7, 0, 0)
#define PT8_LPI2C3_SCL_I                NXP_SIUL2_PINMUX(4, 4, 312, 0, 66, 2)
#define PT9_LPI2C3_SDA_O                NXP_SIUL2_PINMUX(4, 4, 313, 6, 0, 0)
#define PT9_LPI2C3_SDA_I                NXP_SIUL2_PINMUX(4, 4, 313, 0, 68, 1)
#define PT11_LPI2C3_SDA_O               NXP_SIUL2_PINMUX(4, 4, 315, 2, 0, 0)
#define PT11_LPI2C3_SDA_I               NXP_SIUL2_PINMUX(4, 4, 315, 0, 68, 2)
#define PT12_LPI2C3_SCL_O               NXP_SIUL2_PINMUX(4, 4, 316, 6, 0, 0)
#define PT12_LPI2C3_SCL_I               NXP_SIUL2_PINMUX(4, 4, 316, 0, 66, 3)
#define PU2_LPI2C3_HREQ                 NXP_SIUL2_PINMUX(4, 4, 322, 0, 65, 2)
#define PU4_LPI2C3_HREQ                 NXP_SIUL2_PINMUX(4, 4, 324, 0, 65, 3)
#define PU8_LPI2C3_SDA_O                NXP_SIUL2_PINMUX(4, 4, 328, 1, 0, 0)
#define PU8_LPI2C3_SDA_I                NXP_SIUL2_PINMUX(4, 4, 328, 0, 68, 3)
#define PU12_LPI2C3_SDAS_O              NXP_SIUL2_PINMUX(4, 4, 332, 6, 0, 0)
#define PU12_LPI2C3_SDAS_I              NXP_SIUL2_PINMUX(4, 4, 332, 0, 69, 1)
#define PU13_LPI2C3_SCLS_O              NXP_SIUL2_PINMUX(4, 4, 333, 9, 0, 0)
#define PU13_LPI2C3_SCLS_I              NXP_SIUL2_PINMUX(4, 4, 333, 0, 67, 1)
#define PV3_LPI2C3_SDA_O                NXP_SIUL2_PINMUX(4, 4, 339, 2, 0, 0)
#define PV3_LPI2C3_SDA_I                NXP_SIUL2_PINMUX(4, 4, 339, 0, 68, 5)
#define PV4_LPI2C3_SCL_O                NXP_SIUL2_PINMUX(4, 4, 340, 2, 0, 0)
#define PV4_LPI2C3_SCL_I                NXP_SIUL2_PINMUX(4, 4, 340, 0, 66, 5)
#define PV5_LPI2C3_HREQ                 NXP_SIUL2_PINMUX(4, 4, 341, 0, 65, 5)
#define PW3_LPI2C3_SDA_O                NXP_SIUL2_PINMUX(4, 4, 355, 3, 0, 0)
#define PW3_LPI2C3_SDA_I                NXP_SIUL2_PINMUX(4, 4, 355, 0, 68, 4)
#define PW5_LPI2C3_SCL_O                NXP_SIUL2_PINMUX(4, 4, 357, 3, 0, 0)
#define PW5_LPI2C3_SCL_I                NXP_SIUL2_PINMUX(4, 4, 357, 0, 66, 4)
#define PW7_LPI2C3_HREQ                 NXP_SIUL2_PINMUX(4, 4, 359, 0, 65, 4)
#define PW11_LPI2C3_SDA_O               NXP_SIUL2_PINMUX(4, 4, 363, 4, 0, 0)
#define PW11_LPI2C3_SDA_I               NXP_SIUL2_PINMUX(4, 4, 363, 0, 68, 6)

