zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-437BGA-pinctrl.h
/* LPUART20 */
#define PT6_LPUART20_RX                 NXP_SIUL2_PINMUX(4, 4, 310, 0, 89, 1)
#define PT12_LPUART20_TX_O              NXP_SIUL2_PINMUX(4, 4, 316, 2, 0, 0)
#define PT12_LPUART20_TX_I              NXP_SIUL2_PINMUX(4, 4, 316, 0, 88, 1)
#define PT15_LPUART20_RX                NXP_SIUL2_PINMUX(4, 4, 319, 0, 89, 2)
#define PU1_LPUART20_RX                 NXP_SIUL2_PINMUX(4, 4, 321, 0, 89, 3)
#define PU2_LPUART20_TX_O               NXP_SIUL2_PINMUX(4, 4, 322, 1, 0, 0)
#define PU2_LPUART20_TX_I               NXP_SIUL2_PINMUX(4, 4, 322, 0, 88, 2)
#define PU3_LPUART20_TX_O               NXP_SIUL2_PINMUX(4, 4, 323, 1, 0, 0)
#define PU3_LPUART20_TX_I               NXP_SIUL2_PINMUX(4, 4, 323, 0, 88, 3)
#define PV11_LPUART20_TX_O              NXP_SIUL2_PINMUX(4, 4, 347, 3, 0, 0)
#define PV11_LPUART20_TX_I              NXP_SIUL2_PINMUX(4, 4, 347, 0, 88, 4)
#define PW2_LPUART20_RX                 NXP_SIUL2_PINMUX(4, 4, 354, 0, 89, 4)
#define PW3_LPUART20_TX_O               NXP_SIUL2_PINMUX(4, 4, 355, 4, 0, 0)
#define PW3_LPUART20_TX_I               NXP_SIUL2_PINMUX(4, 4, 355, 0, 88, 5)
#define PW5_LPUART20_RX                 NXP_SIUL2_PINMUX(4, 4, 357, 0, 89, 5)

/* HSE2 */
#define PT12_HSE2_BBSM_OUTPUT           NXP_SIUL2_PINMUX(4, 4, 316, 9, 0, 0)
#define PT13_HSE2_BBSM_OUTPUT           NXP_SIUL2_PINMUX(4, 4, 317, 8, 0, 0)
#define PU3_HSE2_BBSM_OUTPUT            NXP_SIUL2_PINMUX(4, 4, 323, 6, 0, 0)
#define PU4_HSE2_BBSM_OUTPUT            NXP_SIUL2_PINMUX(4, 4, 324, 8, 0, 0)

#endif /* HAL_NXP_DTS_NXP_S32_S32K56X_437BGA_PINCTRL_H_ */
